[
    {
      "name": "Abecma",
      "description": " Abecma (idecabtagene vicleucel) is an autologous, one-time CAR T-cell therapy that reprograms a patients own T cells to target and eliminate relapsed or refractory multiple myeloma cells in adults.",
      "alternate_names": ["Idecabtagene vicleuce"],
      "mechanism_of_action": "The T cells are engineered in a laboratory to express a chimeric antigen receptor (CAR), which specifically recognizes B-cell maturation antigen (BCMA), a protein found on multiple myeloma cells. Once infused back into the patient, these modified T cells seek out and bind to BCMA-expressing myeloma cells. Upon binding, the CAR T cells become activated, triggering an immune response that leads to the destruction of multiple myeloma cells through cytotoxic mechanisms."
    },
    {
      "name": "Abilify",
      "description": "Abilify (aripiprazole) is an atypical antipsychotic that modulates dopamine and serotonin activity, used to treat schizophrenia (≥13 years), bipolar I disorder (≥10 years), major depressive disorder (adjunct in adults), Tourette’s disorder (≥6 years), and irritability associated with autistic disorder (≥6 years).",
      "alternate_names": ["aripiprazole", "Abilify Maintena (long-acting injectable)", "Aristada (extended-release injectable)"],
      "mechanism_of_action": "Acts as a partial agonist at dopamine D2 receptors and serotonin 5-HT1a receptors, stabilizing dopamine activity in mesolimbic and mesocortical pathways. Functions as an antagonist at serotonin 5-HT₂ₐ receptors, modulating serotonin signaling to improve mood and cognitive symptoms. This dual activity balances excessive dopamine in psychosis-prone brain regions while enhancing dopamine signaling in areas linked to motivation and cognition, earning it the label: dopamine system stabilizer."
    },
    {
      "name": "Abiraterone",
      "description": "Abiraterone is used in combination with other steroids to treat metastatic castration-resistant prostate cancer (mCRPC) and metastatic high-risk castration-sensitive prostate cancer, both of which are advanced forms of prostate cancer that have spread beyond the prostate gland and are resistant or sensitive to hormonal therapies that lower testosterone. Abiraterone works by reducing androgen production in the body.",
      "alternate_names": ["abiraterone acetate (generic)", "Zytiga", "Yonsa", "Abirtega", "Akeega (when combined with niraparib)"],
      "mechanism_of_action": "Abiraterone is an androgen biosynthesis inhibitor that selectively and irreversibly inhibits the enzyme CYP17A1 (17α-hydroxylase/17,20-lyase), a key enzyme in androgen production in the testes, adrenal glands, and prostate tumor tissue; this inhibition blocks the synthesis of androgens (including testosterone and dihydrotestosterone), thereby depriving prostate cancer cells of the hormones that drive their growth and survival."
    },
    {
      "name": "Acetaminophen",
      "description": "Acetaminophen (also known as paracetamol) is widely used to relieve mild to moderate pain (such as headache, backache, toothache, muscular aches, minor arthritis pain, and menstrual cramps) and to reduce fever.",
      "alternate_names": ["paracetamol", "APAP (N-acetyl-para-aminophenol)", "Tylenol", "Panadol", "Excedrin", "Calpol", "Panamax", "Crocin", "Dafalgan", "Efferalgan"],
      "mechanism_of_action": "Acetaminophen acts primarily in the central nervous system, where it inhibits the cyclooxygenase (COX) pathway-mainly by noncompetitively blocking the peroxidase site of COX enzymes-thereby reducing the synthesis of prostaglandins involved in pain and fever signaling. Unlike NSAIDs, acetaminophen has minimal effect on peripheral COX enzymes and thus lacks significant anti-inflammatory activity. Additionally, its analgesic effect may be enhanced by its metabolite AM404, which activates cannabinoid (CB1) and TRPV1 receptors in the brain and spinal cord, further modulating pain transmission."
    },
    {
        "name": "Acetazolamide",
        "description": "Acetazolamide is used to treat glaucoma (to lower intraocular pressure), idiopathic intracranial hypertension, certain types of epilepsy, edema (fluid retention) due to heart failure or medications, and to prevent or reduce symptoms of altitude (mountain) sickness.",
        "alternate_names": ["Diamox", "Diamox Sequels", "Acetamox", "Nephramide", "Phonurit", "Donmox", "Glaupax", "Diacarb"],
        "mechanism_of_action": "Acetazolamide is a carbonic anhydrase inhibitor that blocks the enzyme carbonic anhydrase in the proximal tubule of the kidney and other tissues, leading to decreased reabsorption of bicarbonate, sodium, and chloride, resulting in increased urinary excretion of these ions and water; this causes urine alkalinization, systemic metabolic acidosis, and reductions in intraocular pressure, intracranial pressure, and edema. In the central nervous system, acetazolamide’s inhibition of carbonic anhydrase alters neuronal excitability by acidifying the internal milieu, modulating GABAergic signaling and ion channel activity, which contributes to its anticonvulsant effects."
      },
      {
        "name": "Acetylcysteine",
        "description": "Acetylcysteine (N-acetylcysteine, NAC) is primarily used as an antidote for acetaminophen (paracetamol) overdose to prevent or reduce liver damage, and as a mucolytic agent to loosen thick mucus in respiratory conditions such as chronic obstructive pulmonary disease (COPD), cystic fibrosis, pneumonia, and bronchitis. It is also used off-label for a variety of other indications, including prevention of contrast-induced nephropathy, acute hepatic failure, and certain psychiatric and neurological conditions",
        "alternate_names": ["N-acetylcysteine", "NAC", "Acetadote", "Cetylev", "Mucomyst", "Fluimucil", "Parvolex"],
        "mechanism_of_action": "Acetylcysteine acts as a precursor to glutathione, replenishing depleted glutathione stores in the liver during acetaminophen overdose, which enables detoxification of the toxic metabolite NAPQI and prevents cellular injury. As a mucolytic, acetylcysteine’s free sulfhydryl groups break disulfide bonds in mucoproteins, reducing mucus viscosity and facilitating its clearance from the airways. Additionally, acetylcysteine has antioxidant properties, directly scavenging free radicals and modulating intracellular redox states, which may contribute to its protective effects in various tissues."
      },
      {
        "name": "Actemra",
        "description": "Actemra is indicated for the treatment of moderate to severe rheumatoid arthritis in adults, giant cell arteritis, systemic sclerosis-associated interstitial lung disease (SSc-ILD), polyarticular juvenile idiopathic arthritis (PJIA), systemic juvenile idiopathic arthritis (SJIA) in children aged 2 years and older, severe or life-threatening cytokine release syndrome (CRS) associated with CAR T-cell therapy, and for hospitalized adults with COVID-19 who require supplemental oxygen or mechanical ventilation.",
        "alternate_names": ["tocilizumab (generic)", "Roactemra"],
        "mechanism_of_action": "Actemra is a recombinant humanized monoclonal antibody that binds to both soluble and membrane-bound interleukin-6 (IL-6) receptors (sIL-6R and mIL-6R), thereby inhibiting IL-6-mediated signaling; this blockade reduces the pro-inflammatory and immune-activating effects of IL-6, a cytokine central to the pathogenesis of autoimmune and inflammatory diseases such as rheumatoid arthritis and giant cell arteritis."
      },
      {
        "name": "Actos",
        "description": "Actos (pioglitazone) is prescribed to improve blood sugar control in adults with type 2 diabetes mellitus, typically as an adjunct to diet and exercise, and may be used alone or in combination with other antidiabetic medications; it is not indicated for type 1 diabetes or diabetic ketoacidosis.",
        "alternate_names": ["pioglitazone (generic)"],
        "mechanism_of_action": "Actos is a thiazolidinedione that acts as a potent and selective agonist for peroxisome proliferator-activated receptor gamma (PPARγ), a nuclear receptor predominantly expressed in adipose tissue, skeletal muscle, and liver; activation of PPARγ modulates transcription of insulin-responsive genes, leading to increased insulin sensitivity in peripheral tissues, enhanced glucose uptake by muscle and fat cells, decreased hepatic glucose production, and improved glycemic control without stimulating insulin secretion."
      },
      {
        "name": "Acyclovir",
        "description": "Acyclovir is an antiviral medication used to treat infections caused by herpes viruses, including herpes simplex virus types 1 and 2 (causing genital herpes and cold sores), varicella-zoster virus (causing chickenpox and shingles), and is also used to prevent and treat herpes infections in immunocompromised patients.",
        "alternate_names": ["aciclovir", "acycloguanosine", "Zovirax", "Sitavig (buccal tablet)"],
        "mechanism_of_action": "Acyclovir is a synthetic nucleoside analogue that, after being selectively phosphorylated by viral thymidine kinase to acyclovir monophosphate and further converted by host cell enzymes to acyclovir triphosphate, inhibits viral DNA synthesis by competitively inhibiting viral DNA polymerase, incorporating into viral DNA to cause chain termination, and inactivating the viral DNA polymerase enzyme."
      },
      {
        "name": "Adderall",
        "description": "Adderall is prescribed for the treatment of attention deficit hyperactivity disorder (ADHD) in children and adults, as well as narcolepsy, a sleep disorder characterized by excessive daytime sleepiness.",
        "alternate_names": ["amphetamin", "dextroamphetamine", "Adderall", "Adderall XR", "Mydayis" ],
        "mechanism_of_action": "Adderall is a central nervous system stimulant composed of mixed amphetamine salts (dextroamphetamine and levoamphetamine) that increases the synaptic concentrations of dopamine and norepinephrine by promoting their release from presynaptic neurons and inhibiting their reuptake; this is achieved through actions on monoamine transporters (DAT, NET), vesicular monoamine transporter 2 (VMAT2), and trace amine-associated receptor 1 (TAAR1), ultimately enhancing neurotransmission in brain regions responsible for attention, alertness, and impulse control."
      },
      {
        "name": "Advair Diskus",
        "description": "Advair Diskus is a combination inhaler prescribed for the maintenance treatment of asthma in adults and children aged 4 years and older, and for the long-term management of chronic obstructive pulmonary disease (COPD), including chronic bronchitis and emphysema, to improve breathing and reduce the frequency of exacerbations; it is not intended for the relief of acute bronchospasm or as a rescue inhaler.",
        "alternate_names": ["fluticasone propionate", "salmeterol", "Advair HFA", "AirDuo RespiClick"],
        "mechanism_of_action": "Advair Diskus combines fluticasone propionate, an inhaled corticosteroid (ICS) that acts as a potent glucocorticoid receptor agonist to suppress airway inflammation, and salmeterol, a long-acting beta2-adrenergic agonist (LABA) that stimulates beta2 receptors in bronchial smooth muscle, leading to prolonged bronchodilation; together, these actions reduce airway swelling and relax airway muscles, improving airflow and controlling chronic respiratory symptoms."
      },
      {
        "name": "Advil",
        "description": "Advil (ibuprofen) is a nonsteroidal anti-inflammatory drug (NSAID) used to relieve mild to moderate pain from conditions such as headaches, muscle aches, backaches, menstrual cramps, dental pain, minor arthritis, and to reduce fever and inflammation.",
        "alternate_names": ["ibuprofen", "Advil", "Motrin", "Midol", "Nuprin", "Genpril", "Ibu-Tab", "Addaprin", "Caldolor"],
        "mechanism_of_action": "Ibuprofen is a non-selective inhibitor of cyclooxygenase (COX-1 and COX-2) enzymes, blocking the conversion of arachidonic acid to prostaglandins and thromboxanes, thereby reducing the synthesis of mediators responsible for pain, inflammation, and fever."
      },
      {
        "name": "Afinitor",
        "description": "Afinitor (everolimus) is used to treat several types of advanced cancers and tumors, including hormone receptor-positive, HER2-negative breast cancer (in combination with exemestane), advanced renal cell carcinoma (kidney cancer), progressive neuroendocrine tumors of pancreatic, gastrointestinal, or lung origin, and certain brain tumors (subependymal giant cell astrocytoma, SEGA) and kidney tumors (renal angiomyolipoma) associated with tuberous sclerosis complex (TSC). It is also indicated as adjunctive therapy for partial-onset seizures in TSC patients.",
        "alternate_names": ["everolimus", "Afinitor", "Afinitor Disperz", "Votubia", "Certican", "Zortress (for transplant indications)"],
        "mechanism_of_action": "Afinitor is an mTOR inhibitor: it binds to the protein FKBP-12 to form a complex that inhibits the activity of mammalian target of rapamycin (mTOR), a kinase involved in cell growth, proliferation, metabolism, and angiogenesis. By blocking mTOR, Afinitor reduces cancer cell proliferation, glucose uptake, and the formation of new blood vessels (angiogenesis), thereby slowing tumor growth and spread."
      },
      {
        "name": "Agamree",
        "description": "Agamree (vamorolone) is indicated for the treatment of Duchenne muscular dystrophy (DMD) in patients aged 2 years and older, a rare genetic disorder characterized by progressive muscle weakness and degeneration.",
        "alternate_names": ["vamorolone"],
        "mechanism_of_action": "Agamree is a first-in-class dissociative corticosteroid that binds to both glucocorticoid and mineralocorticoid receptors, exerting anti-inflammatory and immunosuppressive effects primarily through inhibition of nuclear factor κB (NF-κB) proinflammatory pathways, while exhibiting reduced activation of genes responsible for typical corticosteroid side effects and acting as a potent mineralocorticoid receptor antagonist; this unique profile aims to retain muscle-protective benefits and minimize adverse effects commonly seen with traditional corticosteroids."
      },
      {
        "name": "Aimovig",
        "description": "Aimovig (erenumab-aooe) is a prescription medication used for the preventive treatment of migraine in adults, helping to reduce the frequency and severity of migraine attacks.",
        "alternate_names": ["erenumab", "AMG-334"],
        "mechanism_of_action": "Aimovig is a fully human monoclonal antibody that selectively binds to and blocks the calcitonin gene-related peptide receptor (CGRPR), preventing the activity of CGRP-a protein that promotes inflammation and vasodilation in the brain, both of which are implicated in the onset and maintenance of migraine attacks-thereby reducing the likelihood and severity of migraine episodes."
      },
      {
        "name": "Ajovy",
        "description": "Ajovy is prescribed for the preventive treatment of migraine in adults, helping to reduce the frequency and severity of both episodic and chronic migraine attacks.",
        "alternate_names": ["fremanezumab-vfrm"],
        "mechanism_of_action": "Ajovy is a monoclonal antibody that targets and binds to the calcitonin gene-related peptide (CGRP) ligand, blocking its interaction with CGRP receptors; this inhibition prevents CGRP-induced vasodilation and inflammation in the brain, key processes believed to trigger migraine attacks, thereby reducing the likelihood and intensity of migraine."
      },
      {
        "name": "Albuterol",
        "description": "Albuterol is used to treat or prevent bronchospasm (narrowing of the airways) in patients with asthma, chronic obstructive pulmonary disease (COPD), bronchitis, emphysema, and other lung diseases, as well as to prevent exercise-induced bronchospasm.",
        "alternate_names": ["ProAir HFA", "RespiClick", "ProAir Digihaler", "Proventil HFA", "Ventolin HFA", "Accuneb", "ReliOn Ventolin HFA", "Ventolin Inhaler"],
        "mechanism_of_action": "Albuterol is a selective beta2-adrenergic receptor agonist that works by stimulating beta2 receptors in bronchial smooth muscle, activating the Gs-adenylyl cyclase-cAMP signaling pathway, which leads to relaxation of airway smooth muscle and bronchodilation; this increases airflow and relieves symptoms such as wheezing and shortness of breath. Additionally, albuterol inhibits inflammatory cell activity in the airways by increasing intracellular cAMP, thereby reducing the release of inflammatory mediators and further contributing to its therapeutic effects."
      },
      {
        "name": "Aldactone",
        "description": "Aldactone is used to treat high blood pressure (hypertension), heart failure (especially with reduced ejection fraction), edema (swelling) due to heart, liver, or kidney disease, primary hyperaldosteronism (a condition of excessive aldosterone production), and low potassium levels (hypokalemia); it is also used off-label for conditions such as hirsutism, female pattern hair loss, and adult acne.",
        "alternate_names": ["spironolactone", "Carospir", "Aldactazide (combination with hydrocholorothiazide)"],
        "mechanism_of_action": "Aldactone is a potassium-sparing diuretic and mineralocorticoid receptor antagonist that competitively blocks aldosterone from binding to its receptors in the distal renal tubules and collecting ducts, leading to increased excretion of sodium and water while retaining potassium; this antagonism reduces blood volume and vascular stiffness, lowers blood pressure, relieves fluid overload, and counters the effects of excess aldosterone in conditions like heart failure and hyperaldosteronism."
      },
      {
        "name": "Alecensa",
        "description": "Alecensa is used to treat adults with non-small cell lung cancer (NSCLC) that is positive for an abnormal anaplastic lymphoma kinase (ALK) gene, specifically for metastatic (advanced) ALK-positive NSCLC and as adjuvant therapy to help prevent cancer recurrence after surgical removal of the tumor.",
        "alternate_names": ["alectinib"],
        "mechanism_of_action": "Alecensa is a selective tyrosine kinase inhibitor that targets and blocks the activity of anaplastic lymphoma kinase (ALK) and, to a lesser extent, RET kinases; by inhibiting ALK, which is abnormally activated in certain NSCLC cells, Alecensa disrupts downstream signaling pathways responsible for tumor cell growth, proliferation, and survival, thereby slowing or stopping the progression of ALK-positive lung cancer."
      },
      {
        "name": "Alendronate",
        "description": "Alendronate is used to treat and prevent osteoporosis in postmenopausal women and men, osteoporosis caused by long-term corticosteroid use, and Paget’s disease of bone, helping to strengthen bones and reduce the risk of fractures.",
        "alternate_names": ["alendronic acid", "Fosamax", "Binosto"],
        "mechanism_of_action": "Alendronate is a bisphosphonate that binds to hydroxyapatite in bone and is taken up by osteoclasts during bone resorption; it inhibits farnesyl pyrophosphate synthase in the mevalonate pathway, disrupting osteoclast function and promoting their apoptosis, thereby reducing bone breakdown, increasing bone density, and lowering fracture risk."
      },
      {
        "name": "Allegra",
        "description": "Allegra is used to relieve symptoms of seasonal allergies (hay fever) such as sneezing, runny nose, itchy or watery eyes, and is also indicated for chronic idiopathic urticaria, a condition characterized by persistent hives and itching in adults and children.",
        "alternate_names": ["fexofenadine", "Allegra ODT"],
        "mechanism_of_action": "Allegra (fexofenadine) is a second-generation antihistamine that selectively blocks peripheral histamine H1 receptors, preventing histamine from binding and triggering allergic symptoms such as inflammation, itching, and swelling, while not crossing the blood-brain barrier, thus minimizing sedation and central nervous system effects."
      },
      {
        "name": "Allopurinol",
        "description": "Allopurinol is used to prevent gout attacks by lowering uric acid levels in the blood, treat recurrent kidney stones associated with high uric acid, and manage elevated uric acid in patients undergoing cancer chemotherapy (to prevent tumor lysis syndrome).",
        "alternate_names": ["Zyloprim", "Aloprim", "Lopurin", "Allohexal", "Allosig", "Milurit", "Alloril", "Progout", "Zyloric", "Zyrik"],
        "mechanism_of_action": "Allopurinol is a purine analog and xanthine oxidase inhibitor; it and its active metabolite oxipurinol block the enzyme xanthine oxidase, preventing the conversion of hypoxanthine and xanthine to uric acid, thereby reducing uric acid production and serum levels. This inhibition also increases the salvage of hypoxanthine and xanthine for nucleotide synthesis, which provides feedback inhibition of purine biosynthesis, further lowering uric acid formation."
      },
      {
        "name": "Alprazolam",
        "description": "Alprazolam is primarily prescribed for the management of anxiety disorders, including generalized anxiety disorder (GAD) and panic disorder (with or without agoraphobia); it may also be used off-label for conditions such as depression, premenstrual syndrome, and insomnia.",
        "alternate_names": ["Xanax", "Xanax XR"],
        "mechanism_of_action": "Alprazolam is a high-potency benzodiazepine that binds to a specific site on the GABA-A receptor complex in the central nervous system, acting as a positive allosteric modulator to enhance the inhibitory effect of the neurotransmitter GABA; this increases chloride ion influx into neurons, hyperpolarizing them and making them less excitable, which produces its anxiolytic, sedative, muscle relaxant, and anticonvulsant effects."
      },
      {
        "name": "Amantadine",
        "description": "Amantadine is used to treat symptoms of Parkinson’s disease and drug-induced extrapyramidal symptoms (movement disorders), as well as for the prevention and treatment of influenza A virus infections, though resistance limits its current use for flu.",
        "alternate_names": ["Gocovri", "Symmetrel", "Symadine"],
        "mechanism_of_action": "Amantadine’s antiparkinsonian effects are thought to result from a combination of weak antagonism of NMDA-type glutamate receptors, increased dopamine release, inhibition of dopamine reuptake, and agonism at sigma-1 receptors, collectively enhancing dopaminergic signaling in the brain and reducing movement symptoms. As an antiviral, amantadine blocks the M2 ion channel protein of influenza A viruses, inhibiting viral uncoating and replication within host cells."
      },
      {
        "name": "Ambien",
        "description": "Ambien is prescribed for the short-term treatment of insomnia, specifically to help adults who have difficulty falling asleep (sleep initiation), and its extended-release form (Ambien CR) can also help with staying asleep during the night.",
        "alternate_names": ["zolpidem", "Ambien CR"],
        "mechanism_of_action": "Ambien (zolpidem) is a non-benzodiazepine hypnotic that acts as a positive allosteric modulator at the benzodiazepine (BZ1/omega-1) site of the GABA-A receptor complex in the brain, enhancing the inhibitory effects of the neurotransmitter GABA by increasing chloride ion influx into neurons; this leads to neuronal hyperpolarization, decreased excitability, and rapid onset of sedation and sleep. Unlike benzodiazepines, zolpidem is structurally unrelated but shares similar pharmacological properties, producing its sedative effects with minimal anxiolytic, muscle relaxant, or anticonvulsant activity at therapeutic doses."
      },
      {
        "name": "Amiodarone",
        "description": "Amiodarone is used to treat and prevent serious, life-threatening ventricular arrhythmias, including ventricular tachycardia and ventricular fibrillation, especially when other antiarrhythmic medications are ineffective or cannot be tolerated.",
        "alternate_names": ["Cordarone", "Pacerone", "Nexterone", "Aratac", "Cardinorm", "Rithmik", "Arycor", "Atlansil"],
        "mechanism_of_action": "Amiodarone is primarily classified as a class III antiarrhythmic agent that works by blocking cardiac potassium channels, thereby prolonging phase 3 repolarization of the cardiac action potential, which increases the refractory period and stabilizes heart rhythm. It also exhibits sodium channel blockade (reducing conduction velocity), noncompetitive alpha- and beta-adrenergic receptor antagonism (reducing sympathetic stimulation), and calcium channel blockade (decreasing intracellular calcium during contraction), resulting in broad antiarrhythmic effects across multiple cardiac tissues."
      },
      {
        "name": "Amitriptyline",
        "description": "Amitriptyline is primarily prescribed for major depressive disorder in adults, but it is also widely used off-label to manage chronic pain conditions (such as neuropathic pain, fibromyalgia, and arthritis-related pain), prevent migraine and tension-type headaches, and treat anxiety, insomnia, irritable bowel syndrome, and certain bladder pain syndromes.",
        "alternate_names": ["Elavil", "Endep", "Vanatrip"],
        "mechanism_of_action": "Amitriptyline is a tricyclic antidepressant that works by inhibiting the reuptake of both serotonin and norepinephrine at presynaptic nerve terminals, increasing their levels in the brain and enhancing neurotransmission; it also blocks sodium, potassium, and NMDA ion channels at central and spinal levels, contributing to its pain-relieving effects, and has strong anticholinergic and sedative properties due to its affinity for muscarinic and histamine H1 receptors."
      },
      {
        "name": "Amlodipine",
        "description": "Amlodipine is used alone or in combination with other medications to treat high blood pressure (hypertension) in adults and children aged 6 years and older, chronic stable angina (chest pain), vasospastic (Prinzmetal’s or variant) angina, and to reduce the risk of hospitalization for angina or coronary revascularization in patients with documented coronary artery disease without heart failure.",
        "alternate_names": ["Norvasc", "Katerzia", "Norliqva"],
        "mechanism_of_action": "Amlodipine is a long-acting dihydropyridine calcium channel blocker that selectively inhibits L-type calcium channels in vascular smooth muscle and cardiac muscle, reducing calcium influx into these cells; this leads to relaxation of vascular smooth muscle, vasodilation, and a reduction in peripheral vascular resistance, thereby lowering blood pressure. In angina, amlodipine decreases myocardial oxygen demand by reducing afterload (the resistance the heart must pump against) and prevents coronary artery spasm, improving blood flow to the heart muscle."
      },
      {
        "name": "Amoxicillin",
        "description": "Amoxicillin is a widely used penicillin-type antibiotic indicated for the treatment of a variety of bacterial infections, including ear, nose, and throat infections (such as otitis media, tonsillitis, and pharyngitis), lower respiratory tract infections (such as pneumonia and bronchitis), sinusitis, urinary tract infections, skin and soft tissue infections, certain dental infections, and as part of combination therapy for Helicobacter pylori eradication in peptic ulcer disease; it is also used for prophylaxis of bacterial endocarditis and as an alternative for Lyme disease and anthrax post-exposure in specific circumstances.",
        "alternate_names": ["Amoxcil", "Trimox", "Moxatag"],
        "mechanism_of_action": "Amoxicillin is a broad-spectrum β-lactam antibiotic that works by binding to penicillin-binding proteins (PBPs) on susceptible bacteria, inhibiting the transpeptidation step of peptidoglycan synthesis in the bacterial cell wall; this disruption weakens the cell wall, leading to cell lysis and bacterial death (bactericidal effect). It is often combined with a β-lactamase inhibitor (such as clavulanic acid) to overcome bacterial resistance mechanisms that would otherwise inactivate amoxicillin."
      },
      {
        "name": "Ampicillin",
        "description": "Ampicillin is a broad-spectrum penicillin antibiotic used to treat a wide range of bacterial infections, including meningitis, respiratory tract infections (such as pneumonia and bronchitis), sinusitis, throat infections, urinary tract infections, gastrointestinal infections (including those caused by Salmonella and Shigella), reproductive organ infections, and skin and soft tissue infections.",
        "alternate_names": ["aminobenzypenicillin", "Omnipen", "Principen", "Amcill", "Penbritin", "Totacillin", "Pfizerpen"],
        "mechanism_of_action": ""
      },
      {
        "name": "AndroGel",
        "description": "AndroGel is used as hormone replacement therapy to treat adult males with conditions resulting from a lack of natural testosterone, such as primary or secondary hypogonadism; it may also be used as part of gender-affirming hormone therapy for transgender men.",
        "alternate_names": ["testosterone topical", "Testim", "Fortesta", "Vogelxo", "Axiron"],
        "mechanism_of_action": "AndroGel contains testosterone, which is absorbed through the skin and enters the bloodstream, where it binds to androgen receptors in target tissues; the testosterone-androgen receptor complex translocates to the cell nucleus, binds to specific DNA sequences, and regulates the transcription of genes responsible for the development and maintenance of male primary and secondary sexual characteristics, muscle mass, bone density, libido, mood, and other physiological effects."
      },
      {
        "name": "Apixaban",
        "description": "Apixaban is an anticoagulant used to treat and prevent deep vein thrombosis (DVT) and pulmonary embolism (PE), reduce the risk of stroke and systemic embolism in patients with nonvalvular atrial fibrillation, and prevent blood clots after hip or knee replacement surgery.",
        "alternate_names": ["Eliquis"],
        "mechanism_of_action": "Apixaban is a highly selective, direct factor Xa inhibitor that blocks both free and clot-bound factor Xa as well as prothrombinase activity, thereby preventing the conversion of prothrombin to thrombin in the coagulation cascade; this inhibition reduces thrombin generation, fibrin formation, and ultimately the development of blood clots, without requiring antithrombin III and without directly affecting platelet aggregation."
      },
      {
        "name": "Arimidex",
        "description": "Arimidex is used as hormone therapy for the treatment of hormone receptor-positive early breast cancer in postmenopausal women, as a first-line treatment for hormone receptor-positive or hormone receptor-unknown locally advanced or metastatic breast cancer, and for advanced breast cancer in postmenopausal women whose disease has progressed following tamoxifen therapy.",
        "alternate_names": ["anastrozole"],
        "mechanism_of_action": "Arimidex is a non-steroidal aromatase inhibitor that works by reversibly binding to and inhibiting the aromatase enzyme, which is responsible for converting androgens to estrogens; this inhibition lowers estrogen levels in the body, thereby depriving hormone receptor-positive breast cancer cells of the estrogen they need to grow and proliferate."
      },
      {
        "name": "Aripiprazole",
        "description": "Aripiprazole is an atypical antipsychotic used to treat a range of psychiatric and mood disorders, including schizophrenia in adults and adolescents, acute manic and mixed episodes associated with bipolar I disorder, as an adjunct for major depressive disorder, irritability associated with autism spectrum disorder, and Tourette’s disorder in children and adolescents.",
        "alternate_names": ["Abilify"],
        "mechanism_of_action": "Aripiprazole acts as a partial agonist at dopamine D2 and serotonin 5-HT1A receptors and as an antagonist at serotonin 5-HT2A receptors, modulating dopamine and serotonin activity in the brain. Specifically, it functions as a presynaptic D2 receptor agonist (reducing dopamine release) and a postsynaptic D2 receptor antagonist (blocking excessive dopamine signaling), thereby stabilizing dopamine neurotransmission and reducing symptoms of psychosis and mood disturbance without causing significant extrapyramidal side effects."
      },
      {
        "name": "Apriso",
        "description": "Apriso is an extended-release oral capsule formulation of mesalamine used in adults to maintain remission of ulcerative colitis, a chronic inflammatory bowel disease, by helping to prevent flare-ups and keep symptoms from returning.",
        "alternate_names": ["mesalamine"],
        "mechanism_of_action": "Apriso (mesalamine) is an aminosalicylate that exerts a local anti-inflammatory effect on the colonic epithelial cells; while its precise mechanism is not fully understood, it is believed to inhibit the production of pro-inflammatory arachidonic acid metabolites (such as prostaglandins and leukotrienes) through both cyclooxygenase and lipoxygenase pathways, thereby reducing inflammation in the colon associated with ulcerative colitis."
      },
      {
        "name": "Ascorbic acid",
        "description": "Ascorbic acid (vitamin C) is used to prevent and treat vitamin C deficiency, including scurvy, and is also taken as a dietary supplement when dietary intake is insufficient; it supports wound healing, enhances iron absorption from plant sources, maintains healthy skin, bones, teeth, and blood vessels, and is used as an antioxidant to protect cells from free radical damage.",
        "alternate_names": ["L-ascorbic acid", "vitamin C", "ascorbate"],
        "mechanism_of_action": "Ascorbic acid acts as a water-soluble antioxidant and enzyme cofactor; it is reversibly oxidized to dehydroascorbic acid in the body and participates in oxidation-reduction (redox) reactions, serving as a cofactor for enzymes involved in collagen synthesis, neurotransmitter production, and carnitine biosynthesis, while also enhancing iron absorption, supporting immune function, and protecting cellular components from oxidative stress by neutralizing free radicals."
      },
      {
        "name": "Aromasin",
        "description": "Aromasin is used to treat early and advanced hormone receptor-positive breast cancer in postmenopausal women, often as adjuvant therapy after initial treatment with tamoxifen, to lower the risk of cancer recurrence or slow the growth of cancer that needs estrogen to grow.",
        "alternate_names": ["exemestane"],
        "mechanism_of_action": "Aromasin is a steroidal, irreversible aromatase inhibitor that selectively binds to and inactivates the aromatase enzyme, which is responsible for converting androgens into estrogens in postmenopausal women; by blocking this final step in estrogen biosynthesis, Aromasin markedly lowers estrogen levels in the body, depriving hormone receptor-positive breast cancer cells of the estrogen they require for growth and survival."
      },
      {
        "name": "Aspirin",
        "description": "Aspirin is used to relieve mild to moderate pain, reduce fever, and decrease inflammation in conditions such as headaches, arthritis, muscle aches, and menstrual cramps; it is also used at low doses to lower the risk of heart attack, stroke, and blood clots in people with cardiovascular disease or risk factors, and to treat or prevent complications in certain rheumatologic and cardiovascular conditions.",
        "alternate_names": ["acetylsalicylic acid", "Ecotrin"],
        "mechanism_of_action": "Aspirin irreversibly inhibits cyclooxygenase-1 (COX-1) and modifies cyclooxygenase-2 (COX-2) enzymes by acetylating a serine residue, thereby blocking the synthesis of prostaglandins and thromboxane A2 from arachidonic acid; this results in analgesic, antipyretic, anti-inflammatory, and antiplatelet effects, with the irreversible inhibition of platelet thromboxane A2 production leading to its unique blood-thinning properties. Additionally, aspirin can trigger the production of anti-inflammatory lipid mediators known as aspirin-triggered lipoxins and resolvins."
      },
      {
        "name": "Atarax",
        "description": "Atarax (hydroxyzine hydrochloride) is used to manage anxiety and tension associated with nervous and emotional conditions, as a sedative before and after general anesthesia, and to relieve itching (pruritus) from allergic skin conditions such as chronic urticaria, atopic dermatitis, and contact dermatoses.",
        "alternate_names": ["hydroxyzine hydrochloride", "Vistaril"],
        "mechanism_of_action": "Atarax is a first-generation antihistamine that works by competitively blocking histamine H1 receptors in the gastrointestinal tract, blood vessels, and respiratory tract, thereby preventing the effects of histamine and reducing allergic symptoms; it also exhibits activity at muscarinic, serotonergic, and dopaminergic receptors in the brain, which contributes to its anxiolytic and sedative properties."
      },
      {
        "name": "Atenolol",
        "description": "Atenolol is used alone or in combination with other medications to treat high blood pressure (hypertension), prevent angina (chest pain), and improve survival after a heart attack by reducing the risk of further cardiac events.",
        "alternate_names": ["Tenormin"],
        "mechanism_of_action": "Atenolol is a cardioselective beta-blocker that works by selectively blocking beta-1 adrenergic receptors in the heart, which decreases the effects of catecholamines (such as adrenaline), resulting in a slower heart rate, reduced force of heart contraction, and lowered blood pressure; this reduces the heart’s oxygen demand, helps prevent angina, and lowers the risk of complications after a heart attack. At higher doses, atenolol may also block beta-2 receptors, but its primary action is on beta-1 receptors in cardiac tissue."
      },
      {
        "name": "Ativan",
        "description": "Ativan (lorazepam) is primarily used to manage anxiety disorders and provide short-term relief of anxiety symptoms, including anxiety associated with depression; it is also used for the short-term treatment of insomnia caused by anxiety or stress, to treat status epilepticus (a severe, prolonged seizure), and as a sedative before surgery.",
        "alternate_names": ["lorazepam", "Loreev XR"],
        "mechanism_of_action": "Ativan is a benzodiazepine that binds with high affinity to the benzodiazepine site on the gamma-aminobutyric acid (GABA)-A receptor complex in the brain, enhancing the effect of GABA (the main inhibitory neurotransmitter) by increasing the frequency of chloride channel opening; this results in neuronal hyperpolarization and decreased excitability, producing anxiolytic, sedative, muscle relaxant, and anticonvulsant effects."
      },
      {
        "name": "Atomoxetine",
        "description": "Atomoxetine is primarily used to treat attention-deficit hyperactivity disorder (ADHD) in children, adolescents, and adults, helping to improve attention, reduce impulsivity, and decrease hyperactivity.",
        "alternate_names": ["Strattera", "Axepta", "Attera", "Tomoxetin", "Auroxetyn", "Stramox", "Atentah", "Setinox"],
        "mechanism_of_action": "Atomoxetine is a highly selective norepinephrine reuptake inhibitor (NRI) that works by blocking the presynaptic norepinephrine transporter (NET), increasing norepinephrine levels in the synaptic cleft throughout the brain, particularly in the prefrontal cortex; it also modestly increases dopamine in this region by inhibiting its reuptake locally, but has little or no affinity for serotonin or dopamine transporters elsewhere. This enhancement of noradrenergic and dopaminergic signaling in the prefrontal cortex is thought to underlie its therapeutic effects on attention and impulse control in ADHD."
      },
      {
        "name": "Atorvastatin",
        "description": "Atorvastatin is a statin medication used to lower elevated cholesterol and triglyceride levels in the blood, primarily to reduce the risk of cardiovascular events such as heart attack, stroke, angina, and the need for revascularization procedures in adults with high cholesterol, mixed dyslipidemia, or multiple cardiac risk factors; it is also indicated for treating various forms of hyperlipidemia, including familial hypercholesterolemia, and for primary and secondary prevention of cardiovascular disease in at-risk patients.",
        "alternate_names": ["Lipitor", "Atorvaliq"],
        "mechanism_of_action": "Atorvastatin is a selective, competitive inhibitor of HMG-CoA reductase, the rate-limiting enzyme in cholesterol biosynthesis, which catalyzes the conversion of HMG-CoA to mevalonate; by blocking this step, atorvastatin reduces hepatic cholesterol synthesis, leading to upregulation of hepatic LDL receptors, increased clearance of low-density lipoprotein cholesterol (LDL-C) from the bloodstream, and decreases in total cholesterol, LDL-C, very-low-density lipoprotein cholesterol (VLDL-C), and triglycerides, while modestly increasing high-density lipoprotein cholesterol (HDL-C)."
      },
      {
        "name": "Augmentin",
        "description": "Augmentin is a prescription antibiotic used to treat a wide range of bacterial infections, including sinusitis, pneumonia, ear infections (otitis media), bronchitis, urinary tract infections, skin and soft tissue infections, and infections caused by animal bites; it is often chosen when the causative bacteria may be resistant to standard penicillins or amoxicillin alone.",
        "alternate_names": ["amoxicillin/clavulanic acid", "Clavulin", "Amoclan"],
        "mechanism_of_action": "Augmentin is a combination of amoxicillin, a broad-spectrum β-lactam antibiotic that kills bacteria by inhibiting the synthesis of the bacterial cell wall through binding to penicillin-binding proteins (PBPs), and clavulanic acid, a β-lactamase inhibitor that protects amoxicillin from degradation by bacterial β-lactamase enzymes, thereby extending its spectrum of activity to include β-lactamase–producing, resistant bacteria."
      },
      {
        "name": "Avonex",
        "description": "Avonex (interferon beta-1a) is used to treat relapsing forms of multiple sclerosis (MS), including clinically isolated syndrome, relapsing-remitting MS, and active secondary progressive MS, helping to reduce the frequency of relapses and slow the progression of physical disability.",
        "alternate_names": ["interferon beta-1a", "Rebif", "Cinnovex", "Plegridy"],
        "mechanism_of_action": "Avonex is a recombinant form of human interferon beta that binds to specific cell-surface receptors, initiating intracellular signaling cascades that modulate immune system activity; although the precise mechanism in MS is not fully understood, it is believed to reduce inflammation in the central nervous system by altering the balance of pro- and anti-inflammatory cytokines, decreasing immune cell activity against myelin, and suppressing the autoimmune response that leads to nerve damage in MS."
      },
      {
        "name": "Azithromycin",
        "description": "Azithromycin is a broad-spectrum macrolide antibiotic used to treat a variety of bacterial infections, including respiratory tract infections (such as pneumonia, bronchitis, and sinusitis), ear infections, skin and soft tissue infections, certain sexually transmitted infections (like chlamydia and gonorrhea), and as prophylaxis or treatment for Mycobacterium avium complex in immunocompromised patients; it is also used off-label for conditions such as Lyme disease and as long-term prophylaxis for recurrent chest infections.",
        "alternate_names": ["Zithromax", "Z-Pak", "Zmax", "Azasite"],
        "mechanism_of_action": "Azithromycin binds to the 23S rRNA of the 50S subunit of bacterial ribosomes, inhibiting the translocation and assembly steps of protein synthesis, which prevents bacteria from producing essential proteins and thus halts their growth; it is primarily bacteriostatic but can be bactericidal at higher concentrations or against certain organisms."
      },
      {
        "name": "Bacitracin",
        "description": "Bacitracin is a topical antibiotic used to prevent and treat minor skin infections resulting from small cuts, scrapes, or burns; it is also available in ophthalmic formulations for eye infections and, less commonly, as an intramuscular injection for certain severe infections in infants.",
        "alternate_names": ["baciject", "polysporin", "neosporin (when combined with neomycin and polymyxin B)"],
        "mechanism_of_action": "Bacitracin is a cyclic polypeptide antibiotic that exerts its antibacterial effect by binding to and sequestering undecaprenyl pyrophosphate (C55PP), a membrane carrier lipid essential for peptidoglycan synthesis in bacterial cell walls; this action blocks the dephosphorylation and recycling of C55PP, thereby inhibiting the transport of cell wall building blocks and ultimately preventing bacterial cell wall synthesis, leading to cell lysis and death."
      },
      {
        "name": "Baclofen",
        "description": "Baclofen is a skeletal muscle relaxant used to treat spasticity (muscle stiffness and tightness) and muscle pain in conditions such as multiple sclerosis, spinal cord injuries, and other spinal cord diseases, helping to reduce the frequency and severity of muscle spasms and improve mobility.",
        "alternate_names": ["Lioresal", "Gablofen", "Ozobax", "Fleqsuvy", "Lyvispah"],
        "mechanism_of_action": "Baclofen is a selective agonist at the GABABB receptor, primarily in the spinal cord and brain, where it inhibits the release of excitatory neurotransmitters presynaptically and enhances inhibitory signals postsynaptically; this dual action reduces neuronal excitability, leading to decreased muscle spasticity and associated pain."
      },
      {
        "name": "Bactroban",
        "description": "Bactroban (mupirocin) is a topical antibiotic used to treat superficial skin infections such as impetigo, folliculitis, and other primary and secondary skin infections caused by susceptible bacteria, particularly Staphylococcus aureus (including MRSA) and Streptococcus pyogenes; it may also be used to eradicate nasal carriage of MRSA and to prevent infection in minor wounds, cuts, and abrasions.",
        "alternate_names": ["mupirocin", "Centany", "Pirnuo"],
        "mechanism_of_action": "Bactroban (mupirocin) works by specifically and reversibly inhibiting bacterial isoleucyl-tRNA synthetase, an enzyme essential for incorporating the amino acid isoleucine into bacterial proteins; this inhibition blocks bacterial protein synthesis, leading to bacteriostatic effects at low concentrations and bactericidal activity with prolonged exposure or higher concentrations."
      },
      {
        "name": "Baqsimi",
        "description": "Baqsimi is a prescription intranasal glucagon powder used to treat severe hypoglycemia (very low blood sugar) in people with diabetes ages 4 years and older, especially when the person is unable to eat, loses consciousness, or is having a seizure.",
        "alternate_names": ["glucagon"],
        "mechanism_of_action": "Baqsimi contains glucagon, which increases blood glucose concentration by activating hepatic glucagon receptors, stimulating the breakdown of glycogen (glycogenolysis) and the release of glucose from the liver into the bloodstream; this action requires adequate hepatic glycogen stores to be effective."
      },
      {
        "name": "Basaglar",
        "description": "Basaglar is a long-acting insulin used to control high blood sugar in adults with type 1 or type 2 diabetes, and in children aged 6 years and older with type 1 diabetes. It is not approved for use in children with type 2 diabetes or in children younger than 6 years with type 1 diabetes. Basaglar is not used to treat diabetic ketoacidosis.",
        "alternate_names": ["insulin glargine", "Basaglar KwikPen", "Basaglar Tempo Pen"],
        "mechanism_of_action": "Basaglar (insulin glargine) is a long-acting insulin analog. After subcutaneous injection, it forms microprecipitates in the subcutaneous tissue, releasing small amounts of insulin glargine slowly and evenly over approximately 24 hours with no pronounced peak. It lowers blood glucose by stimulating peripheral glucose uptake, inhibiting hepatic glucose production, inhibiting liplysis and proteolysis, and enhanching protein synthesis."
      },
      {
        "name": "Belbuca",
        "description": "Belbuca is a prescription medication used for the management of severe, persistent, chronic pain that requires daily, around-the-clock, long-term opioid treatment and for which alternative treatment options (such as non-opioid analgesics or immediate-release opioids) are ineffective, not tolerated, or inadequate. It is not indicated for use as an as-needed (prn) pain reliever or for minor or occasional pain.",
        "alternate_names": ["buprenorphine"],
        "mechanism_of_action": "Belbuca contains buprenorphine, a partial opioid agonist. It binds to opioid receptors in the central nervous system, producing analgesia (pain relief) and, at higher doses, can also act as an opioid antagonist. This partial agonist activity provides effective pain relief with a lower risk of respiratory depression compared to full opioid agonists, but it still carries significant risks of addiction, abuse, and misuse. The medication is administered as a buccal film placed inside the cheek, where it adheres to the mucosa and dissolves to deliver buprenorphine systemically"
      },
      {
        "name": "Benadryl",
        "description": "Benadryl is a first-generation antihistamine used to relieve symptoms of allergies and the common cold-such as sneezing, runny nose, watery eyes, itchy eyes/nose/throat, hives, skin rash, and itching. It is also used to treat or prevent motion sickness, manage insomnia in adults, alleviate symptoms of mild Parkinsonism and drug-induced movement disorders, and provide short-term relief of cough and cold symptoms.",
        "alternate_names": ["diphenhydramine"],
        "mechanism_of_action": "Benadryl works by competitively blocking histamine H1 receptors on various tissues, including those in the respiratory tract, blood vessels, skin, and central nervous system. This antagonism prevents histamine-a chemical released during allergic reactions-from binding to its receptors, thereby reducing symptoms like itching, sneezing, and runny nose. Diphenhydramine also has significant anticholinergic (drying) and sedative effects, which contribute to its use as a sleep aid and its side effect profile."
      },
      {
        "name": "Benazepril",
        "description": "Benazepril is primarily used to treat high blood pressure (hypertension) in adults and children aged 6 years and older. Lowering blood pressure helps reduce the risk of stroke, heart attack, and kidney problems. It may also be prescribed for other conditions, such as heart failure or chronic kidney disease, as determined by your healthcare provider.",
        "alternate_names": ["Lotensin"],
        "mechanism_of_action": "Benazepril is an angiotensin-converting enzyme (ACE) inhibitor. After being converted in the body to its active form, benazeprilat, it blocks the conversion of angiotensin I to angiotensin II-a hormone that causes blood vessels to constrict and stimulates aldosterone secretion, leading to sodium and water retention. By inhibiting this process, benazepril relaxes blood vessels, reduces blood pressure, and decreases the workload on the heart."
      },
      {
        "name": "Benicar",
        "description": "Benicar (olmesartan medoxomil) is used to treat high blood pressure (hypertension) in adults and children aged 6 years and older, helping to reduce the risk of stroke, heart attack, and kidney problems by lowering blood pressure.",
        "alternate_names": ["olmesartan medoxomil", "Olmetec"],
        "mechanism_of_action": "Benicar is a prodrug that is rapidly converted in the body to olmesartan, a selective angiotensin II receptor blocker (ARB) that specifically inhibits the binding of angiotensin II to the AT1 receptor in vascular smooth muscle, thereby preventing vasoconstriction and aldosterone secretion, resulting in relaxation of blood vessels and reduced blood pressure; this effect is independent of the pathway by which angiotensin II is synthesized."
      },
      {
        "name": "Benlysta",
        "description": "Benlysta (belimumab) is used as an add-on therapy for adults and children aged 5 years and older with active systemic lupus erythematosus (SLE) and active lupus nephritis (lupus-related kidney inflammation) who are already receiving standard treatments such as corticosteroids or immunosuppressants.",
        "alternate_names": ["belimumab"],
        "mechanism_of_action": "Benlysta is a human monoclonal antibody that selectively binds to and inhibits B-lymphocyte stimulator (BLyS, also known as BAFF), a protein essential for B cell survival and maturation; by blocking BLyS from binding to its receptors on B cells, Benlysta reduces the survival of autoreactive B cells, decreases the production of autoantibodies, and dampens the abnormal immune response that drives lupus activity."
      },
      {
        "name": "Bentyl",
        "description": "Bentyl (dicyclomine) is used to treat irritable bowel syndrome (IBS) and related functional bowel disorders by relieving intestinal muscle spasms, abdominal pain, and cramping associated with these conditions.",
        "alternate_names": ["dicyclomine", "Dibent", "Dicyclocot", "Byclomine"],
        "mechanism_of_action": "Bentyl is an anticholinergic and antispasmodic agent that works by competitively blocking acetylcholine at muscarinic receptors on smooth muscle in the gastrointestinal tract, thereby relaxing intestinal smooth muscle, reducing involuntary contractions, and alleviating the cramping and discomfort of IBS."
      },
      {
        "name": "Benzonatate",
        "description": "Benzonatate is a non-narcotic oral antitussive (cough suppressant) used to relieve cough associated with acute and chronic respiratory conditions, such as the common cold, bronchitis, pneumonia, and other respiratory tract infections in patients over 10 years of age.",
        "alternate_names": ["benzonatate", "Tessalon", "Tessalon Perles"],
        "mechanism_of_action": "Benzonatate acts peripherally by anesthetizing (numbing) the stretch receptors and vagal sensory nerve fibers in the respiratory passages, lungs, and pleura, which are involved in triggering the cough reflex; this is achieved through its local anesthetic-like inhibition of voltage-gated sodium channels (including Nav1.7), thereby reducing the transmission of cough impulses to the medullary cough center and suppressing the urge to cough."
      },
      {
        "name": "Benztropine",
        "description": "Benztropine is used as an adjunct therapy to manage symptoms of Parkinson’s disease and to control extrapyramidal symptoms (such as tremors, rigidity, and involuntary movements) caused by antipsychotic medications or other medical conditions affecting movement.",
        "alternate_names": ["benzatropine", "Cogentin"],
        "mechanism_of_action": "Benztropine is a centrally acting anticholinergic and antihistaminic agent that primarily blocks muscarinic acetylcholine receptors (especially M1) in the brain, reducing the effects of acetylcholine and restoring the balance between dopamine and acetylcholine in the basal ganglia to improve movement symptoms; it also inhibits dopamine reuptake, modestly increasing dopaminergic activity, and has some antagonism at histamine H1 receptors."
      },
      {
        "name": "Betamethasone",
        "description": "Betamethasone is a potent corticosteroid used to treat a wide range of inflammatory and autoimmune conditions. Topically, it is prescribed for skin disorders such as eczema, psoriasis, dermatitis, and allergic reactions to reduce itching, redness, and swelling. Systemically (by injection or orally), it is used to manage severe allergic reactions, certain autoimmune diseases, asthma exacerbations, arthritis, and to promote fetal lung maturity in preterm labor.",
        "alternate_names": ["Diprolene", "Celestone", "Betaderm", "Sernivo", "Beta-Val", "Dermabet", "Valnac"],
        "mechanism_of_action": "Betamethasone is a synthetic glucocorticoid that binds to intracellular glucocorticoid receptors, altering gene expression to suppress the production of pro-inflammatory cytokines and mediators, inhibit leukocyte migration, decrease capillary permeability, and stabilize cell membranes, thereby reducing inflammation, immune responses, and associated symptoms. It also inhibits phospholipase A2, decreasing the synthesis of arachidonic acid derivatives (prostaglandins and leukotrienes), and promotes the expression of anti-inflammatory proteins such as interleukin-10."
      },
      {
        "name": "Bevacizumab",
        "description": "Bevacizumab is used in combination with chemotherapy to treat various cancers, including metastatic colorectal cancer, non-squamous non-small cell lung cancer, glioblastoma (a type of brain tumor), metastatic renal cell carcinoma, cervical cancer, ovarian, fallopian tube, and peritoneal cancers, and is sometimes used off-label for other malignancies and eye diseases.",
        "alternate_names": ["Avastin", "Mvasi", "Zirabev"],
        "mechanism_of_action": "Bevacizumab is a recombinant humanized monoclonal antibody that selectively binds to and neutralizes vascular endothelial growth factor A (VEGF-A), a key protein that stimulates angiogenesis (the formation of new blood vessels); by inhibiting VEGF-A, bevacizumab prevents the growth of new blood vessels that supply tumors, thereby reducing tumor vascularization, slowing tumor growth, and potentially causing tumor shrinkage."
      },
      {
        "name": "Biktarvy",
        "description": "Biktarvy is a once-daily, oral prescription medication used to treat HIV-1 infection in adults and children weighing at least 14 kg who have either never taken HIV-1 medicines before or are replacing their current HIV-1 regimen while virologically suppressed (HIV-1 RNA <50 copies/mL) with no known resistance to its components; it is not used for HIV prevention.",
        "alternate_names": ["bictegravir", "emtricitabine", "tenofovir alafenamide"],
        "mechanism_of_action": "Biktarvy combines three antiretroviral agents with complementary mechanisms: bictegravir, an integrase strand transfer inhibitor (INSTI), blocks the HIV-1 integrase enzyme and prevents viral DNA from integrating into the host genome; emtricitabine and tenofovir alafenamide are nucleoside/nucleotide reverse transcriptase inhibitors (NRTIs) that inhibit HIV reverse transcriptase, resulting in premature termination of viral DNA synthesis-together, these actions suppress HIV replication, reduce viral load, and help restore immune function."
      },
      {
        "name": "Biotin",
        "description": "Biotin (vitamin B7, also known as vitamin H) is primarily used to prevent and treat biotin deficiency, which can occur due to genetic disorders, certain medical conditions, or malnutrition; it is also commonly marketed and used for hair loss, brittle nails, and to support healthy skin, though robust evidence for these cosmetic uses in healthy individuals is lacking.",
        "alternate_names": ["vitamin B7", "vitamin H", "coenzyme R"],
        "mechanism_of_action": "Biotin acts as a coenzyme for several carboxylase enzymes involved in key metabolic processes, including the carboxylation of acetyl-CoA to malonyl-CoA and pyruvate to oxaloacetate, which are essential for the metabolism of carbohydrates, fats, and amino acids. It is converted to its active form by biotinidase and attaches to specific lysine residues on enzymes, enabling critical reactions in energy production, fatty acid synthesis, and gluconeogenesis. Biotin also plays roles in cell signaling, gene regulation (epigenetics), and supports healthy nervous system function by contributing to myelination and neuronal health."
      },
      {
        "name": "Bisoprolol",
        "description": "Bisoprolol is used alone or in combination with other medications to treat high blood pressure (hypertension), and is also prescribed for certain heart-related conditions such as heart failure, angina, and tachyarrhythmias.",
        "alternate_names": ["Zebeta", "Bisotab", "Concor", "Corbis", "Monocor"],
        "mechanism_of_action": "Bisoprolol is a cardioselective beta-1 adrenergic blocker that works by competitively and selectively inhibiting beta-1 adrenergic receptors in the heart and kidneys, thereby reducing the effects of catecholamines (such as adrenaline) on heart rate and contractility, lowering cardiac output, and suppressing renin secretion; this leads to decreased blood pressure and reduced workload on the heart, with minimal effect on beta-2 receptors at therapeutic doses."
      },
      {
        "name": "Botox",
        "description": "Botox (onabotulinumtoxinA) is used both cosmetically and medically. Cosmetically, it is FDA-approved to temporarily reduce the appearance of facial wrinkles such as glabellar lines (frown lines), crow’s feet, and forehead lines, and is also used off-label for jawline slimming, eyebrow lifting, and other facial enhancement. Medically, Botox is used to treat chronic migraine, cervical dystonia (neck muscle spasms), spasticity, overactive bladder, urinary incontinence, excessive sweating (hyperhidrosis), strabismus (crossed eyes), blepharospasm (eyelid spasms), and other conditions involving abnormal muscle activity or glandular secretion.",
        "alternate_names": ["onabotulinumtoxinA", "Dysport", "Azzalure", "Xeomin", "Myobloc", "Letybo"],
        "mechanism_of_action": "Botox is a neurotoxin that binds to presynaptic cholinergic nerve terminals, is internalized into the neuron, and cleaves SNARE proteins (specifically SNAP-25), thereby blocking the release of the neurotransmitter acetylcholine at the neuromuscular junction and autonomic nerve endings; this inhibition prevents muscle contraction and glandular secretion, resulting in temporary muscle paralysis or reduced gland activity until new nerve terminals regenerate."
      },
      {
        "name": "Breo Ellipta",
        "description": "Breo Ellipta is a once-daily inhaled medication used for the long-term maintenance treatment of asthma in adults and children ages 5 or 6 years and older (varies by country), and for chronic obstructive pulmonary disease (COPD), including to improve lung function and reduce the risk of COPD exacerbations; it is not a rescue inhaler and should not be used for acute symptom relief.",
        "alternate_names": ["fluticasone furoate", "vilanterol"],
        "mechanism_of_action": "Breo Ellipta contains two active ingredients: fluticasone furoate, an inhaled corticosteroid (ICS) that reduces airway inflammation by inhibiting multiple types of inflammatory cells and mediators, and vilanterol, a long-acting beta2-adrenergic agonist (LABA) that relaxes bronchial smooth muscle through selective stimulation of beta2-receptors, leading to bronchodilation; together, these actions decrease airway inflammation and keep airways open to improve breathing and reduce the frequency of asthma and COPD flare-ups."
      },
      {
        "name": "Brilinta",
        "description": "Brilinta (ticagrelor) is an oral antiplatelet medication used to lower the risk of heart attack, stroke, or cardiovascular death in people with acute coronary syndrome (ACS), a history of heart attack, coronary artery disease (CAD) with high risk factors, or after placement of a coronary stent, and to reduce the risk of stroke and death in adults with a blockage or decreased blood flow in an artery supplying the brain.",
        "alternate_names": ["ticagrelor"],
        "mechanism_of_action": "Brilinta is a direct-acting, reversible P2Y12 receptor antagonist that inhibits platelet activation and aggregation by blocking the binding of adenosine diphosphate (ADP) to the P2Y12 receptor on platelets, thereby preventing platelets from clumping together and forming blood clots that can block arteries and cause heart attacks or strokes."
      },
      {
        "name": "Briomonidine",
        "description": "Brimonidine is primarily used to lower intraocular pressure in patients with open-angle glaucoma or ocular hypertension, helping to prevent optic nerve damage and vision loss; it is also available in lower-strength, over-the-counter formulations to relieve eye redness due to minor irritation, and as a topical gel for the treatment of persistent facial redness (erythema) in adults with rosacea.",
        "alternate_names": ["Alphagan", "Lumify", "Qoliana", "Mirvaso"],
        "mechanism_of_action": "Brimonidine is a highly selective alpha-2 adrenergic receptor agonist that lowers intraocular pressure by both reducing aqueous humor production and increasing uveoscleral outflow in the eye; when used for eye redness or facial erythema, it acts as a peripheral vasoconstrictor by stimulating alpha-2 receptors on blood vessels, leading to constriction and reduced blood flow, thereby decreasing redness."
      },
      {
        "name": "Briviact",
        "description": "Briviact (brivaracetam) is a prescription anticonvulsant used to treat partial-onset (focal) seizures in adults, adolescents, and children as young as 1 month old, either alone or in combination with other seizure medications.",
        "alternate_names": ["brivaracetam", "Nubriveo", "Brivajoy"],
        "mechanism_of_action": "Briviact is a third-generation antiepileptic drug that exerts its effect by binding with high affinity to synaptic vesicle protein 2A (SV2A) in the brain, a protein involved in regulating neurotransmitter release; this selective binding modulates synaptic transmission and stabilizes neuronal activity, thereby reducing the likelihood of the abnormal electrical activity that causes seizures."
      },
      {
        "name": "Budesonide",
        "description": "Budesonide is a corticosteroid used to treat a variety of inflammatory conditions including asthma, COPD, Crohn's disease, ulcerative colitis, microscopic colitis, allergic rhinitis (hay fever), nasal polyps, eosinophilic esophagitis, and Berger's disease (IgA nephropathy).",
        "alternate_names": ["Pulmicort", "Rhinocort", "Entocort", "Uceris", "Cortiment", "Budenofalk", "Tarpeyo", "Jorveza"],
        "mechanism_of_action": "Budesonide is a potent glucocorticoid receptor agonist that works by binding to intracellular glucocorticoid receptors, altering gene expression to suppress the production of pro-inflammatory cytokines and mediators, reduce leukocyte migration, inhibit activation of inflammatory cells (such as eosinophils, mast cells, neutrophils, T-lymphocytes, and macrophages), and decrease capillary permeability; this results in a strong local anti-inflammatory effect in the airways, gastrointestinal tract, or nasal mucosa, depending on the route of administration."
      },
      {
        "name": "Bumex",
        "description": "Bumex (bumetanide) is a potent loop diuretic (water pill) used to treat fluid retention (edema) associated with congestive heart failure, liver disease (such as cirrhosis), kidney disease (including nephrotic syndrome), and other conditions that cause excess fluid buildup.",
        "alternate_names": ["bumetanide", "Burinex", "Bumedyl", "Fordiuran", "Miccil"],
        "mechanism_of_action": "Bumex acts primarily in the ascending limb of the loop of Henle in the kidney, where it inhibits sodium and chloride reabsorption, leading to increased excretion of sodium, chloride, potassium, and water in the urine; this results in rapid and significant diuresis and reduction of fluid overload, with additional minor action in the proximal tubule but minimal effect on the distal tubule."
      },
      {
        "name": "Buprenorphine",
        "description": "Buprenorphine is primarily used to treat opioid use disorder (OUD), helping to reduce withdrawal symptoms and cravings in people dependent on opioids such as heroin, oxycodone, or fentanyl; it is also prescribed for the management of moderate to severe pain when alternative treatments are inadequate.",
        "alternate_names": ["Suboxone (with naloxone)", "Subutex", "Sublocade", "Brixadi", "Butrans", "Belbuca", "Buprenex", "Zubsolv", "Bunavail"],
        "mechanism_of_action": "Buprenorphine is a partial agonist at the mu-opioid receptor, where it binds with high affinity but activates the receptor less than full agonists, producing a ceiling effect for respiratory depression and euphoria, and acts as an antagonist at the kappa-opioid receptor; this unique pharmacology diminishes opioid withdrawal and cravings, blocks the effects of other opioids, lowers the risk of misuse and overdose, and provides analgesia for pain management."
      },
      {
        "name": "Bupropion",
        "description": "Bupropion is used to treat major depressive disorder (MDD) and seasonal affective disorder (SAD), and is also approved as an aid to smoking cessation; it is additionally used off-label for conditions such as attention-deficit/hyperactivity disorder (ADHD), antidepressant-induced sexual dysfunction, obesity (in combination with naltrexone), and stimulant use disorders.",
        "alternate_names": ["Wellbutrin", "Wellbutrin SR", "Wellbutrin XL", "Zyban", "Aplenzin", "Forfivo XL", "Budeprion", "Contrave (with naltrexone)"],
        "mechanism_of_action": "Bupropion is a norepinephrine and dopamine reuptake inhibitor (NDRI) that works by weakly inhibiting the neuronal reuptake of norepinephrine and dopamine via blockade of the norepinephrine transporter (NET) and dopamine transporter (DAT), thereby increasing the concentration of these neurotransmitters in the synaptic cleft and enhancing their activity in the brain; it has minimal or no effect on serotonin reuptake and does not significantly interact with histamine, adrenergic, cholinergic, or serotonin receptors."
      },
      {
        "name": "Buspar",
        "description": "Buspirone (formerly sold under the brand name Buspar) is primarily used to treat generalized anxiety disorder (GAD) and to relieve symptoms of anxiety, such as fear, tension, irritability, dizziness, and pounding heartbeat.It is sometimes used off-label as an adjunct in depression, for sexual dysfunction, and other psychiatric or neurological conditions, but its main approved indication is anxiety disorders.",
        "alternate_names": ["Buspar Dividose"],
        "mechanism_of_action": "Buspirone is an azapirone anxiolytic that acts primarily as a partial agonist at serotonin 5-HT1A receptors (with high affinity), modulating serotonergic activity in the brain’s anxiety and fear circuits; it also has weak affinity for dopamine D2 receptors (antagonist) and minimal effect on other neurotransmitter systems, but does not interact with GABA receptors, distinguishing it from benzodiazepines. The clinical anxiolytic effect is believed to result from increased serotonergic activity in the amygdala and related brain regions, and buspirone does not cause sedation, muscle relaxation, or dependence typical of benzodiazepines."
      },
      {
        "name": "Bystolic",
        "description": "Bystolic (nebivolol) is used to treat high blood pressure (hypertension) in adults, which helps lower the risk of stroke and heart attack; it may be used alone or in combination with other antihypertensive agents.",
        "alternate_names": ["nebivolol", "Bystolic"],
        "mechanism_of_action": "Bystolic is a highly selective beta-1 adrenergic receptor blocker that lowers blood pressure by slowing the heart rate and reducing the force of heart contractions, and it uniquely stimulates endothelial nitric oxide synthase via beta-3 agonism, increasing nitric oxide production and causing vasodilation; at higher doses, or in slow metabolizers, it may also block beta-2 receptors."
      },
      {
        "name": "Cabenuva",
        "description": "Cabenuva is a long-acting, injectable prescription regimen used to treat HIV-1 infection in adults and adolescents aged 12 years and older who weigh at least 35 kg (77 lbs), specifically for people who are virologically suppressed (HIV-1 RNA <50 copies/mL) and stable on their current antiretroviral therapy, with no history of treatment failure or known resistance to its components.",
        "alternate_names": ["cabotegravir", "rilpivirine"],
        "mechanism_of_action": "Cabenuva contains two antiretroviral agents with complementary mechanisms. Cabotegravir is an integrase strand transfer inhibitor that blocks HIV integrase, preventing the integration of viral DNA into the host genome, a critical step in the HIV replication cycle. Rilpivirine is a non-nucleoside reverse transcriptase inhibitor (NNRTI) that binds to reverse transcriptase, inhibiting the enzyme and thereby preventing the conversion of viral RNA into DNA, which is necessary for HIV replication."
      },
      {
        "name": "Calcitriol",
        "description": "Calcitriol is the active form of vitamin D3 and is used to treat and prevent low calcium levels (hypocalcemia) and bone disease in patients with chronic kidney disease, secondary hyperparathyroidism (excess parathyroid hormone), hypoparathyroidism (low parathyroid hormone), and certain other conditions such as rickets, osteomalacia, and osteoporosis; it is also used topically for mild to moderate plaque psoriasis.",
        "alternate_names": ["Rocaltrol", "Calcijex", "Decostriol", "Vectical", "Calcitriolum"],
        "mechanism_of_action": "Calcitriol is a hormonally active vitamin D analog that binds to vitamin D receptors (VDR) in the intestines, kidneys, bones, and parathyroid glands, acting as a transcription factor to increase the expression of proteins involved in calcium and phosphate absorption; it raises blood calcium levels by promoting intestinal absorption of dietary calcium, increasing renal tubular reabsorption of calcium, and stimulating the release of calcium from bone through osteoclast activation, while also suppressing parathyroid hormone (PTH) synthesis."
      },
      {
        "name": "Candesartan",
        "description": "Candesartan is used to treat high blood pressure (hypertension) in adults and children aged 1 to 16 years, and is also prescribed for adults with heart failure to reduce the risk of hospitalization and death related to heart problems.",
        "alternate_names": ["Atacand"],
        "mechanism_of_action": "Candesartan is an angiotensin II receptor blocker (ARB) administered as the prodrug candesartan cilexetil, which is rapidly converted to its active form in the body; it selectively blocks angiotensin II from binding to the AT1 receptor in vascular smooth muscle and the adrenal glands, thereby preventing vasoconstriction and aldosterone secretion, resulting in relaxed blood vessels, reduced blood pressure, and decreased workload on the hear."
      },
      {
        "name": "Caplyta",
        "description": "Caplyta (lumateperone) is a prescription oral capsule used to treat adults with schizophrenia and depressive episodes associated with bipolar I or II disorder, either alone or in combination with mood stabilizers such as lithium or valproate.",
        "alternate_names": ["lumateperone"],
        "mechanism_of_action": "Caplyta is an atypical (second-generation) antipsychotic that modulates neurotransmitter activity in the brain by antagonizing serotonin 5-HT2A receptors, partially agonizing presynaptic and antagonizing postsynaptic dopamine D2 receptors, blocking serotonin reuptake, and enhancing glutamate activity at NMDA receptors; these combined actions help balance serotonin, dopamine, and glutamate signaling, which are implicated in the symptoms of schizophrenia and bipolar depression."
      },
      {
        "name": "Carbamazepine",
        "description": "Carbamazepine is primarily used to treat epilepsy (various types of seizures), trigeminal neuralgia (a severe facial nerve pain), and as an extended-release formulation (Equetro), it is also approved for managing acute manic and mixed episodes in bipolar I disorder.",
        "alternate_names": ["Tegretol", "Tegretol XR", "Carbatrol", "Epitol", "Equetro"],
        "mechanism_of_action": "Carbamazepine acts mainly by binding to and stabilizing the inactivated state of voltage-gated sodium channels in neuronal membranes, thereby inhibiting repetitive and sustained neuronal firing and reducing abnormal electrical activity in the brain; it may also modulate calcium channels and neurotransmitter release, and has additional effects on serotonin and other neurotransmitter systems, though these are less well understood."
      },
      {
        "name": "Carvedilol",
        "description": "Carvedilol is used to treat high blood pressure (hypertension), heart failure, and left ventricular dysfunction following a heart attack, helping to lower the risk of hospitalization and death from heart-related causes.",
        "alternate_names": ["Coreg"],
        "mechanism_of_action": "Carvedilol is a non-selective beta-adrenergic blocker (blocks both β1 and β2 receptors) and an alpha-1 adrenergic blocker; by inhibiting these receptors, it reduces the effects of catecholamines (such as adrenaline), leading to decreased heart rate and contractility, vasodilation, and reduced peripheral vascular resistance, which together lower blood pressure, decrease cardiac workload, and improve heart function in heart failure and after myocardial infarction."
      },
      {
        "name": "Cefazolin",
        "description": "Cefazolin is a first-generation cephalosporin antibiotic used to treat a wide range of bacterial infections, including skin and soft tissue infections, respiratory tract infections (such as pneumonia), urinary tract infections, bone and joint infections, biliary tract infections, genital infections, blood infections (sepsis), and endocarditis; it is also commonly used before, during, and after surgery to prevent surgical site infections.",
        "alternate_names": ["cefazoline", "cephazolin", "Ancef", "Kefzol", "Cefamezin", "Totacef", "Gramaxin"],
        "mechanism_of_action": "Cefazolin works by binding to specific penicillin-binding proteins (PBPs) inside the bacterial cell wall, inhibiting the final stage of peptidoglycan synthesis required for cell wall integrity; this disruption leads to bacterial cell lysis and death, making cefazolin bactericidal against susceptible organisms."
      },
      {
        "name": "Cefdinir",
        "description": "Cefdinir is an oral, broad-spectrum cephalosporin antibiotic used to treat a variety of mild to moderate bacterial infections in adults and children, including community-acquired pneumonia, acute exacerbations of chronic bronchitis, acute maxillary sinusitis, pharyngitis/tonsillitis (including strep throat), acute otitis media (middle ear infection), and uncomplicated skin and skin structure infections.",
        "alternate_names": ["Omnicef", "Cednir", "Kefnir", "Cefdair", "Cefdiel"],
        "mechanism_of_action": "Cefdinir is a third-generation cephalosporin antibiotic that works by binding to and inhibiting penicillin-binding proteins (PBPs) in bacterial cell walls, thereby blocking the final step of peptidoglycan synthesis, which weakens the cell wall and leads to bacterial cell lysis and death; it is bactericidal against a broad range of gram-positive and gram-negative bacteria."
      },
      {
        "name": "Cefixime",
        "description": "Cefixime is a third-generation oral cephalosporin antibiotic used to treat a variety of bacterial infections, including infections of the ears (otitis media), throat (pharyngitis, tonsillitis), sinuses, respiratory tract (such as bronchitis and pneumonia), urinary tract, and uncomplicated gonorrhea; it is also effective for certain skin and soft tissue infections and is sometimes used for typhoid fever.",
        "alternate_names": ["Suprax", "Cefspan", "Cephoral", "Cefixoral", "Oroken", "Unixime", "Tricef", "Oraken"],
        "mechanism_of_action": "Cefixime acts by binding to penicillin-binding proteins (PBPs) in bacterial cell walls, inhibiting the final transpeptidation step in peptidoglycan synthesis, which disrupts cell wall formation and leads to bacterial cell lysis and death; this bactericidal action is effective against a broad range of gram-positive and gram-negative bacteria."
      },
      {
        "name": "Ceftriaxone",
        "description": "Ceftriaxone is a third-generation cephalosporin antibiotic used to treat a wide range of serious bacterial infections, including pneumonia, meningitis, middle ear infections (otitis media), urinary tract infections, skin and soft tissue infections, bone and joint infections, intra-abdominal infections, gonorrhea, pelvic inflammatory disease, septicemia (blood infections), and is also commonly used before or after surgery to prevent infections.",
        "alternate_names": ["Rocephin", "Epicephin", "Wintriaxone"],
        "mechanism_of_action": "Ceftriaxone is a broad-spectrum, third-generation cephalosporin that works by selectively and irreversibly binding to penicillin-binding proteins (PBPs), particularly transpeptidases, in bacterial cell membranes, thereby inhibiting the final stage of peptidoglycan synthesis required for bacterial cell wall integrity; this disruption leads to defective cell walls, bacterial cell lysis, and death. It remains active against many beta-lactamase–producing bacteria and is bactericidal in action."
      },
      {
        "name": "Celebrex",
        "description": "Celebrex (celecoxib) is a prescription nonsteroidal anti-inflammatory drug (NSAID) used to relieve pain and inflammation associated with conditions such as osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, juvenile rheumatoid arthritis (in children 2 years and older), acute pain in adults, and primary dysmenorrhea (menstrual pain); it is also approved for reducing the number of colon polyps in people with familial adenomatous polyposis.",
        "alternate_names": ["celecoxib", "Onsenal", "Elyxyb", "Celebra"],
        "mechanism_of_action": "Celebrex is a highly selective inhibitor of cyclooxygenase-2 (COX-2), an enzyme responsible for the synthesis of prostaglandins that mediate pain and inflammation; by selectively blocking COX-2 while sparing COX-1, celecoxib reduces inflammation and pain with a lower risk of gastrointestinal side effects compared to nonselective NSAIDs, which inhibit both COX-1 and COX-2."
      },
      {
        "name": "Cialis",
        "description": "Cialis (tadalafil) is prescribed to treat erectile dysfunction (ED), benign prostatic hyperplasia (BPH), and the combination of ED and BPH symptoms in adult males. It is also available under a different brand (Adcirca) for pulmonary arterial hypertension, but Cialis itself is not used for this purpose.",
        "alternate_names": ["tadalafil", "Adcircia", "Tadliq", "Alyq"],
        "mechanism_of_action": "Cialis is a phosphodiesterase type 5 (PDE5) inhibitor that works by blocking the PDE5 enzyme, which leads to increased levels of cyclic guanosine monophosphate (cGMP) in smooth muscle cells. In the penis, this results in relaxation of smooth muscle and increased blood flow during sexual stimulation, facilitating erection; in the prostate and bladder, it relaxes smooth muscle to improve urinary symptoms of BPH."
      },
      {
        "name": "Ciprofloxacin",
        "description": "Cipro (ciprofloxacin) is a broad-spectrum fluoroquinolone antibiotic used to treat a variety of bacterial infections, including urinary tract infections (UTIs), respiratory tract infections (such as bronchitis and pneumonia), skin and soft tissue infections, bone and joint infections, infectious diarrhea, intra-abdominal infections (often with metronidazole), certain sexually transmitted infections (such as gonorrhea), and is also approved for treating or preventing anthrax exposure.",
        "alternate_names": ["Cipro"],
        "mechanism_of_action": "Ciprofloxacin is a bactericidal antibiotic that works by inhibiting bacterial DNA gyrase and topoisomerase IV, enzymes essential for DNA replication, transcription, repair, and recombination; this inhibition disrupts bacterial cell division and leads to cell death, making it especially potent against gram-negative bacteria and some gram-positive organisms."
      },
      {
        "name": "Clarithomycin",
        "description": "Clarithromycin is a macrolide antibiotic used to treat a variety of bacterial infections, including pneumonia, bronchitis, sinusitis, pharyngitis, tonsillitis, skin and soft tissue infections, ear infections (acute otitis media), and to both treat and prevent disseminated Mycobacterium avium complex (MAC) infections, especially in people with HIV. It is also used in combination with other medications to eradicate Helicobacter pylori (which causes ulcers), and may be prescribed for other infections such as Lyme disease, cryptosporidiosis, cat scratch disease, Legionnaires’ disease, and pertussis.",
        "alternate_names": ["Biaxin", "Klaricid", "Klacid", "Claricid", "Clarith", "Macladin", "Zeclar"],
        "mechanism_of_action": "Clarithromycin works by binding to the 23S rRNA of the 50S subunit of bacterial ribosomes, inhibiting protein synthesis by blocking the translocation of aminoacyl-tRNA and polypeptide chain elongation, which prevents bacteria from multiplying and ultimately leads to their death; this mechanism is similar to other macrolide antibiotics such as erythromycin."
      },
      {
        "name": "Claritin",
        "description": "Claritin is an over-the-counter antihistamine used to temporarily relieve symptoms of hay fever and other upper respiratory allergies, such as runny nose, sneezing, itchy or watery eyes, and itching of the nose or throat; it can also be used to treat hives and itching due to chronic urticaria.",
        "alternate_names": ["loratadine", "Alavert", "Wal-itin"],
        "mechanism_of_action": "Claritin (loratadine) is a long-acting, second-generation, non-sedating antihistamine that selectively and competitively blocks peripheral histamine H1-receptors, thereby decreasing vascular permeability, smooth muscle contraction, and sensory nerve activation caused by histamine, which relieves allergy symptoms without significant sedation because it does not cross the blood-brain barrier."
      },
      {
        "name": "Clindamycin",
        "description": "Clindamycin is an antibiotic used to treat a wide range of serious bacterial infections caused by susceptible anaerobic bacteria and certain aerobic gram-positive bacteria, including lower respiratory tract infections (such as pneumonia and lung abscess), skin and soft tissue infections, bone and joint infections (including osteomyelitis), septicemia, intra-abdominal infections (such as peritonitis and abscesses), gynecological infections (such as endometritis and pelvic cellulitis), dental infections, and as a topical treatment for severe acne; it is also used for prophylaxis in surgical and dental procedures, and as an alternative in patients allergic to penicillins.",
        "alternate_names": ["Cleocin", "Clindesse", "ClindaMax", "Dalacin", "Evoclin", "Clindagel"],
        "mechanism_of_action": "Clindamycin is a lincosamide antibiotic that inhibits bacterial protein synthesis by binding to the 23S rRNA of the 50S subunit of the bacterial ribosome, blocking peptide chain initiation and elongation, which impedes ribosomal assembly and translation; this action is generally bacteriostatic but can be bactericidal against some organisms and concentrations."
      },
      {
        "name": "Clonazepam",
        "description": "Clonazepam is a benzodiazepine medication primarily used to treat certain types of seizure disorders (epilepsy), including absence seizures, myoclonic seizures, and Lennox-Gastaut syndrome, as well as panic disorder (with or without agoraphobia); it is also used off-label for anxiety disorders, movement disorders such as restless legs syndrome, REM sleep behavior disorder, and as adjunct therapy for acute mania and other conditions.",
        "alternate_names": ["Klonopin", "Rivotril"],
        "mechanism_of_action": "Clonazepam is a high-potency, long-acting benzodiazepine that acts as a positive allosteric modulator at the benzodiazepine site of the GABAAA receptor in the central nervous system; by enhancing the affinity of GABA (gamma-aminobutyric acid), the main inhibitory neurotransmitter, for its receptor, clonazepam increases the frequency of chloride channel opening, leading to hyperpolarization of neurons and decreased neuronal excitability-this results in anticonvulsant, anxiolytic, sedative, muscle relaxant, and hypnotic effects."
      },
      {
        "name": "Clonidine",
        "description": "Clonidine is primarily used to treat high blood pressure (hypertension), but it is also prescribed for attention deficit hyperactivity disorder (ADHD), management of withdrawal symptoms from opioids, alcohol, nicotine, and benzodiazepines, severe cancer pain (as an adjunct), Tourette syndrome (for tics), menopausal hot flashes, migraine prophylaxis, spasticity, anxiety, insomnia, and several other off-label conditions.",
        "alternate_names": ["Catapres", "Kapvay", "Nexiclon XR", "Duraclon"],
        "mechanism_of_action": "Clonidine is a centrally acting, selective alpha-2 adrenergic receptor agonist that primarily stimulates presynaptic alpha-2a receptors in the brainstem (notably the locus coeruleus), resulting in reduced sympathetic outflow from the central nervous system; this decreases norepinephrine release, lowers peripheral vascular resistance, slows heart rate, and reduces blood pressure. Additionally, clonidine’s action on imidazoline receptors and its modulation of pain transmission in the spinal cord contribute to its effects in pain management and other indications."
      },
      {
        "name": "Clopidogrel",
        "description": "Additionally, clonidine’s action on imidazoline receptors and its modulation of pain transmission in the spinal cord contribute to its effects in pain management and other indications.",
        "alternate_names": ["Plavix", "Iscover", "Ceruvin"],
        "mechanism_of_action": "Clopidogrel is an inactive prodrug that is metabolized in the liver to its active form, which irreversibly binds to the platelet P2Y12 adenosine diphosphate (ADP) receptor; this blocks ADP-mediated activation of the glycoprotein IIb/IIIa complex, thereby inhibiting platelet aggregation and reducing the formation of harmful blood clots for the lifespan of the platelet (7–10 days)."
      },
      {
        "name": "Clotrimazole",
        "description": "Clotrimazole is an antifungal medication used to treat a wide range of fungal and yeast infections, including athlete’s foot (tinea pedis), ringworm (tinea corporis), jock itch (tinea cruris), fungal nail infections, infected nappy rash, sweat rash (intertrigo), oral and vaginal candidiasis (thrush), pityriasis versicolor, and other skin infections caused by dermatophytes or Candida species.",
        "alternate_names": ["Canesten", "Lotrimin", "Mycelex"],
        "mechanism_of_action": "Clotrimazole is an imidazole antifungal that works by inhibiting the fungal enzyme lanosterol 14-α-demethylase, which is crucial for the synthesis of ergosterol, an essential component of the fungal cell membrane. By blocking ergosterol production, clotrimazole disrupts the integrity and function of the fungal cell membrane, leading to increased membrane permeability, impaired cellular processes, and ultimately the inhibition of fungal growth or cell death. At higher concentrations, clotrimazole may also be fungicidal. Additionally, it has secondary effects such as inhibition of calcium channels and depletion of intracellular calcium, but its primary action is on ergosterol synthesis."
      },
      {
        "name": "Codeine",
        "description": "Codeine is an opioid medication used to treat mild to moderate pain and to suppress dry, irritating coughs; it is also sometimes used in combination with other drugs (such as acetaminophen, aspirin, or ibuprofen) for more severe pain, and may be included in certain cold and flu preparations to relieve cough and other symptoms.",
        "alternate_names": ["codeine"],
        "mechanism_of_action": "Codeine is a weak opioid agonist that exerts its effects primarily after being metabolized in the liver by the enzyme CYP2D6 into morphine, which then binds to mu-opioid receptors in the central nervous system to inhibit pain signal transmission and suppress the cough reflex; codeine also has direct, though weaker, agonist activity at mu-, kappa-, and delta-opioid receptors, and its metabolites (such as codeine-6-glucuronide) may contribute to its analgesic effects. This modulation of pain and cough occurs through decreased neurotransmitter release and hyperpolarization of neurons, resulting in reduced pain perception and cough."
      },
      {
        "name": "Colace",
        "description": "Colace is an over-the-counter stool softener used to treat or prevent occasional constipation, especially in situations where straining should be avoided (such as after surgery, heart attack, or during pregnancy).",
        "alternate_names": ["docusate", "Col-Rite", "Correctol", "Diocto", "DSS", "Silace", "Surfak"],
        "mechanism_of_action": "Colace (docusate) acts as a surfactant in the intestines, reducing the surface tension of stool and allowing water and fats to penetrate and mix with the fecal mass, which increases the water content of the stool, making it softer and easier to pass without stimulating bowel contractions."
      },
      {
        "name": "Concerta",
        "description": "Colace (docusate) acts as a surfactant in the intestines, reducing the surface tension of stool and allowing water and fats to penetrate and mix with the fecal mass, which increases the water content of the stool, making it softer and easier to pass without stimulating bowel contractions.",
        "alternate_names": ["methphenidate", "Ritalin", "Metadate", "Methylin", "Daytrana", "Quillivant", "Quillichew", "Aptensio"],
        "mechanism_of_action": "Concerta contains methylphenidate, a central nervous system stimulant that works by inhibiting the reuptake of dopamine and norepinephrine in the brain, thereby increasing their concentrations in synaptic clefts; this enhances neurotransmission in brain regions involved in attention and impulse control, resulting in improved focus and behavioral regulation in individuals with ADHD. Concerta uses an advanced OROS (osmotically controlled release oral delivery system) technology, which provides an initial immediate-release dose followed by a gradual, sustained release throughout the day for up to 12 hours of symptom control."
      },
      {
        "name": "Coreg",
        "description": "Coreg (carvedilol) is used to treat high blood pressure (hypertension), manage symptoms of heart failure, and improve survival and reduce the risk of hospitalization in people with left ventricular dysfunction following a heart attack.",
        "alternate_names": ["carvedilol"],
        "mechanism_of_action": "Coreg is a non-selective beta-blocker with alpha-1 blocking activity; it lowers blood pressure and reduces the heart's workload by blocking beta-1 receptors in the heart (slowing heart rate and reducing contractility) and alpha-1 receptors in blood vessels (causing vasodilation), thereby improving heart function and decreasing the risk of cardiovascular events."
      },
      {
        "name": "Coumadin",
        "description": "Coumadin (warfarin) is an oral anticoagulant used to treat and prevent blood clots in veins (such as deep vein thrombosis) and arteries (such as pulmonary embolism), and to reduce the risk of stroke, heart attack, or other serious complications in people with conditions like atrial fibrillation, heart valve replacements, or a history of clotting disorders.",
        "alternate_names": ["warfarin", "Jantoven"],
        "mechanism_of_action": "Coumadin (warfarin) works by inhibiting the enzyme vitamin K epoxide reductase in the liver, which is needed to recycle vitamin K. This inhibition reduces the production of active vitamin K–dependent clotting factors (II, VII, IX, and X) and regulatory proteins C and S, thereby decreasing the blood’s ability to form clots. The result is a prolonged clotting time, which helps prevent harmful clots from forming or growing larger."
      },
      {
        "name": "Crestor",
        "description": "Crestor (rosuvastatin) is a statin medication used to lower 'bad' cholesterol (LDL-C), triglycerides, and total cholesterol, while raising 'good' cholesterol (HDL-C) in adults and children (as young as 7 or 8, depending on the condition).",
        "alternate_names": ["rosuvastatin", "Ezallor Sprinkle"],
        "mechanism_of_action": "Crestor is a highly selective inhibitor of HMG-CoA reductase, the rate-limiting enzyme in cholesterol biosynthesis in the liver. By blocking this enzyme, rosuvastatin reduces the production of cholesterol, which leads to increased expression of LDL receptors on liver cells, enhanced uptake and breakdown of LDL cholesterol from the bloodstream, and decreased levels of circulating LDL-C and total cholesterol. It also modestly increases HDL-C and reduces triglycerides."
      },
      {
        "name": "Cymbalta",
        "description": "Cymbalta (duloxetine) is a prescription medication used to treat major depressive disorder (MDD) and generalized anxiety disorder (GAD) in adults, as well as nerve pain from diabetic neuropathy, fibromyalgia, and chronic musculoskeletal pain in adults. It is also approved for GAD in children ages 7 and older, and fibromyalgia in children ages 13 and older.",
        "alternate_names": ["duloxetine", "Yentreve"],
        "mechanism_of_action": "Cymbalta is a selective serotonin and norepinephrine reuptake inhibitor (SNRI) that works by blocking the reuptake of serotonin and norepinephrine in the central nervous system, increasing their levels in the synaptic cleft. This modulation of neurotransmitter activity is believed to improve mood and reduce pain perception, although the precise mechanism for each indication is not fully understood."
      },
      {
        "name": "Decadron",
        "description": "Decadron (dexamethasone) is a potent corticosteroid used to treat a wide range of inflammatory, autoimmune, allergic, and hormone-related conditions, including severe allergies, asthma, arthritis, skin diseases (such as dermatitis and psoriasis), blood and bone marrow disorders, certain cancers (like leukemia, lymphoma, and multiple myeloma), cerebral edema, gastrointestinal diseases (such as ulcerative colitis), eye and kidney disorders, and for the prevention or treatment of nausea and vomiting associated with chemotherapy. It is also used in the management of certain nervous system conditions (such as multiple sclerosis exacerbations), and as part of treatment protocols for severely ill COVID-19 patients requiring supplemental oxygen or ventilation.",
        "alternate_names": ["dexamethasone", "Dexasone", "Diodex", "Hexadrol", "Baycadron", "DexPak"],
        "mechanism_of_action": "Decadron (dexamethasone) is a long-acting synthetic glucocorticoid that crosses cell membranes and binds to intracellular glucocorticoid receptors, forming a complex that translocates to the cell nucleus where it alters gene transcription. This leads to suppression of pro-inflammatory mediators (such as cytokines, interleukins, prostaglandins, and leukotrienes), inhibition of immune cell migration and activation (including neutrophils, lymphocytes, and macrophages), stabilization of lysosomal and capillary membranes, and upregulation of anti-inflammatory proteins. The result is a broad anti-inflammatory and immunosuppressive effect, with negligible mineralocorticoid activity."
      },
      {
        "name": "Depakote",
        "description": "Depakote (divalproex sodium) is used to treat certain mood episodes (mania, mixed features) in adults with bipolar disorder, various types of seizures in adults and children (such as complex partial seizures and absence seizures), and prevent migraine headaches in adults.",
        "alternate_names": ["divalproex sodium", "valproic acid", "sodium valproate"],
        "mechanism_of_action": "Depakote’s precise mechanism is not fully understood, but it is believed to work mainly by increasing the levels of gamma-aminobutyric acid (GABA), an inhibitory neurotransmitter in the brain, which helps calm neural activity and reduce symptoms of mania and seizures. It also blocks voltage-dependent sodium channels, suppressing high-frequency neuronal firing, and may affect multiple molecular pathways involved in neural plasticity and neuroprotection. Additionally, Depakote acts as a histone deacetylase inhibitor, which may influence gene expression and contribute to its therapeutic effects."
      },
      {
        "name": "Dextroamphetamine",
        "description": "Dextroamphetamine is a central nervous system stimulant prescribed to treat attention deficit hyperactivity disorder (ADHD) in children and adults, as well as narcolepsy, a sleep disorder characterized by excessive daytime sleepiness and sudden sleep attacks.",
        "alternate_names": ["Dexedrine", "Zenzedi", "ProCentra", "Xelstrym"],
        "mechanism_of_action": "Dextroamphetamine increases the levels of dopamine and norepinephrine (and to a lesser extent, serotonin) in the brain by several mechanisms. It promotes the release of these neurotransmitters from presynaptic nerve terminals, inhibits their reuptake by competitively blocking their transporters (DAT for dopamine, NET for norepinephrine, and SERT for serotonin), inhibits the enzyme monoamine oxidase (MAO), reducing neurotransmitter breakdown, and acts as an agonist at trace amine-associated receptor 1 (TAAR1), which further increases neurotransmitter release and inhibits reuptake."
      },
      {
        "name": "Dextromethorphan",
        "description": "Dextromethorphan is an over-the-counter cough suppressant used to reduce the urge to cough caused by the common cold, inhaled irritants, or allergies. It is commonly found in many cough and cold medicines, either alone or in combination with other ingredients, and is used to provide temporary relief from cough that makes it hard to sleep or go about daily activities. Dextromethorphan is also used in combination with other drugs for specific medical conditions, such as pseudobulbar affect (with quinidine) and, in combination with bupropion, for major depressive disorder.",
        "alternate_names": ["Robitussin", "Delsym", "Balminil", "Calmylin"],
        "mechanism_of_action": "Dextromethorphan works by acting on the brain to suppress the cough reflex. Specifically, it slows activity in certain areas of the brain that trigger coughing. Pharmacologically, it is a noncompetitive NMDA (N-methyl-D-aspartate) receptor antagonist and a sigma-1 receptor agonist, and it also acts as a nonselective serotonin reuptake inhibitor at higher doses. These actions elevate the threshold for coughing without affecting ciliary activity in the airways. At standard doses, its primary effect is cough suppression; at higher or non-medical doses, it can produce dissociative and hallucinogenic effects due to NMDA receptor antagonism."
      },
      {
        "name": "Dextrose",
        "description": "Dextrose is a simple sugar (chemically identical to glucose) used medically to treat low blood sugar (hypoglycemia), dehydration, and, in some cases, high blood potassium (hyperkalemia). It is commonly administered intravenously in hospitals for rapid correction of hypoglycemia, as a source of calories for patients unable to eat, and sometimes in combination with other drugs or nutrients for nutritional support.",
        "alternate_names": ["D-glucose", "Glucose", "Glucon-D"],
        "mechanism_of_action": "Dextrose is a carbohydrate that is rapidly absorbed and metabolized by the body, providing a quick source of energy for cells and organs. When administered, it raises blood glucose levels, supplying energy to tissues through glycolysis and subsequent metabolic pathways that generate ATP (energy molecules). In the case of hypoglycemia, dextrose quickly restores blood sugar to normal levels. When used for hyperkalemia, dextrose is often given with insulin to help shift potassium from the blood into cells, lowering blood potassium concentrations."
      },
      {
        "name": "Diastat",
        "description": "Diastat is a brand name for diazepam rectal gel, which is used as an emergency treatment for acute, intermittent, stereotypic episodes of frequent seizure activity (also known as seizure clusters or acute repetitive seizures) in people with epilepsy. It is intended for use in adults and children ages 2 years and older who are already taking other anti-epileptic medications but need additional control for breakthrough or cluster seizures. Diastat is not meant for daily use, but rather as an as-needed (PRN) rescue medication to stop ongoing seizures and prevent further episodes within a short period.",
        "alternate_names": ["diazepam rectal gel"],
        "mechanism_of_action": "Diastat (diazepam rectal gel) is a benzodiazepine that enhances the activity of gamma-aminobutyric acid (GABA), the main inhibitory neurotransmitter in the brain. By increasing GABA’s effect at the GABAAA receptor, diazepam helps slow down excessive electrical activity in the brain, which is responsible for seizures. This action rapidly calms neuronal firing and can stop ongoing seizures."
      },
      {
        "name": "Diazepam",
        "description": "Diazepam is a long-acting benzodiazepine used to treat a variety of conditions, including anxiety, acute alcohol withdrawal symptoms (e.g., agitation, tremor, hallucinosis, and delirum tremens), muscle spasms, recurrent seizures, preoperative sedation, etc.",
        "alternate_names": ["Valium", "Ducene"],
        "mechanism_of_action": "Diazepam acts as a positive allosteric modulator at the GABA-A receptor, the main inhibitory neurotransmitter receptor in the central nervous system. By binding to a specific site on the GABA-A receptor complex, diazepam increases the frequency of chloride channel opening in response to GABA, leading to greater chloride influx, hyperpolarization of neuronal membranes, and reduced neuronal excitability. This produces its characteristic sedative, anxiolytic, anticonvulsant, muscle relaxant, and amnesic effects. The specific clinical effects are mediated by action in different brain regions: anxiolytic effects via the limbic system, muscle relaxant effects via the spinal cord and motor neurons, and sedative/anticonvulsant effects via the cortex, thalamus, and cerebellum."
      },
      {
        "name": "Diclofenac",
        "description": "Diclofenac is a nonsteroidal anti-inflammatory drug (NSAID) used to treat mild to moderate pain and inflammation associated with conditions such as osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, and acute musculoskeletal injuries. It is also used for the treatment of menstrual cramps (dysmenorrhea), acute migraine attacks, postoperative pain, and, in topical forms, for localized relief of pain and swelling from arthritis or minor injuries. Ophthalmic formulations are used for postoperative eye inflammation and pain.",
        "alternate_names": ["Voltaren", "Cataflam", "Cambia", "Zipsor", "Zorvolex", "Dyloject", "Dicloflex"],
        "mechanism_of_action": "Diclofenac works by inhibiting cyclooxygenase enzymes (COX-1 and COX-2), which are responsible for the synthesis of prostaglandins-substances that mediate inflammation, pain, and fever. By blocking prostaglandin production, diclofenac reduces inflammation, alleviates pain, and lowers fever. It is considered to have partial selectivity for COX-2 over COX-1, which may contribute to its potency and side effect profile. Diclofenac may also inhibit other inflammatory pathways, such as lipoxygenase and phospholipase A2, further reducing the production of pro-inflammatory mediators."
      },
      {
        "name": "Diflucan",
        "description": "Diflucan is an antifungal medication used to treat and prevent a wide range of fungal and yeast infections. Common indications include vaginal yeast infections, oral thrust, esophageal candidiasis, systemic candida infections, urinary tract and peritoneal candida infections, cryptococcal meningitis, and prevention of fungal infections in immunocompromised patients.",
        "alternate_names": ["fluconazole", "Biozolene", "Dimycon", "Elazor", "Fungata", "Mutum", "Triflucan"],
        "mechanism_of_action": "Fluconazole is an azole antifungal that works by inhibiting the fungal cytochrome P-450 enzyme 14α-demethylase, which is required for the conversion of lanosterol to ergosterol, a key component of the fungal cell membrane. By blocking ergosterol synthesis, fluconazole disrupts the integrity and function of the fungal cell membrane, leading to impaired cell growth and ultimately cell death."
      },
      {
        "name": "Digoxin",
        "description": "Digoxin is primarily used to treat heart failure (especially with reduced ejection fraction) and certain types of abnormal heart rhythms (arrhythmias), such as chronic atrial fibrillation and atrial flutter. It is often used when other therapies (like beta blockers or calcium channel blockers) are insufficient or not tolerated. Digoxin helps control heart rate in atrial fibrillation and improves symptoms of heart failure, though it does not reduce mortality.",
        "alternate_names": ["Lanoxin", "Digitek", "Digox", "Cardoxin", "Toloxin"],
        "mechanism_of_action": "Digoxin is a cardiac glycoside that works by inhibiting the sodium-potassium ATPase ('sodium pump') in heart muscle cells. This inhibition increases intracellular sodium, which leads to increased intracellular calcium via the sodium-calcium exchanger. The higher calcium levels enhance the force of heart contractions (positive inotropic effect), improving cardiac output in heart failure. Additionally, digoxin stimulates the vagus nerve (parasympathetic effect), which slows conduction through the atrioventricular (AV) node and increases its refractory period. This action helps control heart rate in atrial fibrillation and atrial flutter (negative chronotropic effect."
      },
      {
        "name": "Dilantin",
        "description": "Dilantin is an anticonvulsant medication used to control and prevent certain types of seizures, specifically tonic-clonic (grand mal) seizures and focal (partial) seizures in adults and children. It is also used to prevent and treat seizures that may occur during or after neurosurgery. Dilantin is not effective for absence (petit mal) seizures.",
        "alternate_names": ["phenytoin", "Phenytek"],
        "mechanism_of_action": "Phenytoin works by stabilizing neuronal membranes and decreasing seizure activity in the brain. It does this primarily by blocking voltage-gated sodium channels in their inactive state, which reduces the ability of neurons to fire high-frequency action potentials. This use- and voltage-dependent blockade of sodium channels prevents the spread of seizure activity by filtering out sustained, high-frequency neuronal discharges, while sparing normal brain activity at lower firing rates. The primary site of action is thought to be the motor cortex, where it inhibits the spread of seizure activity."
      },
      {
        "name": "Dilaudid",
        "description": "Dilaudid (hydromorphone) is a potent opioid analgesic used to manage moderate to severe pain, particularly when other pain medications have not been effective or cannot be tolerated. It is commonly prescribed for acute pain, severe chronic pain (such as cancer-related pain), and is available in both oral and injectable forms for use in hospital and outpatient settings.",
        "alternate_names": ["hydromorphone", "Exalgo", "Palladone"],
        "mechanism_of_action": "Hydromorphone works by binding to and activating mu-opioid receptors in the brain and spinal cord, which blocks the transmission of pain signals and alters the perception of pain. It also has some activity at delta and kappa opioid receptors, but its primary analgesic effect is through the mu-opioid receptor. This activation not only provides pain relief but can also cause sedation, respiratory depression, and euphoria."
      },
      {
        "name": "Diltiazem",
        "description": "Diltiazem is a prescription medication used to treat high blood pressure (hypertension), chronic stable angina (chest pain), and certain types of abnormal heart rhythms (such as atrial fibrillation and atrial flutter). By lowering blood pressure, it helps reduce the risk of heart attacks, strokes, and other cardiovascular complications. It is also used off-label for conditions like Raynaud's phenomenon and to help heal anal fissures (in topical form).",
        "alternate_names": ["Cardizem", "Dilacor", "Matzim", "Taztia"],
        "mechanism_of_action": "Diltiazem is a non-dihydropyridine calcium channel blocker (benzothiazepine class). It works by inhibiting the influx of calcium ions through L-type calcium channels in the heart and vascular smooth muscle during depolarization. This causes relaxation of arterial smooth muscle (vasodilation), lowering peripheral resistance and blood pressure. In the heart, diltiazem slows conduction through the sinoatrial (SA) and atrioventricular (AV) nodes, which decreases heart rate (negative chronotropic effect) and reduces the force of contraction (negative inotropic effect). These actions relieve angina by reducing the heart’s oxygen demand and control certain arrhythmias by slowing abnormal electrical conduction."
      },
      {
        "name": "Donepezil",
        "description": "Donepezil is primarily used to treat symptoms of dementia associated with Alzheimer’s disease, including memory loss, confusion, and difficulties with thinking and performing daily activities. It is effective in mild, moderate, and severe stages of Alzheimer’s disease, helping to improve or stabilize cognitive function and behavior, though it does not cure the disease or halt its progression.",
        "alternate_names": ["Aricept", "Adlarity"],
        "mechanism_of_action": "Donepezil is a selective and reversible acetylcholinesterase inhibitor. It works by blocking the enzyme acetylcholinesterase, which breaks down acetylcholine-a neurotransmitter important for memory, learning, and reasoning. By inhibiting this enzyme, donepezil increases the concentration of acetylcholine in the brain, enhancing cholinergic transmission and temporarily improving cognitive symptoms in Alzheimer’s disease."
      },
      {
        "name": "Doxycycline",
        "description": "Doxycycline is a broad-spectrum antibiotic used to treat a wide variety of bacterial infections.",
        "alternate_names": ["Vibramycin-D", "Oracea", "Efracea", "Periostat"],
        "mechanism_of_action": "Doxycycline is a tetracycline-class antibiotic that works by binding to the 30S ribosomal subunit of bacteria, inhibiting protein synthesis. This prevents bacteria from producing essential proteins needed for growth and replication, making doxycycline bacteriostatic (it stops bacteria from multiplying, allowing the immune system to eliminate them). Its high lipophilicity allows it to penetrate tissues effectively, and it is well absorbed from the gastrointestinal tract."
      },
      {
        "name": "Dulcolax",
        "description": "Dulcolax is a stimulant laxative used to treat occasional constipation and to empty the bowels before medical procedures such as surgery, colonoscopy, or certain X-rays. It is also used to relieve symptoms of constipation, including abdominal pain, bloating, and hard stool, and can help improve bowel movements in conditions like irritable bowel syndrome (IBS).",
        "alternate_names": ["biscodyl", "Bisalax", "Bolax", "Spirolax"],
        "mechanism_of_action": "Bisacodyl is a prodrug that is converted in the colon to its active metabolite, bis-(p-hydroxyphenyl)-pyridyl-2-methane (BHPM). This metabolite stimulates parasympathetic nerves in the colon, increasing intestinal motility and secretions, thereby accelerating transit and softening the stool. Bisacodyl also stimulates adenylate cyclase, increasing cyclic AMP, which leads to active secretion of chloride and bicarbonate into the intestinal lumen, with water and electrolytes following passively. Additionally, it decreases the expression of aquaporin 3, reducing water reabsorption from the colon and increasing water content in the stool."
      },
      {
        "name": "DuoNeb",
        "description": "DuoNeb is a combination inhalation solution containing albuterol and ipratropium, used to prevent and treat bronchospasm in people with chronic obstructive pulmonary disease (COPD), including chronic bronchitis and emphysema. It is typically prescribed for patients who require more than one bronchodilator to control their symptoms and is often used as a 'controller' medication, not for immediate relief during acute flare-ups.",
        "alternate_names": ["albuterol and ipratropium"],
        "mechanism_of_action": "Albuterol is a selective beta-2 adrenergic agonist. It stimulates beta-2 receptors in bronchial smooth muscle, activating adenyl cyclase and increasing cyclic AMP (cAMP), which relaxes airway muscles and leads to rapid bronchodilation. Ipratropium is an anticholinergic (antimuscarinic) agent. It blocks muscarinic cholinergic receptors in the airways, inhibiting the action of acetylcholine, which decreases cyclic guanosine monophosphate (cGMP) and relaxes bronchial smooth muscle, reducing bronchoconstriction and airway secretions."
      },
      {
        "name": "Effexor",
        "description": "Effexor is an antidepressant used to treat several mental health conditions in adults, including nmajor despressive disorder (MDD), generalized anxiety disorder (GAD), social anxiety disorder (SAD), and panic disorder.",
        "alternate_names": ["venlafaxine"],
        "mechanism_of_action": "Venlafaxine is a serotonin-norepinephrine reuptake inhibitor (SNRI). At lower doses, it primarily inhibits the reuptake of serotonin, acting similarly to an SSRI; at higher doses, it also inhibits norepinephrine reuptake, and to a lesser extent, dopamine reuptake. By blocking these neurotransmitter transporters, venlafaxine increases the levels of serotonin and norepinephrine (and, weakly, dopamine) in the brain, which helps improve mood, reduce anxiety, and relieve pain symptoms."
      },
      {
        "name": "Entresto",
        "description": "Entresto is a prescription medication used to treat chronic heart failure, particularly in adults with reduced ejection fraction (HFrEF), meaning the heart’s left side pumps out less blood than normal. It is FDA-approved to reduce the risk of cardiovascular death and hospitalization due to heart failure. Entresto is also approved for use in children ages 1 year and older with symptomatic heart failure due to systemic left ventricular systolic dysfunction.",
        "alternate_names": ["sacubitril/valsartan"],
        "mechanism_of_action": "Entresto is the first-in-class angiotensin receptor neprilysin inhibitor (ARNI). It contains two active components. Sacubitril: a neprilysin inhibitor that increases levels of beneficial peptides (natriuretic peptides) by preventing their breakdown. This action helps dilate blood vessels, reduce sodium retention, and decrease fluid buildup. Valsartan: an angiotensin II receptor blocker (ARB) that blocks the effects of angiotensin II at the AT1 receptor, leading to vasodilation, reduced aldosterone secretion, and lower blood pressure."
      },
      {
        "name": "Epinephrine",
        "description": "Epinephrine is a life-saving medication primarily used to treat severe allergic reactions (anaphylaxis), including those caused by foods, insect stings, medications, and other allergens. It is also used in emergency medicine to restore cardiac rhythm during cardiac arrest, manage severe asthma attacks, treat croup, control mucosal congestion, and as an adjunct to local anesthetics to prolong their effect and reduce bleeding.",
        "alternate_names": ["adrenaline", "EpiPen", "Allerject"],
        "mechanism_of_action": "Epinephrine is a nonselective agonist of all alpha (α1, α2) and beta (β1, β2, β3) adrenergic receptors. Alpha-adrenergic effects: Causes vasoconstriction, which raises blood pressure and reduces swelling and fluid leakage during anaphylaxis. Beta-1 adrenergic effects: Increases heart rate, contractility, and cardiac output, helping to restore heart function in cardiac arrest and support blood pressure. eta-2 adrenergic effects: Relaxes bronchial smooth muscle, leading to bronchodilation and rapid relief of airway constriction in asthma or anaphylaxis."
      },
      {
        "name": "Erythromycin",
        "description": "Erythromycin is a macrolide antibiotic used to treat a wide range of bacterial infections, including respiratory tract infections, whooping cough (pertussis), diphtheria, skin and soft tissue infections, ear infections, intestinal infections, seuxally transmitted infections, and pelvic inflammatory disease (PID).",
        "alternate_names": ["E.E.S"],
        "mechanism_of_action": " Erythromycin works by binding to the 50S subunit of the bacterial ribosome, inhibiting protein synthesis by blocking the translocation step and preventing the growth and multiplication of bacteria. This action is primarily bacteriostatic (stops bacterial growth), but can be bactericidal (kills bacteria) at higher concentrations. Erythromycin also acts as a motilin receptor agonist, which can increase gut motility."
      },
      {
        "name": "Excedrin",
        "description": "Excedrin is an over-the-counter combination medication used to provide temporary relief from headaches (including migraines and tension headaches), as well as minor aches and pains due to conditions such as arthritis, muscle aches, toothaches, menstrual cramps, colds, and premenstrual pain.",
        "alternate_names": [""],
        "mechanism_of_action": "Excedrin contains three active ingredients that work together to relieve pain. Acetaminophen is an analgesic and antipyretic that acts primarily in the central nervous system to raise the pain threshold, likely by inhibiting prostaglandin synthesis in the brain. Aspirin is a nonsteroidal anti-inflammatory drug (NSAID) that reduces pain, inflammation, and fever by inhibiting the production of prostaglandins through irreversible inhibition of cyclooxygenase (COX) enzymes. Caffeine is a central nervous system stimulant and vasoconstrictor. It enhances the pain-relieving effects of acetaminophen and aspirin, and by constricting blood vessels, it can help counteract the vasodilation thought to contribute to headache and migraine symptoms."
      },
      {
        "name": "Famotidine",
        "description": "Famotidine is used to treat and prevent conditions caused by excess stomach acid, including heartburn and acid indigestion, stomach and small intestine (duodenal) ulcers, GERD, erosive esophagitis caused by acid reflux, and pathological hypersecretory conditions such as Zollinger-Ellison syndrome.",
        "alternate_names": ["famotidine", "Pepcid", "Zantac"],
        "mechanism_of_action": "Famotidine is a histamine H2 receptor antagonist (H2 blocker). It works by competitively blocking H2 receptors on the basolateral membrane of gastric parietal cells, which inhibits the action of histamine and reduces both the volume and acidity of gastric secretions. This results in decreased stomach acid production, providing relief from acid-related symptoms and promoting ulcer healing."
      },
      {
        "name": "Farxiga",
        "description": "Farxiga is a prescription medication used to improve blood sugar control in adults and children (age 10 and older) with type 2 diabetes, alongside diet and exercise, reduce the risk of hospitalization for heart failure in adults with type 2 diabetes who also have cardiovascular disease or multiple risk factors, lower the risk of cardiovascular death, hospitalization for heart failure, and urgent heart failure visits in adults with heart failure, and reduce the risk of worsening kidney disease, end-stage kidney disease, cardiovascular death, and hospitalization for heart failure in adults with chronic kidney disease at risk of progression",
        "alternate_names": ["dapaglifozin", "Forxiga"],
        "mechanism_of_action": "Farxiga is a sodium-glucose cotransporter 2 (SGLT2) inhibitor. It works by inhibiting SGLT2 in the proximal renal tubules of the kidneys, which reduces the reabsorption of filtered glucose and sodium, reducing sodium reabsorption, which leads to osmotic diuresis and natriuresis (loss of water and sodium), lowering blood pressure and reducing fluid overload-key benefits in heart failure and chronic kidney disease, reducing intraglomerular pressure in the kidneys, which helps protect against further kidney damage, and lowering the activity of the sympathetic nervous system and reducing cardiac preload and afterload, thereby decreasing strain on the heart and improving heart function in heart failure."
      },
      {
        "name": "Fenofibrate",
        "description": "Fenofibrate is a medication primarily used to lower elevated cholesterol and triglyceride levels in adults, particularly in cases of mixed dyslipidemia (high LDL and triglycerides with low HDL), severe hypertriglyceridemia, and primary hypercholesterolemia. It is often prescribed alongside a low-fat diet and exercise, and may be used in combination with other lipid-lowering medications if lifestyle changes alone are insufficient. By improving lipid profiles, fenofibrate aims to reduce the risk of complications such as pancreatitis and, in certain populations, may help lower cardiovascular risk, especially in those with high triglycerides and low HDL cholesterol.",
        "alternate_names": ["Tricor", "Lipofen", "Lofibra", "Antara", "Triglide"],
        "mechanism_of_action": "Fenofibrate involves activation of the peroxisome proliferator-activated receptor alpha (PPARα), a nuclear receptor that regulates lipid metabolism. Activation of PPARα increases the expression of lipoprotein lipase and reduces apoprotein CIII, thereby enhancing the breakdown and clearance of triglyceride-rich particles from the blood. It also increases the synthesis of apoproteins AI and AII, leading to higher HDL (good) cholesterol levels, and reduces the production of very low-density lipoprotein (VLDL) and LDL (bad) cholesterol. Through these effects, fenofibrate lowers plasma triglycerides, VLDL, and LDL cholesterol, while raising HDL cholesterol, thus improving overall lipid balance."
      },
      {
        "name": "Fentanyl",
        "description": "Fentanyl is a highly potent synthetic opioid used medically for the management of severe pain, such as pain following surgery or pain in patients with advanced cancer who are tolerant to other opioids. It is approximately 50 to 100 times more potent than morphine and is typically prescribed in forms such as injections, transdermal patches, and lozenges. Fentanyl is also sometimes used as an anesthetic adjunct in hospital settings.",
        "alternate_names": ["Actiq", "Duragesic"],
        "mechanism_of_action": "The mechanism of action of fentanyl involves binding primarily to mu-opioid receptors in the brain and spinal cord. This activation blocks pain pathways, leading to profound analgesia, sedation, and feelings of euphoria. Fentanyl also increases dopamine release in reward areas of the brain, which contributes to its addictive potential. It can activate other opioid receptors, such as delta and kappa, but its primary effects are mediated through mu-receptor agonism."
      },
      {
        "name": "Flagyl",
        "description": "Flagyl is the brand name for metronidazole, an antibiotic and antiprotozoal medication used to treat a wide range of infections. It is commonly prescribed for bacterial infections of the vagina (such as bacterial vaginosis), stomach, intestines, liver, skin, joints, brain and spinal cord, lungs, heart, and bloodstream. Flagyl is also used to treat certain parasitic infections, including trichomoniasis (a sexually transmitted infection), amebiasis, and giardiasis. Additionally, it is used to prevent infections after certain surgical procedures, especially those involving the colon or abdomen.",
        "alternate_names": ["Flagystatin", "Likmez", "metronidazole"],
        "mechanism_of_action": "Flagyl works by entering bacterial and protozoal cells and, under low-oxygen (anaerobic) conditions, is reduced to its active form. This active form interacts with microbial DNA, causing DNA strand breaks and inhibiting nucleic acid synthesis, ultimately leading to cell death. Its mechanism is highly effective against anaerobic bacteria and certain protozoa, but it does not affect viruses or aerobic bacteria."
      },
      {
        "name": "Flecainide",
        "description": "Flecainide is a prescription antiarrhythmic medication used to treat certain serious and potentially life-threatening abnormal heart rhythms. It is most commonly prescribed for paroxysmal supraventricular tachycardia (PSVT), paroxysmal atrial fibrillation or flutter, Wolff-Parkinson-White syndrome, and other supraventricular tachycardias, especially in patients without significant structural heart disease. Flecainide may also be used to manage sustained ventricular tachycardia and has a role in treating arrhythmias such as catecholaminergic polymorphic ventricular tachycardia (CPVT) and fetal tachycardia.",
        "alternate_names": ["Tambocor", "Almarytm"],
        "mechanism_of_action": "Flecainide is classified as a class Ic antiarrhythmic agent. Its primary mechanism of action is the potent blockade of fast inward sodium (Na+) channels in cardiac cells, which slows the upstroke of the cardiac action potential and reduces excitability, especially in the His-Purkinje system and ventricular myocardium. This results in slowed conduction of electrical impulses through the heart and stabilization of the heartbeat. Flecainide also inhibits the delayed rectifier potassium current (IKr), prolonging the action potential duration, and blocks ryanodine receptor 2 (RyR2), reducing abnormal calcium release from the sarcoplasmic reticulum, which helps suppress arrhythmogenic triggers, particularly in CPVT. The drug’s sodium channel blockade is use-dependent, meaning its effect increases with faster heart rates, making it especially effective in treating tachyarrhythmias."
      },
      {
        "name": "Flexeril",
        "description": "Flexeril (cyclobenzaprine), is a skeletal muscle relaxant used alongside rest and physical therapy to relieve muscle spasms and discomfort associated with acute, painful musculoskeletal conditions such as strains, sprains, or other muscle injuries. It is not effective for muscle spasms caused by central nervous system diseases like cerebral palsy.",
        "alternate_names": ["Amrix", "Fexmid"],
        "mechanism_of_action": "Cyclobenzaprine works primarily by acting on the central nervous system, specifically at the brainstem level, to reduce tonic somatic motor activity. It decreases muscle hyperactivity by influencing both gamma and alpha motor systems, thereby blocking nerve impulses or pain sensations sent to the brain. This mechanism helps relieve muscle spasms without directly affecting muscle function or causing muscle weakness."
      },
      {
        "name": "Flomax",
        "description": "Flomax (tamsulosin) a prescription medication primarily used to treat symptoms of benign prostatic hyperplasia (BPH), which is an enlarged, non-cancerous prostate gland common in older men. BPH can cause urinary symptoms such as frequent or urgent need to urinate, difficulty starting urination, weak or intermittent urine stream, dribbling at the end of urination, and a feeling of incomplete bladder emptying. Flomax helps relieve these symptoms by relaxing the muscles in the prostate and bladder neck, making it easier to urinate.",
        "alternate_names": ["Flomaxtra, Contiflo, Urimax"],
        "mechanism_of_action": "The mechanism of action of tamsulosin involves selective blockade of alpha-1A adrenergic receptors, which are predominantly found in the smooth muscle of the prostate, bladder neck, and urethra. By blocking these receptors, tamsulosin causes relaxation of the smooth muscle in these areas, reducing resistance to urinary flow and improving BPH symptoms. Its selectivity for alpha-1A over alpha-1B receptors (which are more common in blood vessels) means it is less likely to cause significant drops in blood pressure compared to less selective alpha blockers."
      },
      {
        "name": "Flonase",
        "description": "Used to relieve symptoms of seasonal and year-round allergic and non-allergic rhinitis, such as sneezing, runny or stuffy nose, nasal itching, and itchy or watery eyes. It is also used to treat chronic rhinosinusitis with or without nasal polyps.",
        "alternate_names": ["fluticasone", "Flonase", "Veramyst", "Xhance"],
        "mechanism_of_action": "Reduces inflammation in the nasal passages by blocking the release of multiple inflammatory substances, including histamine and cytokines, resulting in relief of allergy and nasal symptoms."
      },
      {
        "name": "Fluconazole",
        "description": "Treats and prevents a wide range of fungal and yeast infections, including vaginal yeast infections, oral and esophageal thrush, systemic and urinary tract Candida infections, cryptococcal meningitis, and fungal infections in immunocompromised patients (such as those with HIV, cancer, or post-transplant).",
        "alternate_names": ["fluconazole", "Diflucan", "Azocan"],
        "mechanism_of_action": "Inhibits the fungal enzyme lanosterol 14-α-demethylase, blocking the synthesis of ergosterol, an essential component of the fungal cell membrane, resulting in impaired cell membrane formation and inhibition of fungal growth."
      },
      {
        "name": "Fluoxetine",
        "description": "Treats major depressive disorder, obsessive-compulsive disorder (OCD), panic disorder, bulimia nervosa, and premenstrual dysphoric disorder (PMDD). Also used in combination with olanzapine for treatment-resistant depression and depressive episodes in bipolar I disorder.",
        "alternate_names": ["fluoxetine", "Prozac", "Sarafem", "Rapiflux", "Selfemra"],
        "mechanism_of_action": "Increases serotonin levels in the brain by selectively inhibiting its reuptake into nerve cells, which helps improve mood, reduce anxiety, and control compulsive behaviors."
      },
      {
        "name": "Fosamax",
        "description": "Treats and prevents osteoporosis in postmenopausal women and men, including osteoporosis caused by long-term use of glucocorticoids. Also used to treat Paget’s disease of bone, a condition that leads to abnormal bone destruction and regrowth, resulting in bone deformity and pain.",
        "alternate_names": ["alendronate", "Fosamax", "Binosto"],
        "mechanism_of_action": "Inhibits bone breakdown by blocking osteoclast activity through interference with the mevalonate pathway, leading to decreased bone resorption and increased bone density."
      },
      {
        "name": "Furosemide",
        "description": "Treats fluid retention (edema) caused by conditions such as congestive heart failure, liver disease, and kidney disease, including nephrotic syndrome. Also used alone or with other medications to manage high blood pressure (hypertension).",
        "alternate_names": ["furosemide", "Lasix", "Furoscix", "Furocot", "Diaqua-2", "Lo-Aqua"],
        "mechanism_of_action": "Blocks the reabsorption of sodium and chloride in the kidneys, specifically at the thick ascending limb of the loop of Henle, which increases urine production and removes excess fluid and salt from the body."
      },
      {
        "name": "Gabapentin",
        "description": "Used to manage nerve pain from shingles (postherpetic neuralgia), control partial seizures in epilepsy (often as an add-on therapy), and treat moderate-to-severe restless legs syndrome. Frequently prescribed off-label for neuropathic pain from other causes, fibromyalgia, hot flashes, and certain mood or anxiety disorders.",
        "alternate_names": ["Neurontin", "Gralise", "Horizant"],
        "mechanism_of_action": "Binds to the α2δ subunit of voltage-gated calcium channels in the nervous system, reducing the release of excitatory neurotransmitters and decreasing abnormal nerve activity that causes seizures and neuropathic pain."
      },
      {
        "name": "Galantamine",
        "description": "Used to treat mild to moderate dementia associated with Alzheimer’s disease. It can help improve memory, awareness, and the ability to perform daily functions in affected individuals. Off-label, it may be used for other types of dementia and certain neurological or psychiatric conditions, but its primary indication is Alzheimer’s-related cognitive impairment.",
        "alternate_names": ["Razadyne", "Reminyl"],
        "mechanism_of_action": "Inhibits acetylcholinesterase to increase acetylcholine levels in the brain and also acts as a positive allosteric modulator at nicotinic acetylcholine receptors, enhancing cholinergic neurotransmission and supporting cognitive function."
      },
      {
        "name": "Glipizde",
        "description": "Used to lower blood sugar levels in people with type 2 diabetes, typically alongside diet and exercise, and sometimes with other diabetes medications.",
        "alternate_names": ["Glucotrol", "Glucotrol XL", "Metaglip"],
        "mechanism_of_action": "Stimulates the pancreas to release more insulin by blocking ATP-sensitive potassium channels on pancreatic beta cells, causing cell depolarization and calcium influx, which triggers insulin secretion."
      },
      {
        "name": "Glucagon",
        "description": "Treats severe hypoglycemia (very low blood sugar), especially in people with diabetes who cannot safely take oral glucose. Also used as a diagnostic aid during gastrointestinal imaging to relax the GI tract, and off-label for beta-blocker or calcium channel blocker overdose and esophageal food impaction.",
        "alternate_names": ["Glucagen", "Baqsimi", "Gvoke", "Glucagon Emergency Kit", "GlucaGen HypoKit"],
        "mechanism_of_action": "Stimulates the liver to rapidly release glucose into the bloodstream by activating glucagon receptors, which trigger glycogen breakdown (glycogenolysis) and new glucose production (gluconeogenesis), raising blood sugar levels. Also relaxes smooth muscle in the gastrointestinal tract."
      },
      {
        "name": "Glucophage",
        "description": "Used to manage and lower blood sugar levels in people with type 2 diabetes, especially when diet and exercise alone are not sufficient. It can be used alone or in combination with other diabetes medications, including insulin, to help prevent complications associated with high blood sugar.",
        "alternate_names": ["metformin", "Fortamet", "Glumetza", "Riomet"],
        "mechanism_of_action": "Lowers blood sugar primarily by decreasing glucose production in the liver (inhibiting hepatic gluconeogenesis), increasing insulin sensitivity in muscle and fat, and reducing intestinal absorption of glucose."
      },
      {
        "name": "Glucosamine",
        "description": "Commonly used to relieve symptoms of osteoarthritis, especially in the knee, by supporting joint health and reducing pain and stiffness. Sometimes used for other joint-related conditions, but strong evidence primarily supports its use in osteoarthritis.",
        "alternate_names": ["Genicin", "Optiflex-G", "Osteo Bi-Flex", "Schiff Move Free", "Pryflex"],
        "mechanism_of_action": "Serves as a building block for glycosaminoglycans and proteoglycans, which are essential for cartilage structure. May stimulate cartilage production and slow its breakdown, helping maintain joint function and reduce inflammation in osteoarthritis."
      },
      {
        "name": "Guaifenesin",
        "description": "Used to relieve chest congestion and help clear mucus from the airways in conditions such as the common cold, flu, bronchitis, and other respiratory illnesses that cause productive cough.",
        "alternate_names": ["Mucinex", "Robitussin", "Balminil Expectorant"],
        "mechanism_of_action": "Thins and loosens mucus in the airways by increasing the volume and decreasing the viscosity of bronchial secretions, making coughs more productive and helping clear mucus from the respiratory tract."
      },
      {
        "name": "Halicon",
        "description": "Used for the short-term treatment of insomnia, particularly to help with trouble falling or staying asleep. Typically prescribed for 7 to 10 days in adults when sleep disturbances are severe and disabling.",
        "alternate_names": ["triazolam", "Halcion"],
        "mechanism_of_action": "Enhances the effect of the neurotransmitter GABA at benzodiazepine receptors in the brain, producing sedative, hypnotic, and anxiolytic effects that promote sleep."
      },
      {
        "name": "Haldol",
        "description": "Used to treat schizophrenia and other psychotic disorders, control tics and vocal outbursts in Tourette syndrome, and manage severe behavioral problems in children when other treatments have failed. Also prescribed for acute agitation, delirium, and sometimes for severe nausea or vomiting in palliative care.",
        "alternate_names": ["Peridol"],
        "mechanism_of_action": "Blocks dopamine D2 receptors in the brain, reducing the effects of dopamine and helping to control symptoms of psychosis, agitation, and tics."
      },
      {
        "name": "Haloperidol",
        "description": "Used to treat schizophrenia and other psychotic disorders, control tics and vocal outbursts in Tourette syndrome, manage severe behavioral problems in children when other treatments have failed, and address acute agitation, delirium, and severe confusion or aggression in various medical and psychiatric settings. Also used for the treatment of mania in bipolar disorder and as an antiemetic in palliative care for severe nausea and vomiting.",
        "alternate_names": ["Serenace", "Dozic", "Aloperidin", "Duraperidol"],
        "mechanism_of_action": "Blocks dopamine D2 receptors in the brain, reducing dopamine activity, which helps control symptoms of psychosis, agitation, and tics."
      },
      {
        "name": "Heparin",
        "description": "Used to prevent and treat blood clots in conditions such as deep vein thrombosis (DVT), pulmonary embolism (PE), atrial fibrillation, acute coronary syndromes, and during surgeries or procedures that increase clot risk (like cardiac surgery, dialysis, or blood transfusions). Also used to maintain patency of intravenous catheters and for other thrombotic or embolic disorders.",
        "alternate_names": ["Liquaemin", "HepFlush", "Heparin Sodium"],
        "mechanism_of_action": "Enhances the activity of antithrombin III, which rapidly inactivates clotting factors-especially thrombin (factor IIa) and factor Xa-thereby preventing the formation and extension of blood clots."
      },
      {
        "name": "Humalog",
        "description": "Used to control high blood sugar in adults and children with type 1 or type 2 diabetes. Helps manage blood glucose levels around mealtimes to prevent complications from diabetes, such as nerve damage, kidney problems, and vision loss.",
        "alternate_names": ["Admelog", "Insulin Lispro"],
        "mechanism_of_action": "Acts as a rapid-acting insulin analog that lowers blood sugar by promoting glucose uptake into muscle and fat cells and reducing glucose production by the liver. Starts working within about 15 minutes of injection, peaks at around 1 hour, and lasts 2 to 4 hours."
      },
      {
        "name": "Humira",
        "description": "Treats a variety of autoimmune and inflammatory conditions, including rheumatoid arthritis, juvenile idiopathic arthritis, psoriatic arthritis, ankylosing spondylitis, Crohn’s disease, ulcerative colitis, plaque psoriasis, hidradenitis suppurativa, and certain types of uveitis. Used in both adults and children, depending on the specific condition and age.",
        "alternate_names": [ "adalimumab", "Amjevita", "Cyltezo", "Hadlima", "Hyrimoz", "Abrilada", "Hulio", "Yuflyma", "Yusimry", "Idacio", "Simlandi"],
        "mechanism_of_action": "Binds to and neutralizes tumor necrosis factor-alpha (TNF-α), a key inflammatory protein, blocking its interaction with cell surface receptors and thereby reducing inflammation and immune-mediated tissue damage."
      },
      {
        "name": "Hydralazine",
        "description": "Treats high blood pressure (hypertension), including severe or resistant cases, and is also used in managing heart failure (especially in combination with isosorbide dinitrate), hypertensive emergencies, and acute hypertension in pregnancy (such as preeclampsia or eclampsia).",
        "alternate_names": ["Apresoline", "Hydra-Zide", "Apresazide", "BiDil"],
        "mechanism_of_action": "Directly relaxes arterial smooth muscle, leading to vasodilation and reduced blood pressure. This effect is thought to involve inhibition of calcium release within vascular smooth muscle cells, which decreases peripheral resistance and lowers blood pressure."
      },
      {
        "name": "Hydrea",
        "description": " Used to treat chronic myeloid leukemia (CML), certain cancers of the head and neck (including locally advanced squamous cell carcinoma), and to reduce the frequency of painful crises and the need for blood transfusions in sickle cell anemia. Also prescribed for polycythemia vera and essential thrombocythemia, and sometimes for other blood disorders.",
        "alternate_names": ["hydroxyurea", "Droxia", "Siklos", "Litalir", "Xromi"],
        "mechanism_of_action": "Inhibits the enzyme ribonucleotide reductase, blocking DNA synthesis and slowing or stopping the growth of rapidly dividing cells. In sickle cell anemia, increases fetal hemoglobin production, which helps prevent sickling of red blood cells."
      },
      {
        "name": "Hydrochlorothiazide",
        "description": "Used to treat high blood pressure (hypertension) and manage edema (fluid retention) caused by conditions such as heart failure, kidney disease, or liver disease. Also prescribed for prevention of kidney stones in people with high calcium in their urine, and for certain cases of diabetes insipidus and other rare disorders.",
        "alternate_names": ["Microzide", "Hydrodiuril", "Oretic", "Esidrex", "Aquazide", "HCTZ"],
        "mechanism_of_action": "Blocks sodium and chloride reabsorption in the distal convoluted tubule of the kidney, increasing urine output and reducing fluid in the body, which lowers blood pressure and decreases swelling."
      },
      {
        "name": "Hydrocodone",
        "description": "Used to manage severe pain that requires around-the-clock opioid treatment and cannot be controlled with other pain medications. Also prescribed in combination products to relieve moderate to severe pain or to suppress cough in adults when other treatments are inadequate.",
        "alternate_names": ["Zohydro ER", "Hysingla", "Vicodin", "Norco", "Lortab", "Lorcet", "Anexsia", "Reprexain", "Vicoprofen", "Tussionex", "Hycodan", "Xodol", "Zydone"],
        "mechanism_of_action": "Binds to and activates mu-opioid receptors in the brain and spinal cord, blocking pain signal transmission and altering the perception of pain. Also suppresses the cough reflex by acting on the cough center in the medulla."
      },
      {
        "name": "Hydrocortisone",
        "description": "Used to treat a wide range of conditions, including inflammation and allergic reactions affecting the skin (eczema, dermatitis, psoriasis, insect bites), joints (arthritis, bursitis), and internal organs (asthma, lupus, ulcerative colitis). Also prescribed as hormone replacement therapy for adrenal insufficiency (such as Addison’s disease) and for severe allergic reactions, certain cancers, and immune-related disorders.",
        "alternate_names": ["Cortef", "Solu-Cortef", "Anusol-HC", "Cortaid", "Cortizone-10", "Westcort", "Alkindi Sprinkle", "Ala-Cort", "Preparation H Hydrocortisone"],
        "mechanism_of_action": "Binds to glucocorticoid receptors, altering gene expression to suppress the immune response and reduce production of inflammatory chemicals, leading to decreased swelling, redness, itching, and pain. Also replaces deficient cortisol in adrenal insufficiency."
      },
      {
        "name": "Hydroxychloroquine",
        "description": "Used to prevent and treat malaria, as well as to manage autoimmune conditions such as rheumatoid arthritis, systemic lupus erythematosus (SLE), discoid lupus, and juvenile idiopathic arthritis. Also prescribed for certain skin conditions and off-label for other connective tissue diseases.",
        "alternate_names": ["Plaquenil", "Quineprox", "Sovuna"],
        "mechanism_of_action": "Modulates immune system activity by increasing the pH within lysosomes and endosomes of immune cells, which interferes with antigen processing and presentation. Also inhibits activation of toll-like receptors, reducing the production of inflammatory cytokines. In malaria, kills the parasite by disrupting its ability to digest hemoglobin."
      },
      {
        "name": "Hydroxyurea",
        "description": "Used to treat chronic myeloid leukemia (CML), certain cancers of the head and neck, and to reduce the frequency of painful crises and the need for blood transfusions in sickle cell anemia. Also prescribed for polycythemia vera, essential thrombocythemia, and other myeloproliferative disorders.",
        "alternate_names": ["Hydrea", "Droxia", "Siklos", "Xromi", "Litalir", "Mylocel"],
        "mechanism_of_action": "Blocks DNA synthesis by inhibiting the enzyme ribonucleotide reductase, which slows or stops the growth of rapidly dividing cells in cancer. In sickle cell anemia, increases fetal hemoglobin (HbF) production, making red blood cells less likely to sickle and reducing painful episodes."
      },
      {
        "name": "Hydroxyzine",
        "description": "Used to relieve itching from allergic skin reactions, manage anxiety and tension, provide sedation before and after general anesthesia, and treat nausea and vomiting. Also prescribed for short-term management of insomnia and as an adjunct in certain psychiatric and medical conditions.",
        "alternate_names": ["Atarax", "Vistaril", "Hyzine", "Rezine", "Vistazine"],
        "mechanism_of_action": "Acts as a potent inverse agonist at histamine H1 receptors, blocking the effects of histamine to reduce allergy symptoms and itching. Also produces sedative and anxiolytic effects by decreasing activity in the brain, which helps with anxiety and promotes relaxation."
      },
      {
        "name": "Ibuprofen",
        "description": "Used to reduce fever and relieve mild to moderate pain and inflammation from conditions such as headache, toothache, back pain, menstrual cramps, muscle aches, arthritis (osteoarthritis, rheumatoid arthritis), and minor injuries. Also used for symptomatic relief of cold and flu and to manage pain after surgery or dental procedures.",
        "alternate_names": ["Advil", "Motrin", "Nurofen", "Brufen"],
        "mechanism_of_action": "Nonselectively inhibits cyclooxygenase (COX-1 and COX-2) enzymes, reducing the production of prostaglandins that cause pain, inflammation, and fever."
      },
      {
        "name": "Imbruvica",
        "description": "Treats chronic lymphocytic leukemia (CLL), small lymphocytic lymphoma (SLL), Waldenström’s macroglobulinemia (WM), and chronic graft-versus-host disease (cGVHD) in adults and children aged 1 year and older who have not responded to other treatments.",
        "alternate_names": ["ibrutinib", "Imbruvica"],
        "mechanism_of_action": "Blocks Bruton’s tyrosine kinase (BTK), a key enzyme in B-cell signaling pathways, by forming a covalent bond with the enzyme. This inhibition disrupts cancer cell growth and survival in B-cell malignancies and reduces abnormal immune cell activity in cGVHD."
      },
      {
        "name": "Imiquimod",
        "description": "Used to treat actinic keratosis (precancerous skin growths), superficial basal cell carcinoma (a type of skin cancer), and external genital and perianal warts. It may also be prescribed for other abnormal skin growths and certain off-label uses, such as vulvar intraepithelial neoplasia or resistant herpes simplex lesions.",
        "alternate_names": ["Aldara", "Zyclara", "Vyloma"],
        "mechanism_of_action": "Activates the immune system by stimulating toll-like receptor 7 (TLR7) on immune cells, leading to the release of cytokines such as interferon-alpha, interleukin-6, and tumor necrosis factor-alpha. This immune activation helps the body target and clear abnormal skin cells, warts, and some skin cancers."
      },
      {
        "name": "Imitrex",
        "description": "Used to treat acute migraine attacks in adults, with or without aura, and to relieve associated symptoms such as headache pain, nausea, and sensitivity to light or sound. The injectable form is also used for acute cluster headaches. It does not prevent migraines or cluster headaches, but treats symptoms once they begin.",
        "alternate_names": ["Onzetra Xsail", "Sumavel DosePro", "Zembrace SymTouch"],
        "mechanism_of_action": "Activates serotonin 5-HT1B and 5-HT1D receptors, causing constriction of cranial blood vessels and reducing the release of inflammatory neuropeptides, which relieves migraine and cluster headache symptoms."
      },
      {
        "name": "Imodium",
        "description": "Used to relieve acute diarrhea and reduce the frequency and urgency of bowel movements. Also helps control chronic diarrhea in conditions like inflammatory bowel disease and can decrease stool output in people with an ileostomy. Provides symptomatic relief from associated symptoms such as gas, bloating, and cramps.",
        "alternate_names": ["loperamide", "Diamode", "Imodium A-D"],
        "mechanism_of_action": "Slows intestinal movement by activating opioid receptors in the gut wall, which decreases peristalsis and increases absorption of fluids and electrolytes, resulting in firmer stools and fewer bowel movements."
      },
      {
        "name": "Ivermectin",
        "description": "Used to treat a variety of parasitic infections, including onchocerciasis (river blindness), strongyloidiasis (intestinal threadworm), scabies, head lice, and other worm infections such as ascariasis, trichuriasis, filariasis, and cutaneous larva migrans. Topical forms are also used for rosacea associated with Demodex mite infestation.",
        "alternate_names": ["Stromectol", "Sklice", "Soolantra"],
        "mechanism_of_action": "Binds to glutamate-gated chloride channels in nerve and muscle cells of parasites, increasing chloride ion influx, which leads to paralysis and death of the parasite. This action is highly selective for invertebrates and does not affect mammalian cells at standard doses."
      },
      {
        "name": "Janumet",
        "description": "Used to improve blood sugar control in adults with type 2 diabetes when diet and exercise alone are not enough. Not used for type 1 diabetes or diabetic ketoacidosis.",
        "alternate_names": ["Janumet XR"],
        "mechanism_of_action": "Combines two medicines: sitagliptin, a DPP-4 inhibitor that increases incretin hormones to boost insulin release and lower glucagon after meals, and metformin, a biguanide that decreases liver glucose production, reduces intestinal glucose absorption, and improves insulin sensitivity in the body."
      },
      {
        "name": "Jakafi",
        "description": "Used to treat adults with myelofibrosis (a type of bone marrow cancer), adults with polycythemia vera who did not respond to or could not tolerate hydroxyurea, and adults and children 12 years and older with acute or chronic graft-versus-host disease (GVHD) after failure of prior treatments.",
        "alternate_names": ["ruxolitinib"],
        "mechanism_of_action": "Blocks the activity of Janus kinase 1 and 2 (JAK1 and JAK2), enzymes that are overactive in certain blood disorders and GVHD, thereby reducing abnormal blood cell production and dampening harmful immune signaling."
      },
      {
        "name": "Januvia",
        "description": "Used to improve blood sugar control in adults with type 2 diabetes, alongside diet and exercise. Not used for type 1 diabetes or diabetic ketoacidosis, and typically prescribed alone or with other diabetes medications if needed.",
        "alternate_names": ["sitagliptin", "Janumet", "Tradjenta"],
        "mechanism_of_action": "Blocks the enzyme DPP-4, which increases levels of incretin hormones. This boosts insulin release from the pancreas and lowers glucagon levels after meals, helping to reduce blood sugar."
      },
      {
        "name": "Jardiance",
        "description": "Used to improve blood sugar control in adults and children with type 2 diabetes, reduce the risk of cardiovascular death in people with type 2 diabetes and established heart disease, lower the risk of hospitalization and death in adults with heart failure, and decrease the risk of disease progression and serious complications in adults with chronic kidney disease.",
        "alternate_names": ["empagliflozin"],
        "mechanism_of_action": "Blocks the SGLT2 protein in the kidneys, reducing reabsorption of glucose back into the blood and increasing its excretion in urine, which lowers blood sugar. Also reduces sodium reabsorption, helping lower blood pressure and decrease strain on the heart and kidneys."
      },
      {
        "name": "Kariva",
        "description": "Used to prevent pregnancy as an oral contraceptive. Also sometimes prescribed off-label to regulate menstrual cycles, reduce menstrual pain, and manage acne or other hormone-related conditions.",
        "alternate_names": ["desogestrel-ethinyl estradiol", "Azurette", "Apri", "Enskyce", "Isibloom", "Viorele", "Reclipsen", "Pimtrea", "Kimidess", "Juleber", "Bekyree", "Simliya", "Velivet", "Caziant", "Cyclessa", "Kalliga", "Cyred", "Cyred EQ", "Volnea"],
        "mechanism_of_action": "Prevents ovulation and thickens cervical mucus to block sperm entry, while altering the uterine lining to reduce the likelihood of implantation. The combined effect of estrogen and progestin hormones makes pregnancy much less likely."
      },
      {
        "name": "Kayexalate",
        "description": "Used to treat high potassium levels in the blood (hyperkalemia), typically in people with kidney problems or other conditions that cause dangerous elevations in potassium. It is not intended for emergency treatment of life-threatening hyperkalemia due to its delayed onset of action.",
        "alternate_names": ["Kalexate", "Kionex"],
        "mechanism_of_action": "Acts as a non-absorbed cation exchange resin in the gastrointestinal tract, where it exchanges sodium ions for potassium ions, binding potassium in the gut and increasing its excretion in the stool, thereby lowering serum potassium levels."
      },
      {
        "name": "Keflex",
        "description": "Treats a variety of bacterial infections, including upper and lower respiratory tract infections, ear infections (otitis media), skin and soft tissue infections, urinary tract infections (UTIs), bone infections, and acute prostatitis. Effective against susceptible strains of bacteria such as Streptococcus pneumoniae, Streptococcus pyogenes, Staphylococcus aureus, Escherichia coli, Proteus mirabilis, Klebsiella pneumoniae, Haemophilus influenzae, and Moraxella catarrhalis.",
        "alternate_names": ["cephalexin", "Keftab", "Keflet"],
        "mechanism_of_action": "Inhibits bacterial cell wall synthesis by binding to penicillin-binding proteins, leading to cell lysis and death in susceptible bacteria (bactericidal effect)."
      },
      {
        "name": "Kenalog",
        "description": "Treats a wide range of inflammatory and autoimmune conditions, including joint disorders (such as rheumatoid arthritis, gout, and bursitis), skin diseases (like eczema, psoriasis, discoid lupus, and lichen planus), severe allergic reactions, ulcerative colitis, and inflammatory eye, lung, blood, and endocrine disorders. It is used as an injection into joints, muscles, skin lesions, or as a topical or nasal preparation, depending on the condition.",
        "alternate_names": ["triamcinolone acetonide", "Nasacort", "Cinolar", "Oralone", "Pediaderm TA", "Trianex", "Triderm", "Zilretta", "Xipere"],
        "mechanism_of_action": "Acts as a potent corticosteroid by binding to glucocorticoid receptors, suppressing the immune response and reducing the production of inflammatory chemicals, which decreases swelling, redness, itching, and pain in affected tissues."
      },
      {
        "name": "Keppra",
        "description": " Used to treat various types of seizures in epilepsy, including focal (partial-onset) seizures in adults and children (ages 1 month and older), myoclonic seizures in people with juvenile myoclonic epilepsy (ages 12 and older), and generalized tonic-clonic (grand mal) seizures in adults and children (ages 6 and older). Often prescribed alone or in combination with other antiepileptic drugs.",
        "alternate_names": ["levetiracetam", "Elepsia XR", "Keppra XR", "Roweepra", "Spritam"],
        "mechanism_of_action": "Binds to synaptic vesicle protein 2A (SV2A) in the brain, modulating neurotransmitter release and reducing abnormal electrical activity that causes seizures."
      },
      {
        "name": "Ketamine",
        "description": "Used as a general anesthetic for surgical and diagnostic procedures, procedural sedation, and pain management (especially for severe or refractory pain). Also used off-label for treatment-resistant depression, certain anxiety disorders, post-traumatic stress disorder (PTSD), and refractory status epilepticus. In emergency and critical care, it is valued for rapid sedation, short-term anesthesia, and as an adjunct in pain control.",
        "alternate_names": ["Ketalar", "Spravato", "Ketaset"],
        "mechanism_of_action": "Blocks N-methyl-D-aspartate (NMDA) receptors in the brain, reducing excitatory neurotransmission and producing dissociative anesthesia, analgesia, and sedation. Also increases glutamate release and stimulates AMPA receptors, which may enhance neuroplasticity and underlie its rapid antidepressant effects. Additional actions include mild activity at opioid, monoaminergic, and cholinergic receptors."
      },
      {
        "name": "Ketorolac",
        "description": "Used for short-term management of moderate to severe acute pain, often after surgery or injury, when pain requires strong relief. Also prescribed for pain relief in conditions such as musculoskeletal pain, migraines, dental pain, and pain during menstruation. Not intended for long-term use due to risk of serious side effects.",
        "alternate_names": [ "Toradol", "Sprix", "Acular", "Acuvail", "Ketanov", "Keftab"],
        "mechanism_of_action": "Nonselectively blocks cyclooxygenase enzymes (COX-1 and COX-2), reducing production of prostaglandins-chemicals in the body that cause pain, inflammation, and fever."
      },
      {
        "name": "Keytruda",
        "description": "Treats a wide range of cancers, including melanoma, non-small cell lung cancer, head and neck squamous cell carcinoma, classical Hodgkin lymphoma, urothelial carcinoma, gastric cancer, esophageal cancer, cervical cancer, endometrial cancer, renal cell carcinoma, triple-negative breast cancer, malignant pleural mesothelioma, biliary tract cancer, colorectal cancer with certain genetic features, and several other solid tumors. Used in adults and some children, often for advanced, metastatic, or treatment-resistant cancers.",
        "alternate_names": ["pembrolizumab", "MK-3475", "lambrolizumab"],
        "mechanism_of_action": "Blocks the PD-1 receptor on T cells, preventing its interaction with PD-L1 and PD-L2 proteins on tumor cells. This restores the immune system’s ability to recognize and attack cancer cells by reactivating T cell responses that tumors may have suppressed."
      },
      {
        "name": "Klonopin",
        "description": "Used to treat certain types of seizure disorders (including absence seizures, Lennox-Gastaut syndrome, myoclonic and akinetic seizures), panic disorder with or without agoraphobia, and as a short-term therapy for acute management of epilepsy. Also prescribed off-label for anxiety disorders, REM sleep behavior disorder, restless legs syndrome, and some movement and sleep disorders.",
        "alternate_names": ["Klonopin", "Klonopin ODT"],
        "mechanism_of_action": "Enhances the effect of the neurotransmitter GABA by binding to benzodiazepine receptors in the brain, producing a calming effect that reduces abnormal electrical activity, prevents seizures, and decreases anxiety."
      },
      {
        "name": "Klor-Con",
        "description": "Used to prevent or treat low blood potassium levels (hypokalemia), which can result from certain diseases, medications (such as diuretics), or prolonged illness with vomiting or diarrhea. Also indicated for patients at risk of developing hypokalemia, especially those with cardiac arrhythmias or on digitalis therapy, when dietary management or dose reduction of diuretics is insufficient.",
        "alternate_names": ["potassium chloride", "K-Dur", "Micro-K"],
        "mechanism_of_action": "Replenishes potassium by providing potassium ions, which are essential for nerve impulse transmission, muscle contraction (including the heart), and maintaining normal cellular function. Potassium is the main intracellular cation, and supplementation restores normal physiologic balance when levels are low."
      },
      {
        "name": "Labetalol",
        "description": "Used to treat high blood pressure (hypertension), including severe hypertension and hypertension during pregnancy. Also prescribed for hypertensive emergencies and sometimes for angina or to help prevent complications from high blood pressure, such as heart attack and stroke.",
        "alternate_names": ["Normodyne", "Trandate"],
        "mechanism_of_action": "Blocks both beta-adrenergic (β1 and β2) and alpha-1 adrenergic receptors, leading to slowed heart rate, reduced force of heart contractions, and relaxation of blood vessels. This dual action lowers blood pressure by decreasing resistance in the blood vessels and reducing the heart’s workload."
      },
      {
        "name": "Lacosamide",
        "description": "Used to treat partial-onset (focal) seizures in adults and children, and as adjunct therapy for primary generalized tonic-clonic seizures. Sometimes prescribed off-label for neuropathic pain and other neurological conditions.",
        "alternate_names": ["Vimpat", "Motpoly XR", "Lacolit"],
        "mechanism_of_action": "Selectively enhances slow inactivation of voltage-gated sodium channels in neurons, stabilizing hyperexcitable nerve membranes and reducing repetitive firing that leads to seizures. Also modulates collapsin response mediator protein-2 (CRMP-2), which may help prevent abnormal neuronal connections."
      },
      {
        "name": "Lactulose",
        "description": "Used to treat chronic constipation and to prevent and manage hepatic encephalopathy, a brain disorder caused by liver disease that leads to elevated blood ammonia levels. Also sometimes used for other conditions such as small intestine bacterial overgrowth testing and to counteract constipation from opioid use or hemorrhoids.",
        "alternate_names": ["Constulose", "Enulose", "Generlac", "Kristalose", "Cephulac", "Chronulac", "Cholac", "Bifiteral", "Constilac", "Laevolac"],
        "mechanism_of_action": "For constipation, acts as an osmotic laxative by drawing water into the colon, softening stool, and increasing bowel movements. For hepatic encephalopathy, is broken down by gut bacteria into acids that acidify the colon, converting ammonia into non-absorbable ammonium ions and promoting its excretion, thereby lowering blood ammonia levels."
      },
      {
        "name": "Lamictal",
        "description": "Used to treat various types of epileptic seizures in adults and children, including partial seizures, primary generalized tonic-clonic seizures, and seizures associated with Lennox-Gastaut syndrome. Also prescribed as a maintenance treatment to delay mood episodes in adults with bipolar I disorder, helping to prevent both depressive and manic episodes.",
        "alternate_names": ["lamotrigine", "Lamictal ODT", "Lamictal XR"],
        "mechanism_of_action": "Stabilizes brain activity by blocking voltage-sensitive sodium channels, which reduces the release of excitatory neurotransmitters like glutamate and aspartate. This action helps control seizures and mood swings in bipolar disorder."
      },
      {
        "name": "Lantus",
        "description": "Used to improve blood sugar control in adults with type 1 or type 2 diabetes and in children aged 6 years and older with type 1 diabetes. Not used for diabetic ketoacidosis. Administered once daily by subcutaneous injection as part of a diabetes management plan that includes diet and exercise.",
        "alternate_names": ["insulin glargine", "Lantus SoloStar"],
        "mechanism_of_action": "Acts as a long-acting insulin analog that lowers blood glucose by stimulating uptake of glucose into muscle and fat cells and inhibiting glucose production by the liver. Provides a steady, 24-hour glucose-lowering effect with no pronounced peak."
      },
      {
        "name": "Lasix",
        "description": "Used to treat fluid retention (edema) caused by conditions such as congestive heart failure, liver disease, and kidney disorders (including nephrotic syndrome). Also prescribed to manage high blood pressure (hypertension).",
        "alternate_names": ["furosemide", "Furoscix", "Diaqua-2", "Lo-Aqua"],
        "mechanism_of_action": "Blocks the reabsorption of sodium and chloride in the thick ascending limb of the loop of Henle in the kidney, leading to increased urine output and removal of excess fluid and salt from the body."
      },
      {
        "name": "Levalbuterol",
        "description": "Used to prevent and relieve wheezing, shortness of breath, coughing, and chest tightness in conditions such as asthma and chronic obstructive pulmonary disease (COPD). Acts as a quick-relief (rescue) medication for acute bronchospasm and is suitable for both adults and children.",
        "alternate_names": ["Xopenex", "Xopenex HFA"],
        "mechanism_of_action": "Relaxes airway smooth muscle by selectively stimulating beta-2 adrenergic receptors, increasing cyclic AMP and leading to bronchodilation. This opens the airways quickly, making it easier to breathe during asthma attacks or episodes of bronchospasm."
      },
      {
        "name": "Levaquin",
        "description": "Treats a wide range of serious bacterial infections, including pneumonia (community-acquired and hospital-acquired), skin and soft tissue infections, urinary tract infections (including acute pyelonephritis), chronic bacterial prostatitis, acute bacterial sinusitis, and acute bacterial exacerbation of chronic bronchitis. Also used to prevent or treat inhalational anthrax and plague, and for certain off-label uses such as endocarditis, some sexually transmitted diseases, and traveler's diarrhea.",
        "alternate_names": ["levofloxacin", "Quixin", "Iquix"],
        "mechanism_of_action": "Inhibits bacterial DNA gyrase and topoisomerase IV, enzymes essential for DNA replication, transcription, repair, and recombination, leading to bacterial cell death."
      },
      {
        "name": "Levodopa",
        "description": "Treats Parkinson’s disease and related movement disorders (such as parkinsonism from other causes and dopamine-responsive dystonia) by improving motor symptoms like rigidity, bradykinesia (slowness), and tremor. Also used for parkinsonism caused by encephalitis or toxins (e.g., carbon monoxide, manganese).",
        "alternate_names": ["Sinemet", "Rytary", "Parcopa", "Madopar", "Prolopa"],
        "mechanism_of_action": "Crosses the blood-brain barrier and is converted to dopamine in the brain, supplementing low dopamine levels and stimulating dopamine receptors to improve movement. Usually given with a peripheral dopa decarboxylase inhibitor (such as carbidopa or benserazide) to prevent conversion to dopamine outside the brain, which enhances effectiveness and reduces side effects."
      },
      {
        "name": "Levothyroxine",
        "description": "Used to treat hypothyroidism (an underactive thyroid), where the thyroid gland does not produce enough thyroid hormone. Also prescribed to help decrease the size of enlarged thyroid glands (goiter), and as part of treatment for certain types of thyroid cancer, usually in combination with surgery and radioactive iodine therapy.",
        "alternate_names": ["Synthroid", "Levoxyl", "Euthyrox", "Tirosint", "Unithroid", "Levo-T", "Ermeza", "Thyquidity"],
        "mechanism_of_action": "Provides a synthetic form of thyroxine (T4), the main hormone produced by the thyroid gland. In the body, T4 is converted to the active hormone triiodothyronine (T3), which enters cell nuclei and regulates gene expression to control metabolism, growth, and development. Levothyroxine restores normal thyroid hormone levels, reversing symptoms of hypothyroidism."
      },
      {
        "name": "Lexapro",
        "description": "Used to treat major depressive disorder and generalized anxiety disorder in adults and children (depression in those 12 years and older, anxiety in those 7 years and older). Also sometimes prescribed off-label for other anxiety-related conditions as determined by a healthcare provider.",
        "alternate_names": ["escitalopram", "Cipralex"],
        "mechanism_of_action": "Increases serotonin levels in the brain by selectively blocking its reuptake into nerve cells, which helps regulate mood and reduce symptoms of depression and anxiety."
      },
      {
        "name": "Lidocaine",
        "description": "Used to provide local anesthesia (numbing) for minor surgical or dental procedures, to relieve pain from conditions like minor burns, scrapes, insect bites, and nerve pain (such as postherpetic neuralgia), and to treat certain abnormal heart rhythms (ventricular arrhythmias). Also used as a topical pain reliever for targeted pain relief in muscles and joints, and for procedures involving mucous membranes.",
        "alternate_names": ["lignocaine", "Xylocaine", "Anecream", "Solarcaine", "ELA-Max", "Versatis", "ZTLido", "Dentipatch"],
        "mechanism_of_action": "Blocks voltage-gated sodium channels in nerve cell membranes, preventing the initiation and conduction of nerve impulses. This numbs the area by stopping nerves from sending pain signals to the brain. When used intravenously for heart rhythm problems, it slows electrical conduction in the heart by the same sodium channel blockade, helping to control abnormal heartbeats."
      },
      {
        "name": "Lipitor",
        "description": "Used to lower high cholesterol and triglyceride levels in the blood, reduce the risk of heart attack and stroke, and decrease the need for heart surgery in people with or at risk for heart disease. Also prescribed to treat inherited forms of high cholesterol (such as familial hypercholesterolemia) in adults and children, typically alongside diet and lifestyle changes.",
        "alternate_names": ["atorvastatin", "Sortis", "Torvast"],
        "mechanism_of_action": "Blocks the enzyme HMG-CoA reductase in the liver, reducing cholesterol production. This lowers LDL ('bad') cholesterol and triglycerides, raises HDL ('good') cholesterol, and helps prevent cholesterol buildup in blood vessels."
      },
      {
        "name": "Lisdexamfetamine",
        "description": "Lisdexamfetamine is a prescription central nervous system (CNS) stimulant used primarily to treat attention deficit hyperactivity disorder (ADHD) in adults and children aged 6 years and older, as well as moderate to severe binge eating disorder (BED) in adults. It is usually part of a broader treatment plan that may also include behavioral, educational, and psychological interventions.",
        "alternate_names": [ "Vyvanse", "Elvanse", "Aduvanz"],
        "mechanism_of_action": "Converted in the body to dextroamphetamine, which increases dopamine and norepinephrine levels in the brain to improve attention, impulse control, and reduce binge eating."
      },
      {
        "name": "Lisinopril",
        "description": "Used to treat high blood pressure (hypertension) in adults and children 6 years and older, heart failure, and to improve survival after a heart attack. Also helps protect kidney function in certain patients with diabetes and kidney disease.",
        "alternate_names": ["Prinivil", "Zestril", "Qbrelis"],
        "mechanism_of_action": "Blocks the angiotensin-converting enzyme (ACE), reducing production of angiotensin II, which relaxes and widens blood vessels, lowers blood pressure, and reduces the heart’s workload."
      },
      {
        "name": "Lithium",
        "description": "Used to treat bipolar disorder by stabilizing mood and preventing episodes of mania and depression. Also prescribed for mania, hypomania, certain types of depression, schizoaffective disorder, and sometimes for cluster headaches and other psychiatric conditions when other treatments are not effective.",
        "alternate_names": ["Lithobid", "Eskalith", "Lithotabs"],
        "mechanism_of_action": "Inhibits the enzyme glycogen synthase kinase-3 (GSK-3), modulates neurotransmitter signaling, and promotes neuroprotection and mood stabilization by affecting multiple pathways in the brain, including inositol metabolism and anti-apoptotic effects."
      },
      {
        "name": "Lofexidine",
        "description": "Used to manage symptoms of opioid withdrawal, such as muscle aches, stomach cramps, anxiety, chills, and insomnia, when stopping opioid medications. It is typically prescribed for short-term use during detoxification and does not treat opioid addiction itself.",
        "alternate_names": ["Lucemyra", "BritLofex"],
        "mechanism_of_action": "Acts as an alpha-2 adrenergic receptor agonist, reducing the release of norepinephrine in the brain and nervous system, which helps lessen the intensity of withdrawal symptoms."
      },
      {
        "name": "Loperamide",
        "description": "Used to control and relieve symptoms of acute and chronic diarrhea, including diarrhea caused by inflammatory bowel disease, and to reduce stool output in people with ileostomies.",
        "alternate_names": ["Imodium", "Diamode", "Maalox Anti-Diarrheal"],
        "mechanism_of_action": "Acts on mu-opioid receptors in the gut to slow intestinal movement, increasing the time stool remains in the intestine, which allows more water to be absorbed and results in firmer stools and fewer bowel movements."
      },
      {
        "name": "Lopressor",
        "description": "Used to treat high blood pressure (hypertension), stable angina (chest pain), and to reduce the risk of death after a heart attack. Also helps decrease the workload on the heart and may be used in other heart-related conditions.",
        "alternate_names": ["metoprolol", "Toprol-XL", "Kapspargo Sprinkle"],
        "mechanism_of_action": "Selectively blocks beta-1 adrenergic receptors in the heart, slowing heart rate, reducing heart contraction force, and lowering blood pressure by decreasing the effects of adrenaline and stress hormones on the heart."
      },
      {
        "name": "Losartan",
        "description": "Used to treat high blood pressure (hypertension), lower the risk of stroke in people with high blood pressure and left ventricular hypertrophy, and protect the kidneys in people with type 2 diabetes and kidney disease. It may also be used alone or with other medications for these purposes.",
        "alternate_names": ["Cozaar", "Arbli", "Lortaan"],
        "mechanism_of_action": "Blocks angiotensin II type 1 receptors, preventing angiotensin II from tightening blood vessels and signaling the release of aldosterone. This relaxes blood vessels, lowers blood pressure, and reduces strain on the heart and kidneys."
      },
      {
        "name": "Lovastatin",
        "description": "Used to lower high cholesterol and triglyceride levels in the blood, reduce the risk of heart attack, stroke, and the need for heart surgery in people with or at risk for heart disease. Also prescribed to treat inherited forms of high cholesterol in adults and children ages 10 and older.",
        "alternate_names": ["Mevacor", "Altoprev", "Altocor"],
        "mechanism_of_action": "Blocks the HMG-CoA reductase enzyme in the liver, reducing cholesterol production and lowering LDL (“bad”) cholesterol, which helps prevent cholesterol buildup in arteries."
      },
      {
        "name": "Lovenox",
        "description": "Used to prevent and treat blood clots, including deep vein thrombosis (DVT) and pulmonary embolism (PE), especially after certain surgeries or in patients with limited mobility. Also used to reduce the risk of complications from unstable angina and certain types of heart attacks (such as ST-segment elevation myocardial infarction, STEMI).",
        "alternate_names": ["enoxaparin", "Clexane", "Clexane Forte"],
        "mechanism_of_action": "Enhances the activity of antithrombin III to inactivate clotting factor Xa (and to a lesser extent, factor IIa), preventing the formation and growth of blood clots."
      },
      {
        "name": "Lyrica",
        "description": "Used to treat nerve pain from conditions like diabetic neuropathy, shingles (postherpetic neuralgia), and spinal cord injury; fibromyalgia; and as an add-on therapy for partial-onset seizures in epilepsy.",
        "alternate_names": ["pregabalin", "Algerika", "Alivax"],
        "mechanism_of_action": "Binds to the α2-δ subunit of voltage-gated calcium channels in the nervous system, reducing calcium influx and decreasing the release of excitatory neurotransmitters to calm overactive nerves and relieve pain or prevent seizures."
      },
      {
        "name": "Macrobid",
        "description": "Used to treat acute uncomplicated urinary tract infections (UTIs), particularly cystitis, caused by susceptible bacteria such as Escherichia coli and Staphylococcus saprophyticus. Not indicated for kidney infections (pyelonephritis) or complicated urinary tract infections.",
        "alternate_names": ["nitrofurantoin", "Macrodantin", "Furadantin"],
        "mechanism_of_action": "Converted by bacterial enzymes into reactive intermediates that damage bacterial DNA, RNA, protein, and cell wall synthesis, inhibiting essential cellular processes and killing bacteria in the urine."
      },
      {
        "name": "Magnesium",
        "description": "Used to treat and prevent low magnesium levels (hypomagnesemia), relieve constipation, act as an antacid for heartburn and indigestion, manage seizures in eclampsia and pre-eclampsia, and treat certain types of irregular heartbeat (arrhythmias). Also supports bone health, blood pressure regulation, blood sugar control, and may be used as part of bowel preparation for medical procedures.",
        "alternate_names": ["magnesium oxide", "magnesium sulfate", "milk of magnesia"],
        "mechanism_of_action": "Acts as a cofactor for over 300 enzymes, supporting energy production, nerve transmission, muscle contraction, and heart rhythm by regulating ion transport and stabilizing cell membranes."
      },
      {
        "name": "Meclizine",
        "description": "Used to prevent and treat nausea, vomiting, and dizziness caused by motion sickness, as well as to manage vertigo associated with inner ear disorders such as Meniere’s disease.",
        "alternate_names": ["Antivert", "Bonine", "Dramamine"],
        "mechanism_of_action": "Blocks histamine H1 receptors and has anticholinergic effects in the brain, reducing activity in the vomiting center and vestibular system to relieve motion sickness and vertigo symptoms."
      },
      {
        "name": "Medrol",
        "description": "Used to treat a wide range of inflammatory and autoimmune conditions, including arthritis, lupus, psoriasis, ulcerative colitis, severe allergies, certain blood, eye, skin, lung, and endocrine disorders, and as part of cancer therapy. Also prescribed for hormone disorders like adrenal insufficiency and to manage acute flare-ups of chronic diseases.",
        "alternate_names": ["methylprednisolone", "Solu-Medrol", "Depo-Medrol"],
        "mechanism_of_action": "Reduces inflammation and suppresses immune responses by binding to glucocorticoid receptors, altering gene expression, and decreasing the production of inflammatory chemicals in the body."
      },
      {
        "name": "Meloxicam",
        "description": " Used to relieve pain and inflammation caused by osteoarthritis, rheumatoid arthritis, and juvenile idiopathic arthritis in adults and children.",
        "alternate_names": ["Mobic", "Vivlodex", "Anjeso"],
        "mechanism_of_action": "Preferentially blocks the cyclooxygenase-2 (COX-2) enzyme, reducing the production of prostaglandins that cause pain and inflammation, while having less effect on COX-1 at lower doses."
      },
      {
        "name": "Meropenem",
        "description": "Used to treat serious bacterial infections, including complicated intra-abdominal infections, complicated skin and skin structure infections, bacterial meningitis (especially in children), hospital-acquired and community-acquired pneumonia, septicemia, febrile neutropenia, complicated urinary tract infections, and infections caused by multidrug-resistant bacteria. Often reserved for severe or hospital-acquired infections when other antibiotics may not be effective.",
        "alternate_names": ["Merrem", "Meronem", "Vabomere"],
        "mechanism_of_action": "Penetrates bacterial cells and binds to penicillin-binding proteins, inhibiting cell wall synthesis and leading to bacterial cell death. It is resistant to most beta-lactamases, making it effective against a broad range of Gram-positive and Gram-negative bacteria."
      },
      {
        "name": "Methadone",
        "description": "Used to treat opioid use disorder by reducing withdrawal symptoms and cravings, and as a long-term maintenance therapy to help people stop or avoid illicit opioid use. Also prescribed for severe, chronic pain when other pain treatments are inadequate.",
        "alternate_names": ["Methadose", "Dolophine", "Diskets"],
        "mechanism_of_action": "Acts as a full agonist at mu-opioid receptors to relieve withdrawal and block the effects of other opioids, and also blocks NMDA receptors, which helps reduce pain and opioid tolerance."
      },
      {
        "name": "Methocarbamol",
        "description": "Used to relieve discomfort from acute, painful musculoskeletal conditions such as muscle spasms, strains, and sprains. Often used short-term as an adjunct to rest, physical therapy, and pain relievers.",
        "alternate_names": ["Robaxin", "Carbacot", "Skelex"],
        "mechanism_of_action": "Acts as a centrally acting muscle relaxant, likely by depressing nerve activity in the spinal cord and brain, which helps reduce muscle spasms without directly affecting muscle fibers."
      },
      {
        "name": "Methotrexate",
        "description": "Used to treat rheumatoid arthritis, psoriatic arthritis, juvenile idiopathic arthritis, and other autoimmune or inflammatory conditions (such as lupus, vasculitis, and severe psoriasis). Also prescribed at higher doses for certain cancers, including leukemia, lymphoma, and some solid tumors. It helps reduce inflammation, control immune system overactivity, and slow disease progression in autoimmune diseases.",
        "alternate_names": ["Trexall", "Otrexup", "Rasuvo"],
        "mechanism_of_action": "Blocks enzymes involved in folate metabolism-primarily dihydrofolate reductase-to inhibit DNA synthesis in rapidly dividing cells (important for cancer treatment). In autoimmune and inflammatory diseases, it increases adenosine levels and modulates immune cell activity, leading to reduced inflammation and immune response."
      },
      {
        "name": "Midazolam",
        "description": "Used to produce sedation, relieve anxiety, and cause drowsiness before and during surgical or diagnostic procedures; also used for anesthesia induction, procedural sedation, and the acute treatment of seizures, especially status epilepticus. Sometimes given for severe agitation or as a premedication before anesthesia in adults and children.",
        "alternate_names": ["Versed", "Nayzilam", "Seizalam"],
        "mechanism_of_action": "Enhances the effect of the neurotransmitter GABA at GABA-A receptors in the brain, increasing chloride channel opening and causing neuronal inhibition, which leads to sedation, anxiolysis, amnesia, muscle relaxation, and anticonvulsant effects."
      },
      {
        "name": "Midodrine",
        "description": "Used to treat low blood pressure that causes symptoms, particularly orthostatic hypotension (a sudden drop in blood pressure when standing), to help prevent dizziness, lightheadedness, or fainting that interferes with daily activities.",
        "alternate_names": ["ProAmatine", "Orvaten", "Amatine"],
        "mechanism_of_action": "Converted in the body to its active form, desglymidodrine, which selectively stimulates alpha-1 adrenergic receptors on blood vessels, causing them to constrict and thereby increasing blood pressure."
      },
      {
        "name": "MiraLAX",
        "description": "Used to relieve occasional constipation by softening stool and making it easier to pass. It is available over-the-counter and typically produces a bowel movement within 1 to 3 days. Not intended for long-term use without medical supervision.",
        "alternate_names": ["polyethylene glycol 3350", "GaviLAX", "GlycoLax"],
        "mechanism_of_action": "Works as an osmotic laxative by drawing water into the colon, which softens stool and increases stool frequency without causing harsh side effects like cramping or urgency."
      },
      {
        "name": "Mobic",
        "description": "Used to relieve pain, tenderness, swelling, and stiffness caused by osteoarthritis, rheumatoid arthritis, and juvenile rheumatoid arthritis in adults and children 2 years and older.",
        "alternate_names": ["meloxicam", "Vivlodex", "Anjeso"],
        "mechanism_of_action": "Preferentially blocks the COX-2 enzyme, reducing production of prostaglandins that cause pain and inflammation, while having less effect on COX-1 at lower doses."
      },
      {
        "name": "Mounjaro",
        "description": "Used to improve blood sugar control in adults with type 2 diabetes, in combination with diet and exercise. Also causes significant weight loss, though weight loss is considered an additional benefit rather than an official FDA-approved use for this brand.",
        "alternate_names": ["tirzepatide", "Zepbound"],
        "mechanism_of_action": "Activates both GLP-1 and GIP receptors, mimicking natural gut hormones to increase insulin release when blood sugar is high, reduce sugar production by the liver, slow digestion, and decrease appetite, resulting in improved blood sugar control and weight loss."
      },
      {
        "name": "Naloxone",
        "description": "Used to rapidly reverse opioid overdose and its life-threatening effects, such as respiratory depression, unconsciousness, and pinpoint pupils. Also included in some combination medications to deter opioid abuse and as an adjunct in opioid dependence treatment. Sometimes used off-label for other indications like clonidine overdose and opioid-induced constipation.",
        "alternate_names": ["Narcan", "Kloxxado", "Zimhi"],
        "mechanism_of_action": "Competitively blocks opioid receptors, especially the mu-opioid receptor, displacing opioids and reversing their effects on breathing and consciousness."
      },
      {
        "name": "Naltrexone",
        "description": "Used to treat opioid use disorder and alcohol use disorder by reducing cravings, blocking the euphoric and sedative effects of opioids and alcohol, and helping prevent relapse as part of a comprehensive treatment plan. Also available in combination with bupropion for weight management and sometimes used off-label for other conditions.",
        "alternate_names": ["Vivitrol", "Revia", "Depade"],
        "mechanism_of_action": "Blocks mu-opioid receptors in the brain, preventing opioids and alcohol from producing their usual rewarding effects, which reduces cravings and helps maintain abstinence."
      },
      {
        "name": "Naprosyn",
        "description": "Used to relieve pain, inflammation, and swelling in conditions such as osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, gout, juvenile arthritis, tendonitis, bursitis, menstrual cramps, muscle aches, back pain, headaches, dental pain, and to reduce fever.",
        "alternate_names": ["naproxen", "Aleve", "Anaprox"],
        "mechanism_of_action": "Blocks cyclooxygenase (COX-1 and COX-2) enzymes, reducing the production of prostaglandins that cause pain, inflammation, and fever."
      },
      {
        "name": "Nexplanon",
        "description": "Used to prevent pregnancy as a long-acting, reversible form of birth control. The small, flexible implant is inserted under the skin of the upper arm and provides contraception for up to 3 years (some sources note up to 5 years, but FDA labeling specifies 3 years).",
        "alternate_names": ["etonogestrel implant", "Implanon"],
        "mechanism_of_action": "Continuously releases etonogestrel, a progestin hormone, which primarily prevents ovulation. It also thickens cervical mucus to block sperm and thins the uterine lining to reduce the likelihood of implantation."
      },
      {
        "name": "Nicardipine",
        "description": "Used to treat high blood pressure (hypertension) and control angina (chest pain). It is also used in certain cases for the management of hypertensive emergencies, perioperative blood pressure control, and sometimes for cerebral vasospasm after subarachnoid hemorrhage.",
        "alternate_names": ["Cardene", "Cardene SR"],
        "mechanism_of_action": "Blocks calcium entry into heart and vascular smooth muscle cells, causing blood vessels to relax and widen. This lowers blood pressure, reduces the heart’s workload, and increases blood and oxygen supply to the heart."
      },
      {
        "name": "Nifedipine",
        "description": "Used to treat high blood pressure (hypertension) and to control chest pain (angina), including chronic stable angina and Prinzmetal’s (variant) angina. Also sometimes used for Raynaud’s phenomenon, certain types of premature labor, and other vascular conditions as determined by a healthcare provider.",
        "alternate_names": ["Adalat", "Procardia", "Afeditab CR"],
        "mechanism_of_action": "Blocks L-type calcium channels in the smooth muscle of blood vessels, relaxing and widening them. This lowers blood pressure and increases blood and oxygen supply to the heart, reducing its workload and relieving angina."
      },
      {
        "name": "Nitroglycerin",
        "description": "Used to treat and prevent angina (chest pain) caused by coronary artery disease, and also for acute heart failure, severe hypertension, anal fissures, and to manage coronary artery spasms. It is often administered as sublingual tablets or sprays for rapid relief of chest pain, and also comes in patches, ointments, and injectable forms for other indications.",
        "alternate_names": ["Gonitro", "Nitrostat", "Nitro-dur"],
        "mechanism_of_action": "Converted in the body to nitric oxide, which relaxes and widens blood vessels (vasodilation), primarily veins, reducing the heart’s workload and increasing blood and oxygen supply to the heart."
      },
      {
        "name": "Norco",
        "description": "Used to relieve moderate to severe pain when pain is not controlled by non-opioid medications. Also sometimes used to suppress cough, but primarily prescribed for pain management when other treatments are inadequate.",
        "alternate_names": ["hydrocodone-acetaminophen", "Lortab", "Vicodin"],
        "mechanism_of_action": "Hydrocodone binds to mu-opioid receptors in the brain and spinal cord, blocking pain signals and altering the perception of pain. Acetaminophen enhances pain relief by inhibiting pain signal transmission, likely through blocking prostaglandin synthesis in the brain."
      },
      {
        "name": "Norflex",
        "description": "Used to relieve pain and stiffness from acute, painful musculoskeletal conditions such as strains, sprains, muscle injuries, and muscle spasms. Typically prescribed short-term as an adjunct to rest and physical therapy.",
        "alternate_names": ["orphenadrine", "Norgesic", "Disipal"],
        "mechanism_of_action": "Acts in the central nervous system as a muscle relaxant with anticholinergic and mild analgesic properties, likely reducing muscle spasms and pain by blocking certain nerve signals and altering pain perception in the brain."
      },
      {
        "name": "NovoLog",
        "description": "Used to improve blood sugar control in adults and children with diabetes mellitus, including both type 1 and type 2 diabetes. Often administered before meals as a rapid-acting insulin and sometimes used in insulin pumps for continuous delivery.",
        "alternate_names": ["insulin aspart", "NovoLog FlexPen", "NovoLog PenFill"],
        "mechanism_of_action": "Acts as a rapid-acting insulin analog that binds to insulin receptors on muscle and fat cells, promoting cellular uptake of glucose and inhibiting glucose production by the liver. This quickly lowers blood sugar after injection due to its fast absorption and onset of action."
      },
      {
        "name": "Nystatin",
        "description": "Used to treat and prevent fungal infections caused by Candida species, including oral thrush (mouth), esophageal candidiasis, intestinal candidiasis, skin infections (such as diaper rash), and vaginal yeast infections. It is also sometimes used to prevent fungal infections in people at high risk, such as those with weakened immune systems.",
        "alternate_names": ["Mycostatin", "Nyaderm", "Nilstat"],
        "mechanism_of_action": "Binds to ergosterol in the fungal cell membrane, forming pores that disrupt membrane integrity and cause leakage of cellular contents, leading to fungal cell death."
      },
      {
        "name": "Ofloxacin",
        "description": "Used to treat a wide range of bacterial infections, including pneumonia, bronchitis, skin infections, urinary tract infections (UTIs), prostate infections, and certain sexually transmitted diseases such as gonorrhea and chlamydia. It is also used for infections of the bladder, reproductive organs, and sometimes for other infections like Legionnaires’ disease, bone and joint infections, and infectious diarrhea, depending on bacterial susceptibility.",
        "alternate_names": ["Floxin", "Tarivid", "Oflocet"],
        "mechanism_of_action": "Inhibits bacterial DNA gyrase and topoisomerase IV, enzymes needed for DNA replication and repair, which stops bacterial growth and leads to cell death."
      },
      {
        "name": "Olanzapine",
        "description": "Used to treat schizophrenia and bipolar I disorder, including manic or mixed episodes, as well as maintenance therapy. Also prescribed in combination with fluoxetine for depressive episodes of bipolar I disorder and for treatment-resistant depression. Sometimes used off-label for agitation, chemotherapy-induced nausea and vomiting, and other psychiatric or mood disorders.",
        "alternate_names": ["Zyprexa", "Zyprexa Zydis", "Zyprexa Relprevv"],
        "mechanism_of_action": "Blocks multiple neurotransmitter receptors in the brain, especially dopamine D2 and serotonin 5HT2A receptors, reducing abnormal brain activity to improve mood, thinking, and behavior."
      },
      {
        "name": "Omeprazole",
        "description": "Used to treat and prevent conditions caused by excess stomach acid, including gastroesophageal reflux disease (GERD), heartburn, erosive esophagitis, stomach and duodenal ulcers, and conditions with excessive acid production such as Zollinger-Ellison syndrome. Also used in combination therapy to eradicate Helicobacter pylori infections and reduce the risk of upper gastrointestinal bleeding in critically ill patients.",
        "alternate_names": ["Prilosec", "Prilosec OTC", "Losec"],
        "mechanism_of_action": "Blocks the stomach’s proton pumps (H+/K+ ATPase enzymes) in parietal cells, which are responsible for the final step in gastric acid production, thereby significantly reducing stomach acid secretion."
      },
      {
        "name": "Opdivo",
        "description": "Used to treat a variety of cancers, including melanoma, non-small cell lung cancer (NSCLC), malignant pleural mesothelioma, renal cell carcinoma, classical Hodgkin lymphoma, head and neck squamous cell carcinoma, urothelial carcinoma, colorectal cancer, hepatocellular carcinoma, esophageal cancer, gastric cancer, gastroesophageal junction cancer, and esophageal adenocarcinoma. It is often used in advanced, metastatic, or previously treated cancers and may be combined with other cancer therapies.",
        "alternate_names": ["nivolumab", "Opdivo Qvantig", "ONO-4538"],
        "mechanism_of_action": "A monoclonal antibody that binds to the PD-1 receptor on T cells, blocking cancer cells from turning off the immune response. This enhances the body’s immune system to recognize and destroy cancer cells by preventing PD-L1 and PD-L2 proteins on tumor cells from deactivating T cells."
      },
      {
        "name": "Oxcarbazepine",
        "description": "Used to treat partial (focal) seizures in adults and children, either alone or in combination with other medications. It is sometimes used off-label for conditions like bipolar disorder, neuropathic pain, and trigeminal neuralgia, particularly when other treatments have not worked.",
        "alternate_names": ["Trileptal", "Oxtellar XR", "Oxtellar"],
        "mechanism_of_action": "Blocks voltage-gated sodium channels in the brain, stabilizing overexcited nerve membranes and reducing abnormal electrical activity to help prevent seizures. Its main effect comes from its active metabolite, licarbazepine."
      },
      {
        "name": "Oxycodone",
        "description": "Used to relieve moderate to severe pain that cannot be managed with non-opioid medications. Immediate-release forms are prescribed for acute pain, while extended-release forms are used for chronic, severe pain requiring continuous, around-the-clock opioid therapy. Oxycodone is also available in combination with acetaminophen or aspirin for pain management.",
        "alternate_names": ["OxyContin", "Roxicodone", "Oxaydo"],
        "mechanism_of_action": "Binds to mu-opioid receptors (and to a lesser extent kappa and delta receptors) in the brain and spinal cord, blocking pain signals and altering pain perception by inhibiting neurotransmitter release and reducing neuronal excitability."
      },
      {
        "name": "Ozempic",
        "description": "Used to improve blood sugar control in adults with type 2 diabetes, reduce the risk of major cardiovascular events (such as heart attack and stroke) in those with type 2 diabetes and established heart disease, and slow the progression of kidney disease in patients with type 2 diabetes and chronic kidney disease. It is not used for type 1 diabetes or as a weight loss drug, though weight loss is a common benefit.",
        "alternate_names": ["semaglutide", "Wegovy", "Rybelsus"],
        "mechanism_of_action": "Mimics the natural hormone GLP-1 by binding to GLP-1 receptors, which increases insulin release when blood sugar is high, decreases glucose production by the liver, slows stomach emptying, and reduces appetite, resulting in improved blood sugar control and potential weight loss."
      },
      {
        "name": "Pantoprazole",
        "description": "Used to treat conditions caused by excess stomach acid, including gastroesophageal reflux disease (GERD) with erosive esophagitis, maintenance of healing of erosive esophagitis, Zollinger-Ellison syndrome, and stomach ulcers. It helps heal and prevent damage to the esophagus from acid reflux and is also used for pathological hypersecretory conditions in adults and children 5 years and older.",
        "alternate_names": ["Protonix", "Pantoloc", "Somac"],
        "mechanism_of_action": "Blocks the stomach’s proton pumps (H+/K+ ATPase enzymes) in parietal cells, irreversibly inhibiting the final step of gastric acid production and significantly reducing stomach acid secretion."
      },
      {
        "name": "Paroxetine",
        "description": "Used to treat depression, generalized anxiety disorder, social anxiety disorder, panic disorder, obsessive-compulsive disorder (OCD), posttraumatic stress disorder (PTSD), and premenstrual dysphoric disorder (PMDD). Also prescribed for hot flashes related to menopause and sometimes for other conditions such as chronic headaches or certain types of nerve pain.",
        "alternate_names": ["Paxil", "Pexeva", "Brisdelle"],
        "mechanism_of_action": "Selectively blocks the reuptake of serotonin in the brain, increasing serotonin levels and helping to improve mood, reduce anxiety, and relieve other symptoms of the treated conditions."
      },
      {
        "name": "Paxlovid",
        "description": "Used to treat mild to moderate COVID-19 in adults (and some adolescents) who are at high risk for progressing to severe disease, hospitalization, or death. Treatment must begin within five days of symptom onset.",
        "alternate_names": ["nirmatrelvir-ritonavir", "nirmatrelvir and ritonavir"],
        "mechanism_of_action": "Combines nirmatrelvir, which blocks a key viral enzyme needed for SARS-CoV-2 to replicate, with ritonavir, which slows the breakdown of nirmatrelvir in the body so it remains effective longer."
      },
      {
        "name": "Phenergan",
        "description": "Used to treat allergy symptoms such as itching, runny nose, sneezing, watery eyes, hives, and skin rashes; also used to prevent and treat nausea and vomiting (including motion sickness), provide sedation before or after surgery, and relieve short-term insomnia or anxiety related to procedures.",
        "alternate_names": ["promethazine", "Promethegan", "Phenadoz"],
        "mechanism_of_action": "Blocks histamine H1 receptors to reduce allergic symptoms and also acts on muscarinic and dopamine receptors in the brain to prevent nausea, vomiting, and induce sedation."
      },
      {
        "name": "Phenobarbital",
        "description": "Used to control and prevent various types of seizures (except absence seizures), manage status epilepticus, and provide sedation for anxiety, insomnia, and preoperative procedures. Also used in alcohol and benzodiazepine withdrawal, and sometimes for certain metabolic disorders or as a sedative in intensive care.",
        "alternate_names": ["Luminal", "Sezaby", "Solfoton"],
        "mechanism_of_action": "Enhances GABA-A receptor activity to increase chloride ion flow into neurons, causing hyperpolarization and decreased neuronal excitability; also inhibits excitatory neurotransmission by blocking glutamate receptors."
      },
      {
        "name": "Plaquenil",
        "description": "Used to treat and prevent malaria, as well as to manage autoimmune conditions such as rheumatoid arthritis, systemic lupus erythematosus (SLE), discoid lupus, and sometimes Sjögren’s syndrome. It helps reduce inflammation, pain, and swelling in these conditions and is a standard therapy for lupus.",
        "alternate_names": ["hydroxychloroquine", "Quineprox", "Hydroquin"],
        "mechanism_of_action": "Suppresses activation of Toll-like receptors in immune cells, reducing the production of inflammatory signals and modulating the immune response; also interferes with parasite growth in red blood cells when used for malaria."
      },
      {
        "name": "Pravastatin",
        "description": "Used to lower high cholesterol and triglyceride levels, reduce the risk of heart attack, stroke, and other cardiovascular events in people with or at risk for heart disease, and slow the progression of atherosclerosis. Also prescribed for familial hypercholesterolemia and as adjunct therapy with diet and exercise.",
        "alternate_names": ["Pravachol", "pravastatin sodium"],
        "mechanism_of_action": "Blocks HMG-CoA reductase, the key enzyme in cholesterol production, leading to decreased cholesterol synthesis, increased LDL clearance from the blood, lower LDL and triglycerides, and higher HDL cholesterol."
      },
      {
        "name": "Prazosin",
        "description": "Used to treat high blood pressure (hypertension), symptoms of benign prostatic hyperplasia (BPH), and to manage nightmares and sleep disturbances associated with post-traumatic stress disorder (PTSD). Also prescribed for congestive heart failure, Raynaud’s disease, and pheochromocytoma.",
        "alternate_names": ["Minipress", "prazosin hydrochloride"],
        "mechanism_of_action": "Blocks alpha-1 adrenergic receptors on blood vessels, causing them to relax and widen, which lowers blood pressure and improves blood flow."
      },
      {
        "name": "Prednisolone",
        "description": "Used to treat a wide range of conditions including allergies, asthma, inflammatory and autoimmune diseases (such as rheumatoid arthritis and lupus), skin disorders, blood disorders, certain cancers, inflammatory bowel disease, and to prevent organ rejection after transplant. It works by reducing inflammation and calming overactive immune responses.",
        "alternate_names": ["Orapred", "Prelone", "Pediapred"],
        "mechanism_of_action": "Binds to glucocorticoid receptors to suppress immune system activity and decrease inflammation by altering gene expression and reducing the production of inflammatory chemicals."
      },
      {
        "name": "Prednisone",
        "description": "Used to treat a wide range of inflammatory and autoimmune conditions such as asthma, allergic reactions, arthritis, inflammatory bowel disease, lupus, multiple sclerosis, certain cancers, and to prevent organ rejection after transplant. Also used to replace low levels of corticosteroids in adrenal insufficiency.",
        "alternate_names": ["Deltasone", "Rayos", "Sterapred"],
        "mechanism_of_action": "Converted in the liver to prednisolone, which binds to glucocorticoid receptors, suppresses immune system activity, and reduces inflammation by altering gene expression and decreasing the production of inflammatory chemicals."
      },
      {
        "name": "Propranolol",
        "description": "Used to treat high blood pressure, angina (chest pain), irregular heart rhythms (such as atrial fibrillation), prevention of migraine headaches, essential tremor, hypertrophic subaortic stenosis, symptoms of anxiety (including performance anxiety), and to reduce risk after a heart attack. Also used for certain types of infantile hemangioma and as adjunct therapy in conditions like thyrotoxicosis and pheochromocytoma.",
        "alternate_names": ["Inderal", "Inderal LA", "InnoPran XL"],
        "mechanism_of_action": "Blocks both beta-1 and beta-2 adrenergic receptors throughout the body, reducing heart rate, blood pressure, and the heart’s workload by inhibiting the effects of adrenaline and noradrenaline on the heart and blood vessels."
      },
      {
        "name": "Provigil",
        "description": "Used to improve wakefulness in people with excessive daytime sleepiness caused by narcolepsy, obstructive sleep apnea (OSA), or shift work sleep disorder. It does not treat the underlying cause of these conditions but helps reduce symptoms of sleepiness.",
        "alternate_names": ["modafinil", "Alertec", "Modavigil"],
        "mechanism_of_action": "Promotes wakefulness by affecting brain chemicals involved in sleep-wake regulation; the exact mechanism is unclear but is thought to increase dopamine and mimic certain stimulant effects without the same structure as amphetamines."
      },
      {
        "name": "Reglan",
        "description": "Used to treat heartburn caused by gastroesophageal reflux disease (GERD) in people who have not responded to other treatments, and to relieve symptoms of diabetic gastroparesis (slow stomach emptying), such as nausea, vomiting, and feeling full after meals. Also used short-term to prevent nausea and vomiting from chemotherapy, surgery, or certain medical procedures.",
        "alternate_names": ["metoclopramide", "Gimoti"],
        "mechanism_of_action": "Increases muscle contractions in the upper digestive tract to speed stomach emptying and intestinal transit; also blocks dopamine receptors in the brain to help prevent nausea and vomiting."
      },
      {
        "name": "Remeron",
        "description": "Used to treat major depressive disorder (MDD) in adults. Also prescribed off-label for insomnia, to stimulate appetite, and to manage certain anxiety disorders.",
        "alternate_names": ["mirtazapine", "Remeron SolTab"],
        "mechanism_of_action": "Blocks central presynaptic α2-adrenergic receptors to increase norepinephrine and serotonin release, and antagonizes certain serotonin (5-HT2, 5-HT3) and histamine (H1) receptors, resulting in antidepressant, anxiolytic, and sedating effects."
      },
      {
        "name": "Remicade",
        "description": "Used to treat autoimmune and inflammatory conditions such as Crohn’s disease, ulcerative colitis, rheumatoid arthritis, ankylosing spondylitis, psoriatic arthritis, and plaque psoriasis. It helps reduce symptoms, induce and maintain remission, and improve quality of life for people with these chronic diseases.",
        "alternate_names": ["infliximab", "Inflectra", "Renflexis"],
        "mechanism_of_action": "Binds to and neutralizes tumor necrosis factor-alpha (TNF-α), a key inflammatory protein, thereby blocking the inflammatory cascade that drives autoimmune disease symptoms and tissue damage."
      },
      {
        "name": "Restoril",
        "description": "Used to treat short-term insomnia by helping people fall asleep faster, stay asleep longer, and reduce nighttime awakenings. It is typically prescribed for up to 7–10 days and may also be used off-label for anxiety or related sleep disturbances.",
        "alternate_names": ["temazepam", "Restoril", "Normison"],
        "mechanism_of_action": "Enhances the effect of the neurotransmitter GABA in the brain, slowing down nervous system activity to induce drowsiness and promote sleep."
      },
      {
        "name": "Risperdal",
        "description": "Used to treat schizophrenia, bipolar disorder (including manic and mixed episodes), and irritability or behavioral problems associated with autism in children and adolescents. Also sometimes prescribed off-label for severe behavioral disturbances, aggression, and as an adjunct in treatment-resistant depression or obsessive-compulsive disorder.",
        "alternate_names": ["risperidone", "Risperdal Consta", "Perseris"],
        "mechanism_of_action": "Blocks dopamine D2 and serotonin 5-HT2 receptors in the brain, balancing neurotransmitter activity to reduce psychotic symptoms, stabilize mood, and decrease aggression or irritability."
      },
      {
        "name": "Ritalin",
        "description": "Used to treat attention-deficit hyperactivity disorder (ADHD), attention deficit disorder (ADD), and narcolepsy by improving attention, focus, and impulse control. Sometimes used off-label for certain cases of depression, fatigue, or cognitive symptoms in other conditions.",
        "alternate_names": ["methylphenidate", "Concerta", "Metadate", "Methylin", "Daytrana", "Quillivant XR", "Aptensio XR"],
        "mechanism_of_action": "Blocks the reuptake of dopamine and norepinephrine in the brain, increasing their levels in the synaptic cleft, which enhances attention, alertness, and impulse control."
      },
      {
        "name": "Robaxin",
        "description": "Used to relieve discomfort from acute, painful musculoskeletal conditions such as muscle spasms, strains, or injuries, typically as an adjunct to rest and physical therapy. The injectable form is also used to manage muscle spasms caused by tetanus.",
        "alternate_names": ["methocarbamol", "Carbacot", "Skelex"],
        "mechanism_of_action": "Acts as a centrally acting muscle relaxant, likely by depressing nerve activity in the spinal cord and brain, which reduces muscle spasms and pain without directly affecting muscle fibers."
      },
      {
        "name": "Rosuvastatin",
        "description": "Used to lower high cholesterol and triglyceride levels, slow the buildup of fatty deposits in blood vessels, and reduce the risk of heart attack, stroke, and other cardiovascular events. Also prescribed for familial hypercholesterolemia and to prevent cardiovascular disease in people at risk.",
        "alternate_names": ["Crestor", "Ezallor", "Roszet"],
        "mechanism_of_action": "Blocks HMG-CoA reductase, the key liver enzyme needed to make cholesterol, which lowers LDL (“bad”) cholesterol, raises HDL (“good”) cholesterol, and reduces triglycerides in the blood."
      },
      {
        "name": "Sabril",
        "description": "Used to treat infantile spasms in children 1 month to 2 years old, and as add-on therapy for difficult-to-treat complex partial (focal) seizures in adults and children 2 years and older who have not responded adequately to several other seizure medications. It is typically reserved for cases where other treatments have failed due to the risk of serious side effects, including permanent vision loss.",
        "alternate_names": ["vigabatrin", "Vigadrone", "Vigpoder"],
        "mechanism_of_action": "Irreversibly blocks the enzyme GABA transaminase, leading to increased levels of the inhibitory neurotransmitter GABA in the brain, which helps stabilize electrical activity and control seizures."
      },
      {
        "name": "Senna",
        "description": "Used for short-term relief of constipation and to empty the bowels before surgery or medical procedures such as colonoscopy. It is FDA-approved as an over-the-counter (OTC) stimulant laxative for adults and children ages 2 years and older. Other uses, such as for irritable bowel syndrome, hemorrhoids, or weight loss, are not well supported by evidence and are not FDA-approved.",
        "alternate_names": ["sennosides", "Senokot", "Ex-Lax"],
        "mechanism_of_action": "Stimulates the lining of the bowel to increase intestinal movement and fluid secretion, causing a laxative effect that results in a bowel movement, typically within 6–12 hours after oral use."
      },
      {
        "name": "Seroquel",
        "description": "Used to treat schizophrenia in adults and adolescents, bipolar disorder (including manic and depressive episodes), and as an add-on treatment for major depressive disorder in adults. Also prescribed off-label for anxiety, insomnia, and other mood disorders.",
        "alternate_names": ["quetiapine", "Seroquel XR", "Qutan"],
        "mechanism_of_action": "Blocks serotonin (5-HT2) and dopamine (D2) receptors in the brain, balancing neurotransmitter activity to reduce psychotic symptoms and stabilize mood; also affects histamine and adrenergic receptors, contributing to sedative and blood pressure-lowering effects."
      },
      {
        "name": "Sertraline",
        "description": "Used to treat major depressive disorder, obsessive-compulsive disorder (OCD), panic disorder, post-traumatic stress disorder (PTSD), social anxiety disorder, and premenstrual dysphoric disorder (PMDD). Also prescribed off-label for generalized anxiety disorder, premature ejaculation, and other conditions as determined by a healthcare provider.",
        "alternate_names": ["Zoloft", "sertraline hydrochloride"],
        "mechanism_of_action": "Increases serotonin levels in the brain by selectively blocking its reuptake into nerve cells, which helps improve mood, reduce anxiety, and relieve symptoms of depression and related disorders."
      },
      {
        "name": "Simvastatin",
        "description": "Used to lower high cholesterol and triglyceride levels, reduce the risk of heart attack, stroke, and other cardiovascular events, and slow the progression of atherosclerosis in adults and children as young as 10 with certain inherited cholesterol disorders. Also prescribed to decrease the risk of heart problems in people with risk factors for cardiovascular disease.",
        "alternate_names": ["Zocor", "Vytorin", "Simlup"],
        "mechanism_of_action": "Blocks HMG-CoA reductase, the key liver enzyme needed to make cholesterol, which lowers LDL (“bad”) cholesterol, raises HDL (“good”) cholesterol, and reduces triglycerides in the blood."
      },
      {
        "name": "Sinemet",
        "description": "Used to treat symptoms of Parkinson’s disease, such as muscle stiffness, tremors, spasms, and poor muscle control, as well as parkinsonism caused by encephalitis, carbon monoxide poisoning, or manganese toxicity.",
        "alternate_names": ["carbidopa-levodopa", "Atamet", "Parcopa"],
        "mechanism_of_action": "Combines levodopa, which is converted to dopamine in the brain to relieve symptoms, with carbidopa, which prevents levodopa’s breakdown outside the brain, allowing more levodopa to reach the brain and increasing its effectiveness."
      },
      {
        "name": "Singulair",
        "description": "Used to prevent and manage asthma symptoms, relieve seasonal and year-round allergy symptoms (allergic rhinitis), and prevent exercise-induced bronchoconstriction. It is prescribed for adults and children as young as 12 months for asthma, and for allergies in children as young as 6 months. Not for acute asthma attacks.",
        "alternate_names": [ "montelukast", "Montelukast Sodium"],
        "mechanism_of_action": "Blocks leukotriene receptors in the airways, preventing the action of leukotrienes-chemicals that cause airway inflammation, swelling, and tightening-thereby reducing asthma and allergy symptoms."
      },
      {
        "name": "Soliris",
        "description": "Used to treat rare autoimmune and blood disorders, including paroxysmal nocturnal hemoglobinuria (PNH), atypical hemolytic uremic syndrome (aHUS), generalized myasthenia gravis (gMG) in anti-acetylcholine receptor antibody-positive adults, and neuromyelitis optica spectrum disorder (NMOSD) in adults. Also approved for aHUS in children ages 2 months and older.",
        "alternate_names": ["eculizumab", "Bkemv", "Epysqli"],
        "mechanism_of_action": "Binds to complement protein C5 in the blood, blocking its activation and preventing the formation of the terminal complement complex. This reduces abnormal immune attacks on blood cells, blood vessels, nerves, and muscles in the targeted conditions."
      },
      {
        "name": "SoluMEDROL",
        "description": "Used to treat a wide range of inflammatory and autoimmune conditions, including arthritis, lupus, severe allergies, asthma, ulcerative colitis, psoriasis, adrenal insufficiency, blood and bone marrow disorders, skin and eye diseases, and flare-ups of multiple sclerosis. It is also used for severe allergic reactions, respiratory distress, and other conditions where rapid suppression of inflammation or immune response is needed.",
        "alternate_names": ["methylprednisolone", "Depo-Medrol", "A-Methapred"],
        "mechanism_of_action": "Suppresses the immune system and reduces inflammation by blocking the release of substances that cause swelling, redness, and allergic reactions."
      },
      {
        "name": "somatropin",
        "description": "Used to treat growth hormone deficiency in children and adults, promote growth in children with certain growth disorders (such as Turner syndrome, Prader-Willi syndrome, chronic kidney disease, Noonan syndrome, SHOX deficiency, and children born small for gestational age), manage short bowel syndrome in adults, and increase body weight and physical endurance in patients with HIV-associated wasting syndrome.",
        "alternate_names": ["Genotropin", "Humatrope", "Norditropin", "Nutropin", "Omnitrope", "Saizen", "Serostim", "Zorbtive"],
        "mechanism_of_action": "Acts as a synthetic human growth hormone that binds to growth hormone receptors, directly stimulating growth and metabolism, and indirectly increasing insulin-like growth factor-1 (IGF-1) production, which promotes bone and tissue growth and regulates metabolism."
      },
      {
        "name": "Sotalol",
        "description": "Used to treat and prevent certain serious, potentially life-threatening abnormal heart rhythms (arrhythmias), including ventricular tachycardia, atrial fibrillation, and atrial flutter. It helps maintain normal heart rhythm in people with a history of these conditions and is sometimes used off-label for other arrhythmias.",
        "alternate_names": ["Betapace", "Sorine", "Sotylize"],
        "mechanism_of_action": "Blocks beta-adrenergic receptors and potassium channels in the heart, slowing the heart rate and prolonging the heart’s electrical recovery period to prevent and correct abnormal heart rhythms."
      },
      {
        "name": "Spironolactone",
        "description": "Used to treat high blood pressure, heart failure, fluid retention (edema) due to heart, liver, or kidney disease, and primary hyperaldosteronism. Also used to prevent low potassium levels (hypokalemia) and sometimes prescribed off-label for conditions like acne, hirsutism, and certain hormone-related disorders.",
        "alternate_names": ["Aldactone", "Carospir", "Berlactone"],
        "mechanism_of_action": "Blocks aldosterone receptors in the kidneys, causing the body to excrete sodium and water while retaining potassium; also has antiandrogen effects by blocking androgen receptors."
      },
      {
        "name": "Suboxone",
        "description": "Used to treat opioid use disorder (OUD) by reducing cravings and withdrawal symptoms, supporting recovery, and lowering the risk of relapse. It is prescribed as part of a medication-assisted treatment (MAT) program, often alongside counseling and behavioral therapy, and is not intended for use as a pain medication.",
        "alternate_names": ["buprenorphine/naloxone", "Zubsolv", "Bunavail"],
        "mechanism_of_action": "Combines buprenorphine, a partial opioid agonist that partially activates opioid receptors to relieve withdrawal and cravings without producing full opioid effects, and naloxone, an opioid antagonist that discourages misuse by blocking opioid effects if injected; together, they stabilize opioid receptors and help prevent relapse."
      },
      {
        "name": "Sudafed",
        "description": "Used to relieve nasal and sinus congestion and pressure caused by the common cold, sinusitis, hay fever, and upper respiratory allergies. Also helps clear congestion of the eustachian tubes that drain fluid from the inner ears.",
        "alternate_names": ["pseudoephedrine", "Chlor Trimeton Nasal Decongestant", "Contac Cold"],
        "mechanism_of_action": "Shrinks blood vessels in the nasal passages by stimulating alpha-adrenergic receptors, leading to reduced swelling and congestion; also promotes release of norepinephrine, further activating adrenergic receptors to open nasal airways."
      },
      {
        "name": "Sulfasalazine",
        "description": "Used to treat and prevent mild to moderate ulcerative colitis, manage rheumatoid arthritis (especially in patients who have not responded to or cannot tolerate other treatments), and polyarticular-course juvenile rheumatoid arthritis. It is also sometimes used for Crohn’s disease, psoriatic arthritis, and other inflammatory bowel diseases or arthritis-related conditions.",
        "alternate_names": ["Azulfidine", "Sulfazine", "Salazopyrin"],
        "mechanism_of_action": "Broken down by colon bacteria into sulfapyridine and 5-aminosalicylic acid (5-ASA); 5-ASA reduces inflammation in the colon by blocking inflammatory chemicals like prostaglandins and leukotrienes, while sulfapyridine has immune-modulating effects. Together, they lower inflammation and help control symptoms."
      },
      {
        "name": "Sumatriptan",
        "description": "Used to treat acute migraine attacks with or without aura and to relieve symptoms of cluster headaches. It is taken at the onset of headache to reduce pain, nausea, and sensitivity to light or sound, but does not prevent future attacks or reduce their frequency.",
        "alternate_names": ["Imitrex", "Sumavel DosePro", "Zembrace SymTouch"],
        "mechanism_of_action": "Acts as a selective serotonin (5-HT1B/1D) receptor agonist, narrowing blood vessels in the brain and blocking pain signals and the release of inflammatory substances, thereby relieving headache symptoms."
      },
      {
        "name": "Symbicort",
        "description": "Used as a long-term maintenance treatment to control and prevent symptoms of asthma in adults and children ages 6 and older, especially when asthma is not well-controlled on other medications. Also prescribed to improve symptoms and reduce exacerbations in chronic obstructive pulmonary disease (COPD), including chronic bronchitis and emphysema. Not intended for relief of acute asthma or COPD attacks.",
        "alternate_names": ["budesonide/formoterol", "Breyana", "Symbicort Aerosphere"],
        "mechanism_of_action": "Combines budesonide, a corticosteroid that reduces inflammation in the airways, with formoterol, a long-acting beta2-agonist that relaxes airway muscles to improve breathing and keep airways open."
      },
      {
        "name": "Synthroid",
        "description": "Used to treat hypothyroidism (underactive thyroid), certain types of goiter (enlarged thyroid gland), and to suppress thyroid-stimulating hormone (TSH) as part of the management of some thyroid cancers. It replaces or supplements the body’s natural thyroid hormone to restore normal metabolic activity and is approved for use in both adults and children.",
        "alternate_names": ["levothyroxine", "Unithroid", "Euthyrox"],
        "mechanism_of_action": "Acts as a synthetic form of thyroxine (T4), the main hormone produced by the thyroid gland. It is converted in the body to the active hormone triiodothyronine (T3), which binds to nuclear thyroid receptors and regulates gene expression to maintain normal metabolism, growth, and development."
      },
      {
        "name": "Tacrolimus",
        "description": "Used to prevent organ rejection after solid organ transplants (such as kidney, liver, heart, and lung) by suppressing the immune system. Also used topically to treat moderate to severe atopic dermatitis (eczema) in patients who have not responded to other treatments, and sometimes for other autoimmune or inflammatory conditions.",
        "alternate_names": ["Prograf", "Astagraf XL", "Envarsus XR", "Protopic"],
        "mechanism_of_action": "Blocks calcineurin by binding to FKBP-12 in immune cells, which inhibits T-cell activation and the production of inflammatory cytokines (such as IL-2), thereby reducing immune responses that can lead to organ rejection or skin inflammation."
      },
      {
        "name": "Tadalafil",
        "description": "Used to treat erectile dysfunction (trouble getting or keeping an erection), symptoms of benign prostatic hyperplasia (BPH) such as difficulty urinating, and pulmonary arterial hypertension (high blood pressure in the lungs). Also sometimes used off-label for Raynaud’s phenomenon and prevention of high-altitude pulmonary edema.",
        "alternate_names": ["Cialis", "Adcirca", "Alyq"],
        "mechanism_of_action": "Blocks the enzyme phosphodiesterase type 5 (PDE5), leading to relaxation of smooth muscle and increased blood flow in specific tissues. For erectile dysfunction, it increases blood flow to the penis during sexual stimulation; for BPH, it relaxes muscles in the bladder and prostate; for pulmonary arterial hypertension, it relaxes blood vessels in the lungs to lower blood pressure."
      },
      {
        "name": "Tamiflu",
        "description": "Used to treat and prevent influenza (flu) types A and B in people 2 weeks of age and older for treatment, and in people 1 year and older for prevention. It is most effective when started within 48 hours of the onset of flu symptoms and can help reduce the duration and severity of symptoms. Also used to help prevent the flu after exposure to someone with the virus, but it does not replace the annual flu vaccine and does not treat the common cold.",
        "alternate_names": ["oseltamivir", "oseltamivir phosphate", "Ebilfumin"],
        "mechanism_of_action": "Blocks the neuraminidase enzyme on the surface of influenza viruses, preventing the virus from releasing new copies of itself from infected cells, thereby limiting the spread of infection within the body."
      },
      {
        "name": "Terazosin",
        "description": "Used to treat symptoms of benign prostatic hyperplasia (BPH, enlarged prostate) such as difficulty urinating, and to lower high blood pressure (hypertension), though it is not a first-choice option for blood pressure. It may also be used off-label for conditions like chronic prostatitis, pelvic pain syndrome, and certain urinary symptoms related to other causes.",
        "alternate_names": ["Hytrin", "Tezruly", "Zayasel"],
        "mechanism_of_action": "Blocks alpha-1 adrenergic receptors in smooth muscle of blood vessels, prostate, and bladder neck, causing these muscles to relax. This lowers blood pressure by widening blood vessels and improves urine flow by reducing prostate and bladder neck resistance."
      },
      {
        "name": "Tetracycline",
        "description": "Used to treat a wide variety of bacterial infections, including acne, respiratory tract infections (such as bronchitis and pneumonia), tick-borne diseases (like Rocky Mountain spotted fever and Lyme disease), sexually transmitted infections (such as chlamydia), eye infections (trachoma, inclusion conjunctivitis), urinary tract infections, plague, cholera, anthrax, and certain infections when penicillin cannot be used. It is also effective against some parasitic infections and is sometimes used for malaria and as part of therapy for Helicobacter pylori ulcers.",
        "alternate_names": ["Achromycin V", "Sumycin", "Ala-Tet", "Panmycin"],
        "mechanism_of_action": "Blocks bacterial protein synthesis by reversibly binding to the 30S ribosomal subunit, preventing the attachment of aminoacyl-tRNA to the mRNA-ribosome complex, which stops bacteria from making proteins needed for growth and replication."
      },
      {
        "name": "Topamax",
        "description": "Used to treat and prevent seizures in adults and children with epilepsy, and to prevent migraine headaches in people 12 years and older. Also prescribed off-label for conditions such as bipolar disorder, weight loss, binge eating disorder, nerve pain, and certain psychiatric or headache disorders.",
        "alternate_names": ["topiramate", "Trokendi XR", "Qudexy XR", "Eprontia"],
        "mechanism_of_action": "Calms overactive nerve cells by blocking sodium channels, enhancing the activity of GABA (an inhibitory neurotransmitter), blocking glutamate (an excitatory neurotransmitter), and reducing excessive electrical activity in the brain, which helps prevent seizures and migraine episodes."
      },
      {
        "name": "Toradol",
        "description": "Used for short-term (up to 5 days) management of moderate to severe acute pain, often after surgery or other medical procedures, when pain relief at the opioid level is needed but without the risk of dependence. Not indicated for minor or chronic pain, and not recommended for use in children or for more than 5 days due to risk of serious side effects.",
        "alternate_names": ["ketorolac", "Sprix", "Acular"],
        "mechanism_of_action": "Blocks both cyclooxygenase-1 (COX-1) and cyclooxygenase-2 (COX-2) enzymes, reducing the production of prostaglandins-chemicals that cause pain, inflammation, and fever-thereby providing potent pain relief and anti-inflammatory effects."
      },
      {
        "name": "Trazodone",
        "description": "Used primarily to treat major depressive disorder. It is also prescribed off-label for anxiety disorders, insomnia, post-traumatic stress disorder (PTSD), obsessive-compulsive disorder (OCD), and to augment other antidepressants, especially when insomnia or agitation is present. It may help improve mood, appetite, energy, and decrease anxiety and insomnia related to depression.",
        "alternate_names": ["Desyrel", "Oleptro", "Trittico", "Trazorel", "Molipaxin"],
        "mechanism_of_action": "Inhibits the reuptake of serotonin and blocks certain serotonin (5-HT2A, 5-HT2C), histamine (H1), and alpha-1 adrenergic receptors in the brain, which helps restore neurotransmitter balance to relieve depression, anxiety, and insomnia."
      },
      {
        "name": "Trelegy Ellipta",
        "description": "Used as a once-daily maintenance inhaler to treat and control symptoms of chronic obstructive pulmonary disease (COPD)-including chronic bronchitis and emphysema-and asthma in adults. It helps improve lung function, reduce symptoms such as wheezing and shortness of breath, and decrease the frequency of disease flare-ups. Trelegy Ellipta is not a rescue inhaler and should not be used for sudden breathing problems.",
        "alternate_names": ["fluticasone/umeclidinium/vilanterol", "Trelegy", "Trelegy Ellipta"],
        "mechanism_of_action": "Combines three medications: fluticasone furoate (an inhaled corticosteroid that reduces airway inflammation), umeclidinium (a long-acting muscarinic antagonist that relaxes airway muscles by blocking acetylcholine), and vilanterol (a long-acting beta2-adrenergic agonist that relaxes airway muscles by stimulating beta2 receptors). Together, they decrease inflammation and keep airways open for easier breathing."
      },
      {
        "name": "Trileptal",
        "description": "Used to treat partial-onset (focal) seizures in adults and children, either alone or in combination with other medications. It is prescribed for epilepsy to help control abnormal electrical activity in the brain but does not cure the underlying condition.",
        "alternate_names": ["oxcarbazepine", "Oxtellar XR"],
        "mechanism_of_action": "Blocks voltage-sensitive sodium channels in nerve cells, stabilizing overactive brain cells and reducing the spread of abnormal electrical activity that leads to seizures. Its main antiseizure effects come from its active metabolite, which further helps prevent repetitive neuronal firing."
      },
      {
        "name": "Trulicity",
        "description": "Used to improve blood sugar control in adults and children 10 years and older with type 2 diabetes, alongside diet and exercise. Also prescribed to reduce the risk of major cardiovascular events (such as heart attack and stroke) in adults with type 2 diabetes who have established heart disease or multiple cardiovascular risk factors.",
        "alternate_names": ["dulaglutide", "Trulicity pen"],
        "mechanism_of_action": "Mimics the natural hormone GLP-1 by binding to GLP-1 receptors, which stimulates insulin release when blood sugar is high, lowers glucagon secretion from the liver, and slows stomach emptying, resulting in better blood sugar control."
      },
      {
        "name": "Unasyn",
        "description": "Used to treat a wide range of bacterial infections, including skin and soft tissue infections, intra-abdominal infections, and gynecological infections caused by susceptible bacteria, especially when resistance to standard penicillins is suspected or confirmed.",
        "alternate_names": ["ampicillin and sulbactam", "ampicillin/sulbactam"],
        "mechanism_of_action": "Combines a penicillin antibiotic that kills bacteria by disrupting cell wall synthesis with a beta-lactamase inhibitor that protects the antibiotic from bacterial enzymes, broadening its effectiveness against resistant bacteria."
      },
      {
        "name": "Valacyclovir",
        "description": "Used to treat and prevent outbreaks of infections caused by herpes viruses, including genital herpes, cold sores (oral herpes), shingles (herpes zoster), and chickenpox in children. Also helps reduce the spread and recurrence of genital herpes.",
        "alternate_names": ["Valtrex", "valaciclovir"],
        "mechanism_of_action": "Converted in the body to acyclovir, which blocks viral DNA polymerase, stopping the herpes virus from replicating its genetic material and spreading in the body."
      },
      {
        "name": "Valium",
        "description": "Used to treat anxiety disorders, muscle spasms, alcohol withdrawal symptoms, certain types of seizures, and sometimes for sedation before medical procedures. It is also used as an adjunct in the management of acute agitation and for short-term relief of insomnia or panic attacks.",
        "alternate_names": ["diazepam", "Libervant"],
        "mechanism_of_action": "Enhances the effect of the neurotransmitter GABA at GABA-A receptors in the brain, leading to calming, muscle-relaxing, anticonvulsant, and sedative effects."
      },
      {
        "name": "Valproic acid",
        "description": "Used to treat various types of seizures in epilepsy, manage manic episodes in bipolar disorder, and prevent migraine headaches. It may also be used off-label for aggression and other psychiatric or neurological conditions.",
        "alternate_names": ["Depakene", "Stavzor", "Depacon"],
        "mechanism_of_action": "Increases levels of the inhibitory neurotransmitter GABA and blocks voltage-gated sodium channels, stabilizing brain activity to reduce seizures and mood swings."
      },
      {
        "name": "Valsartan",
        "description": "Used to treat high blood pressure (hypertension), heart failure, and to improve survival and reduce the risk of hospitalization after a heart attack. Also helps lower the risk of stroke and other cardiovascular events in at-risk patients.",
        "alternate_names": ["Diovan", "Prexxartan"],
        "mechanism_of_action": "Blocks angiotensin II type 1 (AT1) receptors, preventing angiotensin II from tightening blood vessels and causing the body to retain sodium, resulting in relaxed blood vessels, lower blood pressure, and reduced strain on the heart."
      },
      {
        "name": "Valtoco",
        "description": "Used for the acute treatment of seizure clusters (also known as acute repetitive seizures) in adults and children 2 years and older, providing rapid relief from episodes that differ from a person’s usual seizure pattern.",
        "alternate_names": [ "diazepam nasal spray", "Valtoco"],
        "mechanism_of_action": "Enhances the effects of GABA, a calming neurotransmitter, by binding to GABA-A receptors in the brain, which increases inhibitory signals and helps stop abnormal electrical activity during seizures."
      },
      {
        "name": "Vancomycin",
        "description": "Used to treat serious infections caused by susceptible Gram-positive bacteria, including methicillin-resistant Staphylococcus aureus (MRSA), severe skin, bone, blood, heart (endocarditis), lung, and intestinal infections (such as Clostridioides difficile colitis), especially when other antibiotics are ineffective or not tolerated.",
        "alternate_names": ["Vancocin", "Firvanq", "Lyphocin"],
        "mechanism_of_action": "Binds to the D-Ala-D-Ala portion of bacterial cell wall precursors, blocking cell wall synthesis and cross-linking, which weakens and destroys susceptible Gram-positive bacteria."
      },
      {
        "name": "Vibramycin",
        "description": "Used to treat a wide range of bacterial infections, including respiratory tract infections, urinary tract infections, acne, skin and soft tissue infections, sexually transmitted infections (such as chlamydia and gonorrhea), certain eye infections, tick-borne illnesses (like Lyme disease and Rocky Mountain spotted fever), and to prevent malaria. Also used for inflammatory skin conditions like rosacea and as an alternative when penicillin cannot be used.",
        "alternate_names": ["doxycycline", "Acticlate", "Doryx"],
        "mechanism_of_action": "Stops bacterial growth by binding to the 30S ribosomal subunit, blocking protein synthesis needed for bacteria to multiply."
      },
      {
        "name": "Vimpat",
        "description": "Used to treat partial-onset (focal) seizures in adults and children 1 month and older, either alone or with other medications, and as adjunctive therapy for primary generalized tonic-clonic seizures in patients 4 years and older.",
        "alternate_names": ["lacosamide", "Vimpat"],
        "mechanism_of_action": "Stabilizes overactive brain cells by selectively enhancing slow inactivation of voltage-gated sodium channels, reducing abnormal electrical activity that leads to seizures."
      },
      {
        "name": "Vistaril",
        "description": "Used to treat anxiety and tension, relieve itching from allergic conditions, help induce sleep before surgery, and manage symptoms of nausea, vomiting, and agitation. Also used as a sedative and for short-term management of insomnia or as an adjunct in certain medical procedures.",
        "alternate_names": ["hydroxyzine", "Atarax"],
        "mechanism_of_action": "Blocks histamine H1 receptors in the brain, producing antihistamine and sedative effects; also antagonizes serotonin and other receptors, which contributes to its calming and anti-anxiety properties."
      },
      {
        "name": "Voltaren",
        "description": "Used to relieve pain, swelling, and inflammation associated with osteoarthritis, rheumatoid arthritis, ankylosing spondylitis, and acute muscle or joint injuries such as sprains and strains. Commonly applied as a topical gel for joint pain in the hands and knees, but also available as oral tablets, suppositories, and eye drops for other pain and inflammatory conditions.",
        "alternate_names": ["diclofenac", "Cataflam", "Zorvolex"],
        "mechanism_of_action": "Blocks cyclooxygenase (COX-1 and COX-2) enzymes, reducing the production of prostaglandins-chemicals that cause pain, inflammation, and swelling."
      },
      {
        "name": "Vyvanse",
        "description": "Used to treat attention deficit hyperactivity disorder (ADHD) in adults and children ages 6 and older, and moderate to severe binge eating disorder in adults. Not indicated for weight loss or obesity.",
        "alternate_names": ["lisdexamfetamine", "Elvanse", "Tyvense"],
        "mechanism_of_action": "Acts as a prodrug that is converted in the body to dextroamphetamine, which increases levels of norepinephrine and dopamine in the brain by blocking their reuptake and promoting their release, leading to improved focus, impulse control, and reduced binge eating behavior."
      },
      {
        "name": "Xarelto",
        "description": "Used to treat and prevent blood clots in the legs (deep vein thrombosis, DVT) and lungs (pulmonary embolism, PE), reduce the risk of stroke and systemic embolism in people with nonvalvular atrial fibrillation, prevent blood clots after knee or hip replacement surgery, and lower the risk of heart attack, stroke, and other complications in people with coronary or peripheral artery disease. Also used in certain children for treatment and prevention of blood clots after initial anticoagulation therapy.",
        "alternate_names": [ "rivaroxaban", "Xarelto Starter Pack"],
        "mechanism_of_action": "Blocks factor Xa, an essential protein in the blood clotting process, which prevents the formation of blood clots."
      },
      {
        "name": "Xcopri",
        "description": "Used to treat partial-onset (focal) seizures in adults, either alone or with other medications, helping to reduce the frequency of seizures in people with epilepsy.",
        "alternate_names": [ "cenobamate"],
        "mechanism_of_action": "Reduces repetitive firing of brain cells by inhibiting voltage-gated sodium channels and positively modulating GABA-A ion channels, though the precise way it works to control seizures is not fully understood."
      },
      {
        "name": "Zepbound",
        "description": "Used for long-term weight management in adults with obesity or overweight (with at least one weight-related health condition), and for treating moderate to severe obstructive sleep apnea (OSA) in adults with obesity. It is prescribed alongside a reduced-calorie diet and increased physical activity.",
        "alternate_names": ["tirzepatide", "Mounjaro"],
        "mechanism_of_action": "Activates both GIP and GLP-1 receptors, which reduces appetite, slows digestion, and helps you feel full longer-leading to reduced calorie intake and weight loss."
      },
      {
        "name": "Zetia",
        "description": "Used to lower high cholesterol, especially LDL (“bad”) cholesterol, in adults and children. Also prescribed for certain genetic cholesterol disorders (such as familial hypercholesterolemia and sitosterolemia), often as an add-on to statins or other cholesterol-lowering medications when diet and exercise alone are insufficient.",
        "alternate_names": ["ezetimibe", "Ezetrol"],
        "mechanism_of_action": "Blocks the absorption of cholesterol in the small intestine by inhibiting the NPC1L1 protein, reducing the amount of cholesterol delivered to the liver and lowering blood cholesterol levels."
      },
      {
        "name": "Zofran",
        "description": "Used to prevent nausea and vomiting caused by chemotherapy, radiation therapy, and surgery. Also prescribed for other causes of severe nausea and vomiting as determined by a healthcare provider.",
        "alternate_names": ["ondansetron", "Zuplenz"],
        "mechanism_of_action": "Blocks 5-HT3 (serotonin) receptors in the gut and brain, preventing signals that trigger nausea and vomiting."
      },
      {
        "name": "Zoloft",
        "description": "Used to treat major depressive disorder, obsessive-compulsive disorder (OCD), panic disorder, post-traumatic stress disorder (PTSD), social anxiety disorder, and premenstrual dysphoric disorder (PMDD). Also prescribed for generalized anxiety disorder and other mental health conditions as determined by a healthcare provider.",
        "alternate_names": ["sertraline", "Lustral"],
        "mechanism_of_action": "Increases serotonin levels in the brain by selectively blocking its reuptake into nerve cells, helping to improve mood, reduce anxiety, and relieve symptoms of depression and related disorders."
      },
      {
        "name": "Zosyn",
        "description": "Used to treat a wide range of serious bacterial infections, including intra-abdominal infections (such as complicated appendicitis and peritonitis), hospital-acquired pneumonia, skin and soft tissue infections (including diabetic foot infections), female pelvic infections, and community-acquired pneumonia in adults and children 2 months and older.",
        "alternate_names": ["piperacillin and tazobactam", "piperacillin/tazobactam"],
        "mechanism_of_action": "Combines a penicillin antibiotic that kills bacteria by blocking cell wall synthesis with a beta-lactamase inhibitor that protects the antibiotic from bacterial enzymes, allowing it to work against a broader range of bacteria, including those resistant to standard penicillins."
      },
      {
        "name": "Zyprexa",
        "description": "Used to treat schizophrenia and bipolar I disorder in adults and adolescents, including manic or mixed episodes, and as part of combination therapy for depressive episodes in bipolar disorder. Also prescribed with fluoxetine for treatment-resistant depression. Available as oral tablets, orally disintegrating tablets, and intramuscular injections for acute agitation.",
        "alternate_names": ["olanzapine", "Zalasta", "Zypine"],
        "mechanism_of_action": "Blocks dopamine and serotonin (5HT2) receptors in the brain, balancing neurotransmitter activity to reduce psychotic symptoms and stabilize mood."
      },
      {
        "name": "Zyrtec",
        "description": "Used to relieve symptoms of seasonal and perennial allergies (hay fever and other upper respiratory allergies), such as sneezing, runny nose, itchy or watery eyes, and itching of the nose or throat. Also used to treat itching and swelling from chronic urticaria (hives) in adults and children.",
        "alternate_names": ["cetirizine", "Reactine", "Alleroff"],
        "mechanism_of_action": "Blocks peripheral histamine H1 receptors, preventing histamine from causing allergy symptoms like sneezing, itching, and runny nose, with minimal sedation because it does not significantly cross into the brain."
      }
  ]